const n=[{id:"heart",title:"心经",subtitle:"般若波罗蜜多心经 · 唐 玄奘译",paragraphs:["观自在菩萨行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄。","「舍利子！色不异空，空不异色，色即是空，空即是色；受、想、行、识，亦复如是。","「舍利子！是诸法空相，不生不灭，不垢不净，不增不减。是故，空中无色，无受、想、行、识；无眼、耳、鼻、舌、身、意；无色、声、香、味、触、法；无眼界，乃至无意识界；无无明亦无无明尽，乃至无老死亦无老死尽；无苦、集、灭、道；无智，亦无得。","「以无所得故，菩提萨埵依般若波罗蜜多故，心无罣碍；无罣碍故，无有恐怖，远离颠倒梦想，究竟涅槃。三世诸佛依般若波罗蜜多故，得阿耨多罗三藐三菩提。","「故知般若波罗蜜多是大神咒、是大明咒、是无上咒、是无等等咒，能除一切苦，真实不虚，故说般若波罗蜜多咒。」","即说咒曰：","「揭帝　揭帝　般罗揭帝　般罗僧揭帝　菩提　莎婆诃」"],source:"https://cbetaonline.dila.edu.tw/zh/T08n0251",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T08/T08n0251.xml",sourceLabel:"CBETA T08n0251",scope:"全经正文",originalTitle:"般若波羅蜜多心經",juan:[1]},{id:"medicine",title:"药师经",subtitle:"药师琉璃光如来本愿功德经 · 唐 玄奘译",paragraphs:["如是我闻：","一时，薄伽梵游化诸国，至广严城，住乐音树下。与大苾刍众八千人俱，菩萨摩诃萨三万六千，及国王、大臣、婆罗门、居士、天、龙、药叉、人、非人等，无量大众，恭敬围绕，而为说法。","尔时，曼殊室利法王子，承佛威神，从座而起，偏袒一肩，右膝著地，向薄伽梵，曲躬合掌，白言：「世尊！惟愿演说如是相类诸佛名号，及本大愿殊胜功德，令诸闻者业障销除，为欲利乐像法转时诸有情故。」","尔时，世尊赞曼殊室利童子言：「善哉！善哉！曼殊室利！汝以大悲，劝请我说诸佛名号、本愿功德，为拔业障所缠有情，利益安乐像法转时诸有情故。汝今谛听，极善思惟，当为汝说。」曼殊室利言：「唯然！愿说，我等乐闻。」","佛告曼殊室利：「东方去此过十殑伽沙等佛土，有世界名净琉璃，佛号药师琉璃光如来、应、正等觉、明行圆满、善逝、世间解、无上丈夫、调御士、天人师、佛、薄伽梵。曼殊室利！彼佛世尊药师琉璃光如来，本行菩萨道时，发十二大愿，令诸有情，所求皆得。","「第一大愿：愿我来世得阿耨多罗三藐三菩提时，自身光明，炽然照曜无量无数无边世界，以三十二大丈夫相、八十随好，庄严其身；令一切有情，如我无异。","「第二大愿：愿我来世得菩提时，身如琉璃，内外明彻，净无瑕秽，光明广大，功德巍巍，身善安住，焰网庄严，过于日月；幽冥众生，悉蒙开晓，随意所趣，作诸事业。","「第三大愿：愿我来世得菩提时，以无量无边智慧方便，令诸有情，皆得无尽所受用物，莫令众生有所乏少。","「第四大愿：愿我来世得菩提时，若诸有情行邪道者，悉令安住菩提道中；若行声闻独觉乘者，皆以大乘而安立之。","「第五大愿：愿我来世得菩提时，若有无量无边有情，于我法中修行梵行，一切皆令得不缺戒，具三聚戒。设有毁犯，闻我名已，还得清净，不堕恶趣。","「第六大愿：愿我来世得菩提时，若诸有情，其身下劣，诸根不具，丑陋、顽愚、盲、聋、瘖、痖、挛、躄、背偻、白癞、癫狂、种种病苦；闻我名已，一切皆得端正黠慧。诸根完具，无诸疾苦。","「第七大愿：愿我来世得菩提时，若诸有情，众病逼切，无救无归，无医无药，无亲无家，贫穷多苦，我之名号，一经其耳，病悉得除，身心安乐，家属资具，悉皆丰足，乃至证得无上菩提。","「第八大愿：愿我来世得菩提时，若有女人，为女百恶之所逼恼，极生厌离，愿舍女身；闻我名已，一切皆得转女成男，具丈夫相，乃至证得无上菩提。","「第九大愿：愿我来世得菩提时，令诸有情，出魔羂网，解脱一切外道缠缚；若堕种种恶见稠林，皆当引摄置于正见，渐令修习诸菩萨行，速证无上正等菩提。","「第十大愿：愿我来世得菩提时，若诸有情，王法所录，缧缚鞭挞，系闭牢狱，或当刑戮，及余无量灾难凌辱，悲愁煎迫，身心受苦；若闻我名，以我福德威神力故，皆得解脱一切忧苦。","「第十一大愿：愿我来世得菩提时，若诸有情，饥渴所恼，为求食故造诸恶业；得闻我名，专念受持，我当先以上妙饮食，饱足其身；后以法味，毕竟安乐而建立之。","「第十二大愿：愿我来世得菩提时，若诸有情，贫无衣服，蚊虻寒热，昼夜逼恼；若闻我名，专念受持，如其所好，即得种种上妙衣服，亦得一切宝庄严具，华鬘涂香，鼓乐众伎，随心所玩，皆令满足。","「曼殊室利！是为彼世尊药师琉璃光如来、应、正等觉，行菩萨道时，所发十二微妙上愿。","「复次，曼殊室利！彼世尊药师琉璃光如来，行菩萨道时所发大愿，及彼佛土功德庄严，我若一劫，若一劫余，说不能尽。然彼佛土，一向清净，无有女人，亦无恶趣，及苦音声。琉璃为地，金绳界道，城、阙、宫、阁、轩、窓、罗网，皆七宝成。亦如西方极乐世界，功德庄严，等无差别。于其国中，有二菩萨摩诃萨：一名日光遍照，二名月光遍照，是彼无量无数菩萨众之上首，悉能持彼世尊药师琉璃光如来正法宝藏。是故，曼殊室利！诸有信心善男子、善女人等，应当愿生彼佛世界。」","尔时，世尊复告曼殊室利童子言：「曼殊室利！有诸众生，不识善恶，唯怀贪悋，不知布施及施果报，愚痴无智，阙于信根，多聚财宝，勤加守护；见乞者来，其心不喜，设不获已而行施时，如割身肉，深生痛惜。复有无量悭贪有情，积集资财，于其自身尚不受用，何况能与父母、妻子、奴婢、作使，及来乞者？彼诸有情，从此命终，生饿鬼界，或傍生趣。由昔人间，曾得暂闻药师琉璃光如来名故，今在恶趣，暂得忆念彼如来名，即于念时，从彼处没，还生人中，得宿命念，畏恶趣苦，不乐欲乐，好行惠施，赞叹施者，一切所有悉无贪惜，渐次尚能以头目手足，血肉身分，施来求者，况余财物。","「复次，曼殊室利，若诸有情，虽于如来受诸学处，而破尸罗；有虽不破尸罗，而破轨则；有于尸罗、轨则，虽得不坏，然毁正见；有虽不毁正见，而弃多闻，于佛所说契经深义不能解了；有虽多闻而增上慢，由增上慢覆蔽心故，自是非他，嫌谤正法，为魔伴党。如是愚人，自行邪见，复令无量俱胝有情，堕大险坑。此诸有情，应于地狱、傍生、鬼趣，流转无穷。若得闻此药师琉璃光如来名号，便舍恶行，修诸善法，不堕恶趣，设有不能舍诸恶行，修行善法，堕恶趣者，以彼如来本愿威力，令其现前暂闻名号，从彼命终还生人趣，得正见精进，善调意乐，便能舍家趣于非家，如来法中，受持学处，无有毁犯；正见多闻，解甚深义，离增上慢，不谤正法，不为魔伴，渐次修行诸菩萨行，速得圆满。","「复次，曼殊室利！若诸有情，悭贪嫉妬，自赞毁他，当堕三恶趣中，无量千岁受诸剧苦；受剧苦已，从彼命终，来生人间，作牛、马、驼、驴，恒被鞭挞，饥渴逼恼；又常负重，随路而行。或得为人，生居下贱，作人奴婢，受他驱役，恒不自在。若昔人中，曾闻世尊药师琉璃光如来名号，由此善因，今复忆念，至心归依。以佛神力，众苦解脱，诸根聪利，智慧多闻，恒求胜法，常遇善友，永断魔羂，破无明㲉，竭烦恼河，解脱一切生、老、病、死，忧悲、苦恼。","「复次，曼殊室利！若诸有情，好憙乖离，更相鬪讼，恼乱自他，以身语意，造作增长种种恶业，展转常为不饶益事，互相谋害。告召山林树冢等神；杀诸众生，取其血肉，祭祀药叉罗刹娑等；书怨人名，作其形像，以恶呪术而呪诅之；厌媚蛊道，呪起尸鬼，令断彼命，及坏其身。是诸有情，若得闻此药师琉璃光如来名号，彼诸恶事，悉不能害。一切展转皆起慈心，利益安乐，无损恼意及嫌恨心；各各欢悦，于自所受生于喜足，不相侵凌，互为饶益。","「复次，曼殊室利！若有四众：苾刍、苾刍尼、邬波索迦、邬波斯迦，及余净信善男子、善女人等，有能受持八分斋戒，或经一年，或复三月，受持学处，以此善根，愿生西方极乐世界无量寿佛所，听闻正法，而未定者。若闻世尊药师琉璃光如来名号，临命终时，有八菩萨，乘神通来，示其道路，即于彼界种种杂色众宝华中，自然化生。或有因此生于天上，虽生天中，而本善根亦未穷尽，不复更生诸余恶趣。天上寿尽，还生人间，或为轮王，统摄四洲，威德自在，安立无量百千有情于十善道；或生刹帝利、婆罗门、居士大家，多饶财宝，仓库盈溢，形相端严，眷属具足，聪明智慧，勇健威猛，如大力士。若是女人，得闻世尊药师如来名号，至心受持，于后不复更受女身。」","尔时，曼殊室利童子白佛言：「世尊！我当誓于像法转时，以种种方便，令诸净信善男子、善女人等，得闻世尊药师琉璃光如来名号，乃至睡中亦以佛名觉悟其耳。世尊！若于此经受持读诵，或复为他演说开示；若自书，若教人书；恭敬尊重，以种种花香、涂香、末香、烧香、花鬘、璎珞、幡盖、伎乐，而为供养；以五色彩，作囊盛之；扫洒净处，敷设高座，而用安处。尔时，四大天王与其眷属，及余无量百千天众，皆诣其所，供养守护。世尊！若此经宝流行之处，有能受持，以彼世尊药师琉璃光如来本愿功德，及闻名号，当知是处无复横死；亦复不为诸恶鬼神，夺其精气；设已夺者，还得如故，身心安乐。」","佛告曼殊室利：「如是！如是！如汝所说。曼殊室利！若有净信善男子、善女人等，欲供养彼世尊药师琉璃光如来者，应先造立彼佛形像，敷清净座而安处之；散种种花，烧种种香，以种种幢幡庄严其处；七日七夜，受持八分斋戒，食清净食，澡浴香洁，著新净衣，应生无垢浊心，无怒害心，于一切有情，起利益安乐，慈、悲、喜、舍，平等之心，鼓乐歌赞，右绕佛像。复应念彼如来本愿功德，读诵此经，思惟其义，演说开示。随所乐愿，一切皆遂：求长寿得长寿，求富饶得富饶，求官位得官位，求男女得男女。若复有人，忽得恶梦，见诸恶相，或怪鸟来集，或于住处，百怪出现；此人若以众妙资具，恭敬供养彼世尊药师琉璃光如来者，恶梦恶相，诸不吉祥，皆悉隐没，不能为患。或有水、火、刀、毒、悬崄、恶象、师子、虎、狼、熊、罴、毒蛇、恶蝎、蜈蚣、蚰蜒、蚊虻等怖；若能至心忆念彼佛，恭敬供养，一切怖畏皆得解脱。若他国侵扰，盗贼反乱；忆念恭敬彼如来者，亦皆解脱。","「复次，曼殊室利！若有净信善男子、善女人等，乃至尽形不事余天，惟当一心归佛、法、僧，受持禁戒，若五戒、十戒、菩萨四百戒、苾刍二百五十戒、苾刍尼五百戒，于所受中或有毁犯，怖堕恶趣，若能专念彼佛名号，恭敬供养者，必定不受三恶趣生。或有女人，临当产时，受于极苦；若能至心称名礼赞，恭敬供养彼如来者，众苦皆除。所生之子，身分具足，形色端正，见者欢喜，利根聪明，安隐少病，无有非人，夺其精气。」","尔时，世尊告阿难言：「如我称扬彼佛世尊药师琉璃光如来所有功德，此是诸佛甚深行处，难可解了，汝为信不？」阿难白言：「大德世尊！我于如来所说契经，不生疑惑；所以者何？一切如来身语意业，无不清净。世尊！此日月轮，可令堕落；妙高山王，可使倾动，诸佛所言，无有异也。世尊！有诸众生，信根不具，闻说诸佛甚深行处，作是思惟：云何但念药师琉璃光如来一佛名号，便获尔所功德胜利？由此不信，反生诽谤；彼于长夜，失大利乐，堕诸恶趣，流转无穷。」佛告阿难：「是诸有情，若闻世尊药师琉璃光如来名号，至心受持，不生疑惑，堕恶趣者，无有是处。阿难！此是诸佛甚深所行，难可信解；汝今能受，当知皆是如来威力。阿难！一切声闻、独觉，及未登地诸菩萨等，皆悉不能如实信解；惟除一生所系菩萨。阿难！人身难得，于三宝中，信敬尊重，亦难可得；得闻世尊药师琉璃光如来名号，复难于是。阿难！彼药师琉璃光如来，无量菩萨行；无量善巧方便；无量广大愿；我若一劫，若一劫余而广说者，劫可速尽，彼佛行愿，善巧方便，无有尽也。」","尔时，众中有一菩萨摩诃萨，名曰救脱，即从座起，偏袒右肩，右膝著地，曲躬合掌而白佛言：「大德世尊！像法转时，有诸众生，为种种患之所困厄，长病羸瘦，不能饮食，喉唇干燥，见诸方暗，死相现前；父母、亲属、朋友、知识，啼泣围绕。然彼自身，卧在本处，见琰魔使，引其神识，至于琰魔法王之前；然诸有情，有俱生神，随其所作，若罪若福，皆具书之，尽持授与琰魔法王。尔时，彼王推问其人，算计所作，随其罪福而处断之。时，彼病人亲属、知识，若能为彼归依世尊药师琉璃光如来，请诸众僧，转读此经，然七层之灯，悬五色续命神幡，或有是处，彼识得还。如在梦中，明了自见；或经七日，或二十一日，或三十五日，或四十九日，彼识还时，如从梦觉，皆自忆知善不善业所得果报。由自证见业果报故，乃至命难，亦不造作诸恶之业。是故，净信善男子、善女人等，皆应受持药师琉璃光如来名号，随力所能，恭敬供养。」","尔时，阿难问救脱菩萨曰：「善男子！应云何恭敬供养彼世尊药师琉璃光如来续命幡灯，复云何造？」救脱菩萨言：「大德！若有病人，欲脱病苦，当为其人，七日七夜，受持八分斋戒，应以饮食及余资具，随力所办，供养苾刍僧；昼夜六时，礼拜供养彼世尊药师琉璃光如来；读诵此经四十九遍；然四十九灯；造彼如来形像七躯，一一像前各置七灯，一一灯量大如车轮，乃至四十九日，光明不绝；造五色彩幡，长四十九搩手，应放杂类众生至四十九；可得过度危厄之难，不为诸横恶鬼所持。","「复次，阿难！若刹帝利灌顶王等，灾难起时，所谓人众疾疫难，他国侵逼难，自界叛逆难，星宿变怪难，日月薄蚀难，非时风雨难，过时不雨难。彼刹帝利灌顶王等，尔时应于一切有情起慈悲心，赦诸系闭；依前所说供养之法，供养彼世尊药师琉璃光如来。由此善根，及彼如来本愿力故，令其国界即得安隐：风雨顺时，谷稼成熟；一切有情无病欢乐；于其国中，无有暴虐药叉等神恼有情者；一切恶相，皆即隐没；而刹帝利灌顶王等，寿命色力，无病自在，皆得增益。阿难！若帝后、妃主、储君、王子、大臣、辅相、中宫婇女、百官、黎庶，为病所苦，及余厄难；亦应造立五色神幡，然灯续明，放诸生命，散杂色华，烧众名香，病得除愈，众难解脱。」","尔时，阿难问救脱菩萨言：「善男子！云何已尽之命而可增益？」救脱菩萨言：「大德！汝岂不闻如来说有九横死耶？是故劝造续命幡灯，修诸福德；以修福故，尽其寿命，不经苦患。」阿难问言：「九横云何？」救脱菩萨言：「若诸有情，得病虽轻，然无医药及看病者，设复遇医，授以非药，实不应死而便横死。又信世间邪魔、外道、妖𦾨之师，妄说祸福，便生恐动，心不自正，卜问觅祸，杀种种众生，解奏神明，呼诸魍魉，请乞福祐，欲冀延年，终不能得；愚痴迷惑，信邪倒见，遂令横死，入于地狱，无有出期，是名初横。二者，横被王法之所诛戮。三者，畋猎嬉戏，耽婬嗜酒，放逸无度，横为非人夺其精气。四者，横为火焚。五者，横为水溺。六者，横为种种恶兽所噉。七者，横堕山崖。八者，横为毒药、厌祷、呪诅、起尸鬼等之所中害。九者，饥渴所困，不得饮食而便横死。是为如来略说横死，有此九种。其余复有无量诸横，难可具说。","「复次，阿难！彼琰魔王主领世间名籍之记。若诸有情，不孝五逆，破辱三宝，坏君臣法，毁于信戒，琰魔法王，随罪轻重，考而罚之。是故我今劝诸有情，然灯造幡，放生修福，令度苦厄，不遭众难。」","尔时，众中有十二药叉大将，俱在会坐，所谓：",`宫毘罗大将，　伐折罗大将，
迷企罗大将，　安底罗大将，
頞儞罗大将，　珊底罗大将，
因达罗大将，　波夷罗大将，
摩虎罗大将，　真达罗大将，
招杜罗大将，　毘羯罗大将。`,"此十二药叉大将，一一各有七千药叉以为眷属，同时举声白佛言：「世尊！我等今者，蒙佛威力，得闻世尊药师琉璃光如来名号，不复更有恶趣之怖。我等相率，皆同一心，乃至尽形归佛法僧，誓当荷负一切有情，为作义利饶益安乐。随于何等村城、国邑、空闲林中，若有流布此经，或复受持药师琉璃光如来名号，恭敬供养者，我等眷属卫护是人，皆使解脱一切苦难；诸有愿求，悉令满足。或有疾厄求度脱者，亦应读诵此经，以五色缕，结我名字，得如愿已，然后解结。」","尔时，世尊赞诸药叉大将言：「善哉！善哉！大药叉将！汝等念报世尊药师琉璃光如来恩德者，常应如是利益安乐一切有情。」","尔时，阿难白佛言：「世尊！当何名此法门？我等云何奉持？」佛告阿难：「此法门名说药师琉璃光如来本愿功德；亦名说十二神将饶益有情结愿神呪；亦名拔除一切业障；应如是持。」时薄伽梵说是语已，诸菩萨摩诃萨，及大声闻，国王、大臣、婆罗门、居士，天、龙、药叉、揵达缚、阿素洛、揭路荼、紧捺洛、莫呼洛伽，人、非人等，一切大众，闻佛所说，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T14n0450",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T14/T14n0450.xml",sourceLabel:"CBETA T14n0450",scope:"全经正文",originalTitle:"藥師琉璃光如來本願功德經",juan:[1]},{id:"perfect-enlightenment",title:"圆觉经",subtitle:"大方广圆觉修多罗了义经 · 唐 佛陀多罗译",paragraphs:["如是我闻：","一时，婆伽婆入于神通大光明藏，三昧正受，一切如来光严住持，是诸众生清净觉地；身心寂灭平等本际，圆满十方不二随顺，于不二境现诸净土。与大菩萨摩诃萨十万人俱，其名曰文殊师利菩萨、普贤菩萨、普眼菩萨、金刚藏菩萨、弥勒菩萨、清净慧菩萨、威德自在菩萨、辩音菩萨、净诸业障菩萨、普觉菩萨、圆觉菩萨、贤善首菩萨等，而为上首；与诸眷属皆入三昧，同住如来平等法会。","于是文殊师利菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！愿为此会诸来法众，说于如来本起清净因地法行，及说菩萨于大乘中发清净心，远离诸病，能使未来末世众生求大乘者不堕邪见。」作是语已五体投地，如是三请终而复始。","尔时，世尊告文殊师利菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨咨询如来因地法行，及为末世一切众生求大乘者，得正住持不堕邪见。汝今谛听！当为汝说。」时，文殊师利菩萨奉教欢喜，及诸大众默然而听。","「善男子！无上法王有大陀罗尼门，名为圆觉，流出一切清净真如菩提涅槃及波罗蜜教授菩萨。一切如来本起因地，皆依圆照清净觉相，永断无明方成佛道。云何无明？善男子！一切众生从无始来种种颠倒，犹如迷人四方易处，妄认四大为自身相，六尘缘影为自心相；譬彼病目见空中花及第二月。善男子！空实无花，病者妄执。由妄执故，非唯惑此虚空自性，亦复迷彼实花生处，由此妄有轮转生死，故名无明。善男子！此无明者非实有体，如梦中人梦时非无，及至于醒了无所得；如众空花灭于虚空，不可说言有定灭处，何以故？无生处故。一切众生于无生中，妄见生灭，是故说名轮转生死。善男子！如来因地修圆觉者，知是空花，即无轮转，亦无身心受彼生死，非作故无，本性无故。彼知觉者犹如虚空，知虚空者即空花相，亦不可说无知觉性。有、无俱遣，是则名为净觉随顺。何以故？虚空性故，常不动故，如来藏中无起灭故，无知见故，如法界性究竟圆满遍十方故；是则名为因地法行。菩萨因此于大乘中发清净心，末世众生依此修行不堕邪见。」","尔时，世尊欲重宣此义而说偈言：",`「文殊汝当知，　一切诸如来，
从于本因地，　皆以智慧觉，
了达于无明。　知彼如空花，
即能免流转，　又如梦中人，
醒时不可得。　觉者如虚空，
平等不动转，　觉遍十方界，
即得成佛道。　众幻灭无处，
成道亦无得，　本性圆满故。
菩萨于此中，　能发菩提心，
末世诸众生，　修此免邪见。」`,"于是普贤菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！愿为此会诸菩萨众，及为末世一切众生修大乘者，闻此圆觉清净境界，云何修行？世尊！若彼众生，知如幻者，身心亦幻，云何以幻还修于幻？若诸幻性，一切尽灭，则无有心，谁为修行？云何复说修行如幻？若诸众生本不修行，于生死中常居幻化，曾不了知如幻境界，令妄想心云何解脱？愿为末世一切众生，作何方便渐次修习，令诸众生永离诸幻。」作是语已五体投地，如是三请终而复始。","尔时，世尊告普贤菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，修习菩萨如幻三昧，方便渐次，令诸众生得离诸幻。汝今谛听！当为汝说。」时，普贤菩萨奉教欢喜，及诸大众默然而听。","「善男子！一切众生种种幻化，皆生如来圆觉妙心，犹如空花从空而有，幻花虽灭空性不坏；众生幻心还依幻灭，诸幻尽灭觉心不动。依幻说觉亦名为幻，若说有觉犹未离幻，说无觉者亦复如是。是故，幻灭名为不动。善男子！一切菩萨及末世众生，应当远离一切幻化虚妄境界，由坚执持远离心故，心如幻者亦复远离，远离为幻亦复远离，离远离幻亦复远离，得无所离即除诸幻。譬如钻火两木相因，火出木尽灰飞烟灭；以幻修幻亦复如是，诸幻虽尽不入断灭。善男子！知幻即离，不作方便；离幻即觉，亦无渐次。一切菩萨及末世众生依此修行，如是乃能永离诸幻。」","尔时，世尊欲重宣此义而说偈言：",`「普贤汝当知，　一切诸众生，
无始幻无明，　皆从诸如来，
圆觉心建立。　犹如虚空花，
依空而有相，　空花若复灭，
虚空本不动。　幻从诸觉生，
幻灭觉圆满，　觉心不动故。
若彼诸菩萨，　及末世众生，
常应远离幻，　诸幻悉皆离。
如木中生火，　木尽火还灭，
觉则无渐次，　方便亦如是。」`,"于是普眼菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！愿为此会诸菩萨众及为末世一切众生，演说菩萨修行渐次，云何思惟？云何住持？众生未悟作何方便普令开悟？世尊！若彼众生无正方便及正思惟，闻佛如来说此三昧心生迷闷，则于圆觉不能悟入。愿兴慈悲，为我等辈及末世众生假说方便。」作是语已五体投地，如是三请终而复始。","尔时，世尊告普眼菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，问于如来修行渐次、思惟、住持乃至假说种种方便，汝今谛听！当为汝说。」时，普眼菩萨奉教欢喜，及诸大众默然而听。","「善男子！彼新学菩萨及末世众生，欲求如来净圆觉心，应当正念远离诸幻，先依如来奢摩他行，坚持禁戒，安处徒众，宴坐静室，恒作是念：『我今此身四大和合，所谓发毛、爪齿、皮肉、筋骨、髓脑、垢色皆归于地，唾涕、脓血、津液、涎沫、痰泪、精气、大小便利皆归于水，暖气归火，动转归风。四大各离，今者妄身当在何处？』即知此身毕竟无体，和合为相，实同幻化。四缘假合，妄有六根；六根、四大中外合成，妄有缘气，于中积聚，似有缘相假名为心。善男子！此虚妄心若无六尘则不能有，四大分解无尘可得，于中缘尘各归散灭，毕竟无有缘心可见。","「善男子！彼之众生幻身灭故幻心亦灭，幻心灭故幻尘亦灭，幻尘灭故幻灭亦灭，幻灭灭故非幻不灭；譬如磨镜垢尽明现。善男子！当知身心皆为幻垢，垢相永灭十方清净。善男子！譬如清净摩尼宝珠，映于五色随方各现，诸愚痴者见彼摩尼实有五色。善男子！圆觉净性现于身心随类各应，彼愚痴者说净圆觉实有如是身心自相，亦复如是；由此不能远于幻化。是故我说身心幻垢，对离幻垢说名菩萨；垢尽对除，即无对垢及说名者。","「善男子！此菩萨及末世众生，证得诸幻灭影像故，尔时便得无方清净，无边虚空觉所显发。觉圆明故显心清净，心清净故见尘清净，见清净故眼根清净，根清净故眼识清净，识清净故闻尘清净，闻清净故耳根清净，根清净故耳识清净，识清净故觉尘清净；如是乃至鼻、舌、身、意亦复如是。善男子！根清净故色尘清净，色清净故声尘清净，香、味、触、法亦复如是。善男子！六尘清净故地大清净，地清净故水大清净，火大、风大亦复如是。善男子！四大清净故，十二处、十八界、二十五有清净。彼清净故，十力、四无所畏、四无碍智、佛十八不共法、三十七助道品清净，如是乃至八万四千陀罗尼门一切清净。善男子！一切实相性清净故一身清净，一身清净故多身清净，多身清净故如是乃至十方众生圆觉清净。善男子！一世界清净故多世界清净，多世界清净故如是乃至尽于虚空圆裹三世一切平等清净不动。","「善男子！虚空如是平等不动，当知觉性平等不动；四大不动故，当知觉性平等不动；如是乃至八万四千陀罗尼门平等不动，当知觉性平等不动。善男子！觉性遍满清净不动。圆无际故，当知六根遍满法界；根遍满故，当知六尘遍满法界；尘遍满故，当知四大遍满法界；如是乃至陀罗尼门遍满法界。善男子！由彼妙觉性遍满故，根性、尘性无坏无杂；根、尘无坏故，如是乃至陀罗尼门无坏无杂；如百千灯光照一室，其光遍满无坏无杂。善男子！觉成就故，当知菩萨不与法缚，不求法脱，不厌生死，不爱涅槃，不敬持戒，不憎毁禁，不重久习，不轻初学。何以故？一切觉故，譬如眼光晓了前境，其光圆满得无憎爱，何以故？光体无二无憎爱故。","「善男子！此菩萨及末世众生，修习此心得成就者，于此无修亦无成就。圆觉普照寂灭无二，于中百千万亿不可说阿僧祇恒河沙诸佛世界，犹如空花乱起、乱灭，不即、不离，无缚、无脱；始知众生本来成佛，生死、涅槃犹如昨梦。善男子！如昨梦故，当知生死及与涅槃无起、无灭、无来、无去，其所证者无得、无失、无取、无舍，其能证者无作、无止、无任、无灭，于此证中无能、无所，毕竟无证亦无证者，一切法性平等不坏。善男子！彼诸菩萨如是修行，如是渐次，如是思惟，如是住持，如是方便，如是开悟，求如是法，亦不迷闷。」","尔时，世尊欲重宣此义而说偈言：",`「普眼汝当知，　一切诸众生，
身心皆如幻，　身相属四大，
心性归六尘。　四大体各离，
谁为和合者？　如是渐修行，
一切悉清净。　不动遍法界，
无作止任灭，　亦无能证者。
一切佛世界，　犹如虚空花，
三世悉平等，　毕竟无来去。
初发心菩萨，　及末世众生，
欲求入佛道，　应如是修习。」`,"于是金刚藏菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！善为一切诸菩萨众宣扬如来圆觉清净大陀罗尼因地法行渐次方便，与诸众生开发蒙昧；在会法众承佛慈诲，幻翳朗然，慧目清净。世尊！若诸众生本来成佛，何故复有一切无明？若诸无明众生本有，何因缘故，如来复说本来成佛？十方异生本成佛道，后起无明；一切如来，何时复生一切烦恼？唯愿不舍无遮大慈，为诸菩萨开秘密藏，及为末世一切众生，得闻如是修多罗教了义法门永断疑悔。」作是语已五体投地，如是三请终而复始。","尔时，世尊告金刚藏菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，问于如来甚深秘密究竟方便，是诸菩萨最上教诲了义大乘，能使十方修学菩萨及诸末世一切众生，得决定信，永断疑悔。汝今谛听！当为汝说。」时，金刚藏菩萨奉教欢喜，及诸大众默然而听。","「善男子！一切世界始终生灭，前后有无，聚散起止，念念相续，循环往复，种种取舍，皆是轮回。未出轮回而辨圆觉，彼圆觉性即同流转；若免轮回，无有是处。譬如动目能摇湛水；又如定眼犹回转火；云驶月运，舟行岸移亦复如是。善男子！诸旋未息，彼物先住尚不可得；何况轮转生死垢心曾未清净，观佛圆觉而不旋复？是故汝等便生三惑。","「善男子！譬如幻瞖妄见空花，幻翳若除，不可说言：『此瞖已灭，何时更起一切诸翳？』何以故？瞖花二法非相待故。亦如空花灭于空时，不可说言虚空何时更起空花？何以故？空本无花非起灭故。生死涅槃同于起灭，妙觉圆照离于花瞖。善男子！当知虚空非是暂有亦非暂无，况复如来圆觉随顺，而为虚空平等本性。","「善男子！如销金鑛，金非销有；既已成金不重为鑛，经无穷时金性不坏。不应说言本非成就，如来圆觉亦复如是。善男子！一切如来妙圆觉心本无菩提及与涅槃，亦无成佛及不成佛，无妄轮回及非轮回。","「善男子！但诸声闻所圆境界身心语言皆悉断灭，终不能至彼之亲证所现涅槃，何况能以有思惟心测度如来圆觉境界。如取萤火烧须弥山，终不能著；以轮回心生轮回见，入于如来大寂灭海，终不能至。是故我说一切菩萨及末世众生，先断无始轮回根本。善男子！有作思惟从有心起，皆是六尘，妄想缘气，非实心体，已如空花。用此思惟辨于佛境，犹如空花复结空果，展转妄想无有是处。善男子！虚妄浮心多诸巧见，不能成就圆觉方便。如是分别，非为正问。」","尔时，世尊欲重宣此义而说偈言：",`「金刚藏当知，　如来寂灭性，
未曾有终始。　若以轮回心，
思惟即旋复，　但至轮回际，
不能入佛海。　譬如销金鑛，
金非销故有，　虽复本来金，
终以销成就，　一成真金体，
不复重为鑛。　生死与涅槃，
凡夫及诸佛，　同为空花相。
思惟犹幻化，　何况诘虚妄？
若能了此心，　然后求圆觉。」`,"于是弥勒菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！广为菩萨开秘密藏，令诸大众深悟轮回、分别邪正，能施末世一切众生无畏道眼，于大涅槃生决定信，无复重随轮转境界起循环见。世尊！若诸菩萨及末世众生，欲游如来大寂灭海，云何当断轮回根本？于诸轮回有几种性？修佛菩提几等差别？回入尘劳，当设几种教化方便度诸众生？唯愿不舍救世大悲，令诸修行一切菩萨及末世众生，慧目肃清照曜心镜，圆悟如来无上知见。」作是语已五体投地，如是三请终而复始。","尔时，世尊告弥勒菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，请问如来深奥秘密微妙之义，令诸菩萨洁清慧目，及令一切末世众生永断轮回，心悟实相具无生忍。汝今谛听！当为汝说。」时，弥勒菩萨奉教欢喜，及诸大众默然而听。","「善男子！一切众生从无始际，由有种种恩爱、贪欲故有轮回。若诸世界一切种性，卵生、胎生、湿生、化生，皆因婬欲而正性命，当知轮回爱为根本。由有诸欲，助发爱性，是故能令生死相续。欲因爱生，命因欲有，众生爱命还依欲本；爱欲为因，爱命为果。由于欲境起诸违顺，境背爱心而生憎、嫉，造种种业，是故复生地狱、饿鬼；知欲可厌，爱厌业道，舍恶乐善，复现天、人；又知诸爱可厌恶故，弃爱乐舍，还滋爱本，便现有为增上善果，皆轮回故，不成圣道。是故众生欲脱生死免诸轮回，先断贪欲及除爱渴。","「善男子！菩萨变化示现世间非爱为本，但以慈悲令彼舍爱，假诸贪欲而入生死。若诸末世一切众生能舍诸欲，及除憎爱永断轮回，勤求如来圆觉境界，于清净心便得开悟。","「善男子！一切众生由本贪欲，发挥无明显出五性，差别不等；依二种障，而现深浅。云何二障？一者理障碍正知见，二者事障续诸生死。云何五性？善男子！若此二障未得断灭名未成佛；若诸众生永舍贪欲，先除事障未断理障，但能悟入声闻、缘觉，未能显住菩萨境界。善男子！若诸末世一切众生，欲泛如来大圆觉海，先当发愿勤断二障，二障已伏即能悟入菩萨境界；若事、理障已永断灭即入如来微妙圆觉，满足菩提及大涅槃。善男子！一切众生皆证圆觉，逢善知识依彼所作因地法行，尔时修习便有顿渐；若遇如来无上菩提正修行路，根无大小皆成佛果；若诸众生虽求善友遇邪见者，未得正悟，是则名为外道种性，邪师过谬，非众生咎。是名众生五性差别。","「善男子！菩萨唯以大悲方便入诸世间开发未悟，乃至示现种种形相逆顺境界，与其同事化令成佛，皆依无始清净愿力。若诸末世一切众生于大圆觉起增上心，当发菩萨清净大愿，应作是言：『愿我今者住佛圆觉，求善知识莫值外道及与二乘。』依愿修行，渐断诸障，障尽愿满，便登解脱清净法殿，证大圆觉妙庄严域。」","尔时，世尊欲重宣此义而说偈言：",`「弥勒汝当知，　一切诸众生，
不得大解脱，　皆由贪欲故，
堕落于生死。　若能断憎爱，
及与贪瞋痴，　不因差别性，
皆得成佛道。　二障永销灭，
求师得正悟，　随顺菩提愿，
依止大涅槃。　十方诸菩萨，
皆以大悲愿，　示现入生死。
现在修行者，　及末世众生，
勤断诸爱见，　便归大圆觉。」`,"于是清净慧菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！为我等辈广说如是不思议事，本所不见本所不闻，我等今者蒙佛善诱，身心泰然得大饶益，愿为一切诸来法众重宣法王圆满觉性，一切众生及诸菩萨、如来世尊所证所得云何差别？令末世众生闻此圣教，随顺开悟渐次能入。」作是语已五体投地，如是三请终而复始。","尔时，世尊告清净慧菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，请问如来渐次差别。汝今谛听！当为汝说。」时，清净慧菩萨奉教欢喜，及诸大众默然而听。","「善男子！圆觉自性，非性性有，循诸性起，无取无证，于实相中实无菩萨及诸众生。何以故？菩萨众生皆是幻化，幻化灭故无取证者。譬如眼根不自见眼，性自平等。无平等者，众生迷倒，未能除灭一切幻化，于灭未灭，妄功用中便显差别；若得如来寂灭随顺，实无寂灭及寂灭者。","「善男子！一切众生从无始来由妄想我及爱我者，曾不自知念念生灭，故起憎爱，耽著五欲；若遇善友教令开悟净圆觉性发明起灭，即知此生性自劳虑。若复有人劳虑永断得法界净，即彼净解为自障碍，故于圆觉而不自在。此名凡夫随顺觉性。","「善男子！一切菩萨，见解为碍，虽断解碍，犹住见觉，觉碍为碍而不自在；此名菩萨未入地者随顺觉性。","「善男子！有照有觉俱名障碍，是故菩萨常觉不住，照与照者同时寂灭，譬如有人自断其首，首已断故无能断者；则以碍心自灭诸碍，碍已断灭无灭碍者。修多罗教如标月指，若复见月，了知所标毕竟非月；一切如来种种言说开示菩萨亦复如是。此名菩萨已入地者随顺觉性。","「善男子！一切障碍即究竟觉，得念、失念无非解脱，成法、破法皆名涅槃，智慧、愚痴通为般若，菩萨、外道所成就法同是菩提，无明、真如无异境界，诸戒、定、慧及婬、怒、痴俱是梵行，众生、国土同一法性，地狱、天宫皆为净土，有性、无性齐成佛道；一切烦恼毕竟解脱，法界海慧照了诸相犹如虚空。此名如来随顺觉性。","「善男子！但诸菩萨及末世众生，居一切时不起妄念，于诸妄心亦不息灭，住妄想境不加了知，于无了知不辨真实。彼诸众生闻是法门，信解受持不生惊畏。是则名为随顺觉性。善男子！汝等当知！如是众生已曾供养百千万亿恒河沙诸佛及大菩萨，植众德本；佛说是人名为成就一切种智。」","尔时，世尊欲重宣此义而说偈言：",`「清净慧当知，　圆满菩提性，
无取亦无证，　无菩萨众生。
觉与未觉时，　渐次有差别，
众生为解碍，　菩萨未离觉。
入地永寂灭，　不住一切相，
大觉悉圆满，　名为遍随顺。
末世诸众生，　心不生虚妄，
佛说如是人，　现世即菩萨。
供养恒沙佛，　功德已圆满，
虽有多方便，　皆名随顺智。」`,"于是威德自在菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！广为我等分别如是随顺觉性，令诸菩萨觉心光明承佛圆音，不因修习而得善利。世尊！譬如大城外有四门，随方来者非止一路，一切菩萨庄严佛国及成菩提非一方便。唯愿世尊！广为我等宣说一切方便渐次，并修行人总有几种？令此会菩萨及末世众生求大乘者，速得开悟，游戏如来大寂灭海。」作是语已五体投地，如是三请终而复始。","尔时，世尊告威德自在菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，问于如来如是方便。汝今谛听！当为汝说。」时，威德自在菩萨奉教欢喜，及诸大众默然而听。","「善男子！无上妙觉遍诸十方出生如来，与一切法同体平等，于诸修行实无有二。方便随顺其数无量，圆摄所归，循性差别当有三种。","「善男子！若诸菩萨悟净圆觉，以净觉心，取静为行；由澄诸念，觉识烦动，静慧发生，身心客尘从此永灭，便能内发寂静轻安；由寂静故，十方世界诸如来心于中显现，如镜中像。此方便者名奢摩他。","「善男子！若诸菩萨悟净圆觉，以净觉心，知觉心性及与根尘皆因幻化，即起诸幻以除幻者，变化诸幻而开幻众；由起幻故便能内发大悲轻安，一切菩萨从此起行，渐次增进。彼观幻者非同幻故，非同幻观皆是幻故，幻相永离；是诸菩萨所圆妙行，如土长苗。此方便者名三摩钵提。","「善男子！若诸菩萨悟净圆觉，以净觉心不取幻化及诸静相，了知身心皆为罣碍；无知觉明不依诸碍，永得超过碍无碍境、受用世界及与身心，相在尘域；如器中锽声出于外，烦恼涅槃不相留碍，便能内发寂灭轻安、妙觉随顺、寂灭境界，自他身心所不能及，众生寿命皆为浮想。此方便者名为禅那。","「善男子！此三法门皆是圆觉。亲近随顺十方如来，因此成佛十方菩萨种种方便，一切同异皆依如是三种事业，若得圆证即成圆觉。善男子！假使有人修于圣道，教化成就百千万亿阿罗汉、辟支佛果，不如有人闻此圆觉无碍法门，一刹那顷随顺修习。」","尔时，世尊欲重宣此义而说偈言：",`「威德汝当知，　无上大觉心，
本际无二相，　随顺诸方便，
其数即无量。　如来总开示，
便有三种类，　寂静奢摩他，
如镜照诸像；　如幻三摩提，
如苗渐增长；　禅那唯寂灭，
如彼器中锽。　三种妙法门，
皆是觉随顺，　十方诸如来，
及诸大菩萨，　因此得成道。
三事圆证故，　名究竟涅槃。」`,"于是辩音菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！如是法门甚为希有！世尊！此诸方便一切菩萨于圆觉门有几修习？愿为大众及末世众生，方便开示令悟实相。」作是语已五体投地，如是三请终而复始。","尔时，世尊告辩音菩萨言：「善哉！善哉！善男子！汝等乃能为诸大众及末世众生，问于如来，如是修习。汝今谛听！当为汝说。」时，辩音菩萨奉教欢喜，及诸大众默然而听。","「善男子！一切如来圆觉清净本无修习及修习者，一切菩萨及末世众生依于未觉幻力修习，尔时便有二十五种清净定轮：","「若诸菩萨唯取极静，由静力故永断烦恼究竟成就，不起于座便入涅槃；此菩萨者，名单修奢摩他。","「若诸菩萨唯观如幻，以佛力故变化世界种种作用，备行菩萨清净妙行，于陀罗尼不失寂念及诸静慧，此菩萨者，名单修三摩钵提。","「若诸菩萨唯灭诸幻，不取作用独断烦恼，烦恼断尽便证实相；此菩萨者，名单修禅那。","「若诸菩萨先取至静，以静慧心照诸幻者，便于是中起菩萨行；此菩萨者，名先修奢摩他，后修三摩钵提。","「若诸菩萨以静慧故证至静性，便断烦恼永出生死；此菩萨者，名先修奢摩他，后修禅那。","「若诸菩萨以寂静慧，复现幻力种种变化度诸众生，后断烦恼而入寂灭；此菩萨者，名先修奢摩他，中修三摩钵提，后修禅那。","「若诸菩萨以至静力断烦恼已，后起菩萨清净妙行度诸众生；此菩萨者，名先修奢摩他，中修禅那，后修三摩钵提。","「若诸菩萨以至静力心断烦恼，复度众生建立世界；此菩萨者，名先修奢摩他，齐修三摩钵提禅那。","「若诸菩萨以至静力资发变化，后断烦恼；此菩萨者，名齐修奢摩他、三摩钵提，后修禅那。","「若诸菩萨以至静力用资寂灭，后起作用变化境界；此菩萨者，名齐修奢摩他、禅那，后修三摩钵提。","「若诸菩萨以变化力种种随顺，而取至静；此菩萨者，名先修三摩钵提，后修奢摩他。","「若诸菩萨以变化力种种境界，而取寂灭；此菩萨者，名先修三摩钵提，后修禅那。","「若诸菩萨以变化力而作佛事，安住寂静，而断烦恼；此菩萨者，名先修三摩钵提，中修奢摩他，后修禅那。","「若诸菩萨以变化力无碍作用，断烦恼故，安住至静；此菩萨者，名先修三摩钵提，中修禅那，后修奢摩他。","「若诸菩萨以变化力方便作用，至静、寂灭二俱随顺；此菩萨者，名先修三摩钵提，齐修奢摩他、禅那。","「若诸菩萨以变化力种种起用，资于至静，后断烦恼；此菩萨者，名齐修三摩钵提、奢摩他，后修禅那。","「若诸菩萨以变化力资于寂灭，后住清净，无作静虑；此菩萨者，名齐修三摩钵提、禅那，后修奢摩他。","「若诸菩萨以寂灭力而起至静，住于清净；此菩萨者，名先修禅那，后修奢摩他。","「若诸菩萨以寂灭力而起作用，于一切境寂用随顺；此菩萨者，名先修禅那，后修三摩钵提。","「若诸菩萨以寂灭力种种自性，安于静虑，而起变化；此菩萨者，名先修禅那，中修奢摩他，后修三摩钵提。","「若诸菩萨以寂灭力无作自性起于作用，清净境界归于静虑；此菩萨者，名先修禅那，中修三摩钵提，后修奢摩他。","「若诸菩萨以寂灭力种种清净，而住静虑起于变化；此菩萨者，名先修禅那，齐修奢摩他、三摩钵提。","「若诸菩萨以寂灭力资于至静，而起变化；此菩萨者，名齐修禅那、奢摩他，后修三摩钵提。","「若诸菩萨以寂灭力资于变化，而起至静清明境慧；此菩萨者，名齐修禅那、三摩钵提，后修奢摩他。","「若诸菩萨以圆觉慧圆合一切，于诸性相无离觉性；此菩萨者，名为圆修三种自性清净随顺。","「善男子！是名菩萨二十五轮，一切菩萨修行如是。若诸菩萨及末世众生依此轮者，当持梵行，寂静思惟，求哀忏悔，经三七日。于二十五轮各安标记，至心求哀，随手结取；依结开示便知顿渐，一念疑悔即不成就。」","尔时，世尊欲重宣此义而说偈言：",`「辩音汝当知，　一切诸菩萨，
无碍清净慧，　皆依禅定生。
所谓奢摩他，　三摩提禅那，
三法顿渐修，　有二十五种。
十方诸如来，　三世修行者，
无不因此法，　而得成菩提；
唯除顿觉人，　并法不随顺。
一切诸菩萨，　及末世众生，
常当持此轮，　随顺勤修习，
依佛大悲力，　不久证涅槃。」`,"于是净诸业障菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！为我等辈广说如是不思议事一切如来因地行相，令诸大众得未曾有，覩见调御历恒沙劫勤苦境界，一切功用犹如一念，我等菩萨深自庆慰。世尊！若此觉心本性清净，因何染污，使诸众生迷闷不入？唯愿如来广为我等开悟法性，令此大众及末世众生作将来眼。」说是语已五体投地，如是三请终而复始。","尔时，世尊告净诸业障菩萨言：「善哉！善哉！善男子！汝等乃能为诸大众及末世众生，咨问如来如是方便。汝今谛听！当为汝说。」时，净诸业障菩萨奉教欢喜，及诸大众默然而听。","「善男子！一切众生从无始来，妄想执有我、人、众生及与寿命，认四颠倒为实我体，由此便生憎爱二境。于虚妄体重执虚妄，二妄相依生妄业道，有妄业故妄见流转，厌流转者妄见涅槃。由此不能入清净觉，非觉违拒诸能入者，有诸能入，非觉入故。是故动念及与息念皆归迷闷，何以故？由有无始本起无明为己主宰，一切众生生无慧目，身心等性皆是无明，譬如有人不自断命。是故当知！有爱我者我与随顺，非随顺者便生憎怨，为憎爱心养无明故，相续求道皆不成就。","「善男子！云何我相？谓诸众生心所证者。善男子！譬如有人百骸调适忽忘我身；四支弦缓，摄养乖方，微加针艾，则知有我。是故证取方现我体。善男子！其心乃至证于如来，毕竟了知清净涅槃皆是我相。","「善男子！云何人相？谓诸众生心悟证者。善男子！悟有我者，不复认我，所悟非我，悟亦如是。悟已超过一切证者，悉为人相。善男子！其心乃至圆悟涅槃俱是我者，心存少悟备殚证理，皆名人相。","「善男子！云何众生相？谓诸众生心自证悟所不及者。善男子！譬如有人作如是言：『我是众生。』则知彼人说众生者非我非彼。云何非我？我是众生，则非是我。云何非彼？我是众生，非彼我故。善男子！但诸众生了证了悟皆为我、人，而我、人相所不及者，存有所了，名众生相。","「善男子！云何寿命相？谓诸众生心照清净觉所了者，一切业智所不自见犹如命根。善男子！若心照见一切觉者皆为尘垢，觉、所觉者不离尘故；如汤销氷无别有氷，知氷销者，存我、觉我亦复如是。","「善男子！末世众生不了四相，虽经多劫勤苦修道，但名有为，终不能成一切圣果，是故名为正法末世。何以故？认一切我为涅槃故，有证有悟名成就故。譬如有人以贼为子，其家财宝终不成就。何以故？有我爱者亦爱涅槃，伏我爱根为涅槃相；有憎我者亦憎生死，不知爱者真生死故，别憎生死，名不解脱。","「云何当知法不解脱？善男子！彼末世众生习菩提者，以己微证为自清净，犹未能尽我相根本。若复有人赞叹彼法，即生欢喜便欲济度；若复诽谤彼所得者便生瞋恨。则知我相坚固执持，潜伏藏识，游戏诸根曾不间断。善男子！彼修道者不除我相，是故不能入清净觉。善男子！若知我空，无毁我者，有我说法，我未断故，众生、寿命亦复如是。","「善男子！末世众生说病为法，是故名为可怜愍者；虽勤精进增益诸病，是故不能入清净觉。善男子！末世众生不了四相，以如来解及所行处为自修行终不成就。或有众生未得谓得、未证谓证，见胜进者心生嫉妬；由彼众生未断我爱，是故不能入清净觉。善男子！末世众生希望成道无令求悟，唯益多闻增长我见；但当精勤降伏烦恼起大勇猛，未得令得、未断令断，贪、瞋、爱、慢、谄曲、嫉妬对境不生，彼我恩爱一切寂灭，佛说是人渐次成就。求善知识不堕邪见，若于所求别生憎爱，则不能入清净觉海。」","尔时，世尊欲重宣此义而说偈言：",`「净业汝当知，　一切诸众生，
皆由执我爱，　无始妄流转，
未除四种相，　不得成菩提。
爱憎生于心，　谄曲存诸念，
是故多迷闷，　不能入觉城。
若能归悟刹，　先去贪瞋痴，
法爱不存心，　渐次可成就。
我身本不有，　憎爱何由生？
此人求善友，　终不堕邪见。
所求别生心，　究竟非成就。」`,"于是普觉菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！快说禅病！令诸大众得未曾有，心意荡然获大安隐。世尊！末世众生去佛渐远，贤圣隐伏邪法增炽，使诸众生求何等人？依何等法？行何等行？除去何病？云何发心令彼群盲不堕邪见？」作是语已五体投地，如是三请终而复始。","尔时，世尊告普觉菩萨言：「善哉！善哉！善男子！汝等乃能咨问如来如是修行，能施末世一切众生无畏道眼，令彼众生得成圣道。汝今谛听！当为汝说。」时，普觉菩萨奉教欢喜，及诸大众默然而听。","「善男子！末世众生将发大心求善知识欲修行者，当求一切正知见人。心不住相，不著声闻、缘觉境界，虽现尘劳心恒清净，示有诸过赞叹梵行，不令众生入不律仪。求如是人即得成就阿耨多罗三藐三菩提；末世众生见如是人应当供养不惜身命。彼善知识四威仪中常现清净，乃至示现种种过患，心无憍慢，况复抟财、妻子、眷属。若善男子于彼善友不起恶念，即能究竟成就正觉，心花发明照十方刹。","「善男子！彼善知识所证妙法应离四病。云何四病？一者作病，若复有人作如是言：『我于本心作种种行欲求圆觉。』彼圆觉性非作得故，说名为病。二者任病，若复有人作如是言：『我等今者不断生死、不求涅槃，涅槃、生死无起灭念，任彼一切随诸法性欲求圆觉。』彼圆觉性非任有故，说名为病。三者止病，若复有人作如是言：『我今自心永息诸念得一切性，寂然平等欲求圆觉。』彼圆觉性非止合故，说名为病。四者灭病，若复有人作如是言：『我今永断一切烦恼，身心毕竟空无所有，何况根尘虚妄境界，一切永寂欲求圆觉。』彼圆觉性非寂相故，说名为病。离四病者则知清净，作是观者名为正观，若他观者名为邪观。","「善男子！末世众生欲修行者，应当尽命供养善友、事善知识，彼善知识欲来亲近应断憍慢，若复远离应断瞋恨；现逆顺境犹如虚空，了知身心毕竟平等，与诸众生同体无异，如是修行方入圆觉。善男子！末世众生不得成道，由有无始自他憎爱一切种子故未解脱。若复有人，观彼怨家如己父母心无有二，即除诸病；于诸法中自他憎爱亦复如是。善男子！末世众生欲求圆觉应当发心作如是言：『尽于虚空一切众生，我皆令入究竟圆觉，于圆觉中无取觉者，除彼、我、人一切诸相。』如是发心不堕邪见。」","尔时，世尊欲重宣此义而说偈言：",`「普觉汝当知，　末世诸众生，
欲求善知识，　应当求正见，
心远二乘者。　法中除四病，
谓作止任灭；　亲近无憍慢，
远离无瞋恨。　见种种境界，
心当生希有，　还如佛出世。
不犯非律仪，　戒根永清净，
度一切众生，　究竟入圆觉。
无彼我人相，　常依止智慧，
便得超邪见，　证觉般涅槃。」`,"于是圆觉菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！为我等辈广说净觉种种方便，令末世众生有大增益。世尊！我等今者已得开悟，若佛灭后末世众生未得悟者，云何安居修此圆觉清净境界？此圆觉中三种净观以何为首？唯愿大悲为诸大众及末世众生施大饶益。」作是语已五体投地，如是三请终而复始。","尔时，世尊告圆觉菩萨言：「善哉！善哉！善男子！汝等乃能问于如来如是方便，以大饶益施诸众生。汝今谛听！当为汝说。」时，圆觉菩萨奉教欢喜，及诸大众默然而听。","「善男子！一切众生，若佛住世，若佛灭后、若法末时，有诸众生具大乘性，信佛秘密大圆觉心，欲修行者，若在伽蓝安处徒众，有缘事故随分思察，如我已说；若复无有他事因缘，即建道场当立期限，若立长期百二十日，中期百日，下期八十日，安置净居。若佛现在，当正思惟；若佛灭后，施设形像，心存目想生正忆念，还同如来常住之日。悬诸幡花经三七日，稽首十方诸佛名字，求哀忏悔；遇善境界得心轻安。过三七日，一向摄念。","「若经夏首，三月安居，当为清净菩萨止住，心离声闻不假徒众。至安居日即于佛前作如是言：『我比丘、比丘尼、优婆塞、优婆夷某甲，踞菩萨乘修寂灭行，同入清净实相住持，以大圆觉为我伽蓝，身心安居，平等性智，涅槃自性，无系属故。今我敬请不依声闻，当与十方如来及大菩萨三月安居，为修菩萨无上妙觉大因缘故不系徒众。』善男子！此名菩萨示现安居，过三期日随往无碍。善男子！若彼末世修行众生求菩萨道入三期者，非彼所闻一切境界终不可取。","「善男子！若诸众生修奢摩他，先取至静不起思念，静极便觉。如是初静，从于一身至一世界，觉亦如是。善男子！若觉遍满一世界者，一世界中有一众生起一念者皆悉能知，百千世界亦复如是；非彼所闻一切境界终不可取。","「善男子！若诸众生修三摩钵提，先当忆想十方如来、十方世界一切菩萨，依种种门渐次修行勤苦三昧，广发大愿自熏成种；非彼所闻一切境界终不可取。","「善男子！若诸众生修于禅那，先取数门，心中了知生住灭念，分齐头数，如是周遍四威仪中，分别念数无不了知，渐次增进乃至得知百千世界一滴之雨，犹如目覩所受用物；非彼所闻一切境界终不可取。是名三观初首方便。若诸众生，遍修三种勤行精进，即名如来出现于世；若后末世钝根众生心欲求道，不得成就由昔业障，当勤忏悔常起希望，先断憎、爱、嫉妬、谄曲，求胜上心，三种净观随学一事，此观不得复习彼观，心不放舍渐次求证。」","尔时，世尊欲重宣此义而说偈言：",`「圆觉汝当知，　一切诸众生，
欲求无上道，　先当结三期，
忏悔无始业。　经于三七日，
然后正思惟，　非彼所闻境，
毕竟不可取。　奢摩他至静，
三摩正忆持，　禅那明数门，
是名三净观。　若能勤修习，
是名佛出世。　钝根未成者，
常当勤心忏，　无始一切罪，
诸障若销灭，　佛境便现前。」`,"于是贤善首菩萨在大众中即从座起，顶礼佛足右绕三匝，长跪叉手而白佛言：「大悲世尊！广为我等及末世众生，开悟如是不思议事。世尊！此大乘教名字何等？云何奉持？众生修习得何功德？云何使我护持经人？流布此教至于何地？」作是语已五体投地，如是三请终而复始。","尔时，世尊告贤善首菩萨言：「善哉！善哉！善男子！汝等乃能为诸菩萨及末世众生，问于如来如是经教功德名字。汝今谛听！当为汝说。」时，贤善首菩萨奉教欢喜，及诸大众默然而听。","「善男子！是经百千万亿恒河沙诸佛所说，三世如来之所守护，十方菩萨之所归依，十二部经清净眼目，是经名大方广圆觉陀罗尼，亦名修多罗了义，亦名秘密王三昧，亦名如来决定境界，亦名如来藏自性差别，汝当奉持。善男子！是经唯显如来境界，唯佛如来能尽宣说；若诸菩萨及末世众生依此修行，渐次增进至于佛地。善男子！是经名为顿教大乘，顿机众生从此开悟，亦摄渐修一切群品。譬如大海不让小流，乃至蚊虻及阿修罗饮其水者，皆得充满。","「善男子！假使有人纯以七宝积满三千大千世界以用布施，不如有人闻此经名及一句义。善男子！假使有人教百恒河沙众生得阿罗汉果，不如有人宣说此经分别半偈。善男子！若复有人闻此经名信心不惑，当知是人非于一佛二佛种诸福慧，如是乃至尽恒河沙一切佛所种诸善根闻此经教。汝善男子！当护末世是修行者，无令恶魔及诸外道恼其身心令生退屈。」","尔时，会中有火首金刚、摧碎金刚、尼蓝婆金刚等八万金刚并其眷属即从座起，顶礼佛足，右绕三匝而白佛言：「世尊！若后末世，一切众生有能持此决定大乘，我当守护如护眼目；乃至道场所修行处，我等金刚自领徒众晨夕守护，令不退转。其家乃至永无灾障，疫病销灭，财宝丰足常不乏少。」","尔时，大梵天王、二十八天王并须弥山王、护国天王等即从座起，顶礼佛足，右绕三匝而白佛言：「世尊！我亦守护是持经者，常令安隐心不退转。」","尔时，有大力鬼王名吉槃茶与十万鬼王即从座起，顶礼佛足，右绕三匝而白佛言：「世尊！我亦守护是持经人，朝夕侍卫令不退屈，其人所居一由旬内，若有鬼神侵其境界，我当使其碎如微尘。」","佛说此经已，一切菩萨、天龙、鬼神八部眷属及诸天王、梵王等一切大众，闻佛所说，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0842",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0842.xml",sourceLabel:"CBETA T17n0842",scope:"全经正文",originalTitle:"大方廣圓覺修多羅了義經",juan:[1]},{id:"ullambana",title:"佛说盂兰盆经",subtitle:"佛说盂兰盆经 · 西晋 竺法护译",paragraphs:["闻如是：","一时佛在舍卫国祇树给孤独园。大目干连始得六通，欲度父母，报乳哺之恩。即以道眼观视世间，见其亡母生饿鬼中，不见饮食，皮骨连立。目连悲哀，即钵盛饭，往饷其母。母得钵饭，便以左手障钵，右手抟饭。食未入口，化成火炭，遂不得食。目连大叫，悲号啼泣，驰还白佛，具陈如此。","佛言：「汝母罪根深结，非汝一人力所奈何！汝虽孝顺，声动天地，天神、地神、邪魔、外道、道士、四天王神亦不能奈何！当须十方众僧威神之力乃得解脱。吾今当为汝说救济之法，令一切难皆离忧苦，罪障消除。」","佛告目连：「十方众僧于七月十五日僧自恣时，当为七世父母及现在父母厄难中者，具饭、百味五果、汲灌盆器、香油锭𪹳、床敷卧具，尽世甘美以著盆中，供养十方大德众僧。当此之日，一切圣众或在山间禅定、或得四道果、或树下经行；或六通自在、教化声闻、缘觉；或十地菩萨大人权现比丘，在大众中；皆同一心，受钵和罗饭。具清净戒圣众之道，其德汪洋，其有供养此等自恣僧者，现在父母、七世父母、六种亲属得出三途之苦，应时解脱，衣食自然。若复有人父母现在者，福乐百年；若已亡七世父母，生天，自在化生，入天华光，受无量快乐。」时佛勅十方众僧，皆先为施主家呪愿七世父母，行禅定意，然后受食。初受盆时，先安在佛塔前，众僧呪愿竟，便自受食。","尔时目连比丘及此大会大菩萨众皆大欢喜，而目连悲啼泣声释然除灭。是时目连其母即于是日，得脱一劫饿鬼之苦。","尔时目连复白佛言：「弟子所生父母，得蒙三宝功德之力、众僧威神之力。故，若未来世一切佛弟子行孝顺者，亦应奉此盂兰盆，救度现在父母乃至七世父母，为可尔不？」","佛言：「大善快问！我正欲说，汝今复问。善男子！若有比丘比丘尼、国王太子、王子大臣宰相、三公百官、万民庶人行孝慈者，皆应为所生现在父母、过去七世父母，于七月十五日——佛欢喜日、僧自恣日——以百味饮食安盂兰盆中，施十方自恣僧，乞愿便使现在父母寿命百年、无病，无一切苦恼之患，乃至七世父母离饿鬼苦，得生天人中，福乐无极。」","佛告诸善男子、善女人：「是佛弟子修孝顺者，应念念中常忆父母，供养乃至七世父母。年年七月十五日，常以孝顺慈忆所生父母，乃至七世父母，为作盂兰盆施佛及僧，以报父母长养、慈爱之恩。若一切佛弟子应当奉持是法。」","尔时目连比丘、四辈弟子，闻佛所说，欢喜奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T16n0685",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T16/T16n0685.xml",sourceLabel:"CBETA T16n0685",scope:"全经正文",originalTitle:"佛說盂蘭盆經",juan:[1]},{id:"samantabhadra",title:"普贤行愿品",subtitle:"大方广佛华严经 卷第四十 · 唐 般若译",paragraphs:["尔时，普贤菩萨摩诃萨称叹如来胜功德已，告诸菩萨及善财言：「善男子！如来功德，假使十方一切诸佛，经不可说不可说佛刹极微尘数劫，相续演说，不可穷尽。若欲成就此功德门，应修十种广大行愿。何等为十？一者、礼敬诸佛，二者、称赞如来，三者、广修供养，四者、忏悔业障，五者、随喜功德，六者、请转法轮，七者、请佛住世，八者、常随佛学，九者、恒顺众生，十者、普皆回向。」","善财白言：「大圣！云何礼敬，乃至回向？」","普贤菩萨告善财言：「善男子！言礼敬诸佛者：所有尽法界、虚空界十方三世一切佛刹极微尘数诸佛世尊，我以普贤行愿力故，起深信解，如对目前，悉以清净身、语、意业，常修礼敬；一一佛所，皆现不可说不可说佛刹极微尘数身，一一身遍礼不可说不可说佛刹极微尘数佛；虚空界尽，我礼乃尽，而虚空界不可尽故，我此礼敬，无有穷尽。如是乃至众生界尽、众生业尽、众生烦恼尽，我礼乃尽。而众生界乃至烦恼无有尽故，我此礼敬无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言称赞如来者：所有尽法界、虚空界十方三世一切刹土所有极微一一尘中，皆有一切世界极微尘数佛，一一佛所皆有菩萨海会围绕，我当悉以甚深胜解，现前知见；各以出过辩才天女微妙舌根，一一舌根出无尽音声海，一一音声出一切言辞海，称扬赞叹一切如来诸功德海，穷未来际相续不断，尽于法界无不周遍。如是虚空界尽、众生界尽、众生业尽、众生烦恼尽，我赞乃尽。而虚空界乃至烦恼无有尽故，我此赞叹无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言广修供养者：所有尽法界、虚空界十方三世一切佛刹极微尘中，一一各有一切世界极微尘数佛，一一佛所种种菩萨海会围绕，我以普贤行愿力故，起深信解，现前知见，悉以上妙诸供养具而为供养。所谓：华云、鬘云、天音乐云、天伞盖云、天衣服云、天种种香、涂香、烧香、末香，如是等云，一一量如须弥山王；然种种灯，酥灯、油灯、诸香油灯，一一灯炷如须弥山，一一灯油如大海水，以如是等诸供养具常为供养。善男子！诸供养中，法供养最。所谓：如说修行供养、利益众生供养、摄受众生供养、代众生苦供养、勤修善根供养、不舍菩萨业供养、不离菩提心供养。善男子！如前供养无量功德，比法供养一念功德百分不及一，千分不及一，百千俱胝那由他分、迦罗分、算分、数分、谕分、优婆尼沙陀分亦不及一。何以故？以诸如来尊重法故，以如说修行出生诸佛故。若诸菩萨行法供养，则得成就供养如来，如是修行是真供养故。此广大最胜供养虚空界尽、众生界尽、众生业尽、众生烦恼尽，我供乃尽。而虚空界乃至烦恼不可尽故，我此供养亦无有尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言忏除业障者：菩萨自念我于过去无始劫中，由贪、瞋、痴发身、口、意，作诸恶业无量无边。若此恶业有体相者，尽虚空界不能容受。我今悉以清净三业，遍于法界极微尘刹一切诸佛菩萨众前，诚心忏悔，后不复造，恒住净戒一切功德。如是虚空界尽、众生界尽、众生业尽、众生烦恼尽，我忏乃尽。而虚空界乃至众生烦恼不可尽故，我此忏悔无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言随喜功德者：所有尽法界、虚空界十方三世一切佛刹极微尘数诸佛如来，从初发心为一切智，勤修福聚，不惜身命，经不可说不可说佛刹极微尘数劫，一一劫中舍不可说不可说佛刹极微尘数头、目、手、足，如是一切难行、苦行，圆满种种波罗蜜门，证入种种菩萨智地，成就诸佛无上菩提及般涅槃，分布舍利，所有善根，我皆随喜。及彼十方一切世界，六趣、四生一切种类所有功德，乃至一尘我皆随喜。十方三世一切声闻及辟支佛、有学、无学所有功德，我皆随喜。一切菩萨所修无量难行、苦行，志求无上正等菩提广大功德，我皆随喜。如是虚空界尽、众生界尽、众生业尽、众生烦恼尽，我此随喜无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言请转法轮者：所有尽法界、虚空界十方三世一切佛刹极微尘中，一一各有不可说不可说佛刹极微尘数广大佛刹，一一刹中念念有不可说不可说佛刹极微尘数一切诸佛成等正觉，一切菩萨海会围绕，而我悉以身、口、意业种种方便，慇懃劝请转妙法轮。如是虚空界尽、众生界尽、众生业尽、众生烦恼尽，我常劝请一切诸佛转正法轮无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言请佛住世者：所有尽法界、虚空界十方三世一切佛刹极微尘数诸佛如来将欲示现般涅槃者，及诸菩萨、声闻、缘觉、有学、无学，乃至一切诸善知识，我悉劝请莫入涅槃，经于一切佛刹极微尘数劫，为欲利乐一切众生。如是虚空界尽、众生界尽、众生业尽、众生烦恼尽，我此劝请无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言常随佛学者：如此娑婆世界毘卢遮那如来，从初发心精进不退，以不可说不可说身命而为布施；剥皮为纸，折骨为笔，刺血为墨，书写经典，积如须弥，为重法故，不惜身命，何况王位、城邑、聚落、宫殿、园林一切所有，及余种种难行、苦行，乃至树下成大菩提，示种种神通，起种种变化，现种种佛身，处种种众会：或处一切诸大菩萨众会道场，或处声闻及辟支佛众会道场，或处转轮圣王、小王眷属众会道场，或处刹利及婆罗门、长者、居士众会道场，乃至或处天龙八部、人、非人等众会道场。处于如是种种众会，以圆满音，如大雷震，随其乐欲，成熟众生，乃至示现入于涅槃。如是一切，我皆随学。如今世尊毘卢遮那，如是尽法界、虚空界十方三世一切佛刹所有尘中一切如来皆亦如是，于念念中，我皆随学。如是虚空界尽、众生界尽、众生业尽、众生烦恼尽，我此随学无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言恒顺众生者：谓尽法界、虚空界十方刹海，所有众生种种差别，所谓：卵生、胎生、湿生、化生，或有依于地、水、火、风而生住者，或有依空及诸卉木而生住者，种种生类、种种色身、种种形状、种种相貌、种种寿量、种种族类、种种名号、种种心性、种种知见、种种欲乐、种种意行、种种威仪、种种衣服、种种饮食，处于种种村营、聚落、城邑、宫殿，乃至一切天龙八部、人、非人等，无足、二足、四足、多足，有色、无色，有想、无想、非有想、非无想，如是等类，我皆于彼随顺而转，种种承事，种种供养，如敬父母，如奉师长，及阿罗汉乃至如来，等无有异。于诸病苦为作良医，于失道者示其正路，于暗夜中为作光明，于贫穷者令得伏藏，菩萨如是平等饶益一切众生。何以故？菩萨若能随顺众生，则为随顺供养诸佛；若于众生尊重承事，则为尊重承事如来；若令众生生欢喜者，则令一切如来欢喜。何以故？诸佛如来以大悲心而为体故。因于众生而起大悲，因于大悲生菩提心，因菩提心成等正觉。譬如旷野沙碛之中有大树王，若根得水，枝叶、华果悉皆繁茂。生死旷野菩提树王，亦复如是。一切众生而为树根，诸佛菩萨而为华果，以大悲水饶益众生，则能成就诸佛菩萨智慧华果。何以故？若诸菩萨以大悲水饶益众生，则能成就阿耨多罗三藐三菩提故。是故菩提属于众生，若无众生，一切菩萨终不能成无上正觉。善男子！汝于此义应如是解。以于众生心平等故，则能成就圆满大悲，以大悲心随众生故，则能成就供养如来。菩萨如是随顺众生，虚空界尽、众生界尽、众生业尽、众生烦恼尽，我此随顺无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。","「复次，善男子！言普皆回向者：从初礼拜乃至随顺，所有功德皆悉回向尽法界、虚空界一切众生，愿令众生常得安乐，无诸病苦；欲行恶法皆悉不成，所修善业皆速成就；关闭一切诸恶趣门，开示人天涅槃正路；若诸众生因其积集诸恶业故，所感一切极重苦果我皆代受；令彼众生悉得解脱究竟成就无上菩提。菩萨如是所修回向，虚空界尽、众生界尽、众生业尽、众生烦恼尽，我此回向无有穷尽，念念相续，无有间断，身、语、意业无有疲厌。善男子！是为菩萨摩诃萨十种大愿具足圆满。若诸菩萨于此大愿随顺趣入，则能成熟一切众生，则能随顺阿耨多罗三藐三菩提，则能成满普贤菩萨诸行愿海。是故，善男子！汝于此义应如是知：若有善男子、善女人以满十方无量无边、不可说不可说佛刹极微尘数一切世界上妙七宝，及诸人天最胜安乐，布施尔所一切世界所有众生，供养尔所一切世界诸佛菩萨，经尔所佛刹极微尘数劫相续不断所得功德，若复有人闻此愿王一经于耳，所有功德比前功德百分不及一，千分不及一，乃至优波尼沙陀分亦不及一。或复有人以深信心，于此大愿受持读诵，乃至书写一四句偈，速能除灭五无间业，所有世间身心等病，种种苦恼，乃至佛刹极微尘数一切恶业，皆得销除；一切魔军、夜叉、罗刹、若鸠槃荼、若毘舍阇、若部多等饮血噉肉诸恶鬼神，皆悉远离，或时发心亲近守护。是故若人诵此愿者，行于世间无有障碍，如空中月出于云翳，诸佛菩萨之所称赞，一切人天皆应礼敬，一切众生悉应供养。此善男子善得人身，圆满普贤所有功德，不久当如普贤菩萨，速得成就微妙色身，具三十二大丈夫相，若生人天，所在之处常居胜族，悉能破坏一切恶趣，悉能远离一切恶友，悉能制伏一切外道，悉能解脱一切烦恼，如师子王摧伏群兽，堪受一切众生供养。又复，是人临命终时，最后刹那一切诸根悉皆散坏，一切亲属悉皆舍离，一切威势悉皆退失，辅相、大臣、宫城内外，象马车乘，珍宝伏藏，如是一切无复相随，唯此愿王不相舍离，于一切时引导其前。一刹那中即得往生极乐世界，到已即见阿弥陀佛、文殊师利菩萨、普贤菩萨、观自在菩萨、弥勒菩萨等，此诸菩萨色相端严，功德具足，所共围绕。其人自见生莲华中，蒙佛授记；得授记已，经于无数百千万亿那由他劫，普于十方不可说不可说世界，以智慧力随众生心而为利益。不久当坐菩提道场，降伏魔军，成等正觉，转妙法轮。能令佛刹极微尘数世界众生发菩提心，随其根性，教化成熟，乃至尽于未来劫海，广能利益一切众生。善男子！彼诸众生若闻、若信此大愿王，受持读诵，广为人说，所有功德，除佛世尊余无知者。是故汝等闻此愿王，莫生疑念，应当谛受，受已能读，读已能诵，诵已能持，乃至书写，广为人说。是诸人等于一念中，所有行愿皆得成就，所获福聚无量无边。能于烦恼大苦海中拔济众生，令其出离，皆得往生阿弥陀佛极乐世界。」","尔时，普贤菩萨摩诃萨欲重宣此义，普观十方而说偈言：",`「所有十方世界中，　三世一切人师子，
我以清净身语意，　一切遍礼尽无余。
普贤行愿威神力，　普现一切如来前，
一身复现刹尘身，　一一遍礼刹尘佛。
于一尘中尘数佛，　各处菩萨众会中，
无尽法界尘亦然，　深信诸佛皆充满。
各以一切音声海，　普出无尽妙言辞，
尽于未来一切劫，　赞佛甚深功德海。
以诸最胜妙华鬘，　妓乐涂香及伞盖，
如是最胜庄严具，　我以供养诸如来。
最胜衣服最胜香，　末香烧香与灯烛，
一一皆如妙高聚，　我悉供养诸如来。
我以广大胜解心，　深信一切三世佛，
悉以普贤行愿力，　普遍供养诸如来。
我昔所造诸恶业，　皆由无始贪恚痴，
从身语意之所生，　一切我今皆忏悔。
十方一切诸众生，　二乘有学及无学，
一切如来与菩萨，　所有功德皆随喜。
十方所有世间灯，　最初成就菩提者，
我今一切皆劝请，　转于无上妙法轮。
诸佛若欲示涅槃，　我悉至诚而劝请，
唯愿久住刹尘劫，　利乐一切诸众生。
所有礼赞供养福，　请佛住世转法轮，
随喜忏悔诸善根，　回向众生及佛道。
我随一切如来学，　修习普贤圆满行，
供养过去诸如来，　及与现在十方佛。
未来一切天人师，　一切意乐皆圆满，
我愿普随三世学，　速得成就大菩提。
所有十方一切刹，　广大清净妙庄严，
众会围绕诸如来，　悉在菩提树王下。
十方所有诸众生，　愿离忧患常安乐，
获得甚深正法利，　灭除烦恼尽无余。
我为菩提修行时，　一切趣中成宿命，
常得出家修净戒，　无垢无破无穿漏。
天龙夜叉鸠槃荼，　乃至人与非人等，
所有一切众生语，　悉以诸音而说法。
勤修清净波罗蜜，　恒不忘失菩提心，
灭除障垢无有余，　一切妙行皆成就。
于诸惑业及魔境，　世间道中得解脱，
犹如莲华不著水，　亦如日月不住空。
悉除一切恶道苦，　等与一切群生乐，
如是经于刹尘劫，　十方利益恒无尽。
我常随顺诸众生，　尽于未来一切劫，
恒修普贤广大行，　圆满无上大菩提。
所有与我同行者，　于一切处同集会，
身口意业皆同等，　一切行愿同修学。
所有益我善知识，　为我显示普贤行，
常愿与我同集会，　于我常生欢喜心。
愿常面见诸如来，　及诸佛子众围绕，
于彼皆兴广大供，　尽未来劫无疲厌。
愿持诸佛微妙法，　光显一切菩提行，
究竟清净普贤道，　尽未来劫常修习。
我于一切诸有中，　所修福智恒无尽，
定慧方便及解脱，　获诸无尽功德藏。
一尘中有尘数刹，　一一刹有难思佛，
一一佛处众会中，　我见恒演菩提行。
普尽十方诸刹海，　一一毛端三世海，
佛海及与国土海，　我遍修行经劫海。
一切如来语清净，　一言具众音声海，
随诸众生意乐音，　一一流佛辩才海。
三世一切诸如来，　于彼无尽语言海，
恒转理趣妙法轮，　我深智力普能入。
我能深入于未来，　尽一切劫为一念，
三世所有一切劫，　为一念际我皆入。
我于一念见三世，　所有一切人师子，
亦常入佛境界中，　如幻解脱及威力。
于一毛端极微中，　出现三世庄严刹，
十方尘刹诸毛端，　我皆深入而严净。
所有未来照世灯，　成道转法悟群有，
究竟佛事示涅槃，　我皆往诣而亲近。
速疾周遍神通力，　普门遍入大乘力，
智行普修功德力，　威神普覆大慈力，
遍净庄严胜福力，　无著无依智慧力，
定慧方便诸威力，　普能积集菩提力，
清净一切善业力，　摧灭一切烦恼力，
降伏一切诸魔力，　圆满普贤诸行力。
普能严净诸刹海，　解脱一切众生海，
善能分别诸法海，　能甚深入智慧海，
普能清净诸行海，　圆满一切诸愿海，
亲近供养诸佛海，　修行无倦经劫海。
三世一切诸如来，　最胜菩提诸行愿，
我皆供养圆满修，　以普贤行悟菩提。
一切如来有长子，　彼名号曰普贤尊，
我今回向诸善根，　愿诸智行悉同彼。
愿身口意恒清净，　诸行刹土亦复然，
如是智慧号普贤，　愿我与彼皆同等。
我为遍净普贤行，　文殊师利诸大愿，
满彼事业尽无余，　未来际劫恒无倦。
我所修行无有量，　获得无量诸功德，
安住无量诸行中，　了达一切神通力。
文殊师利勇猛智，　普贤慧行亦复然，
我今回向诸善根，　随彼一切常修学。
三世诸佛所称叹，　如是最胜诸大愿，
我今回向诸善根，　为得普贤殊胜行。
愿我临欲命终时，　尽除一切诸障碍，
面见彼佛阿弥陀，　即得往生安乐刹。
我既往生彼国已，　现前成就此大愿，
一切圆满尽无余，　利乐一切众生界。
彼佛众会咸清净，　我时于胜莲华生，
亲覩如来无量光，　现前授我菩提记。
蒙彼如来授记已，　化身无数百俱胝，
智力广大遍十方，　普利一切众生界。
乃至虚空世界尽，　众生及业烦恼尽，
如是一切无尽时，　我愿究竟恒无尽。
十方所有无边刹，　庄严众宝供如来，
最胜安乐施天人，　经一切刹微尘劫。
若人于此胜愿王，　一经于耳能生信，
求胜菩提心渴仰，　获胜功德过于彼。
即常远离恶知识，　永离一切诸恶道，
速见如来无量光，　具此普贤最胜愿。
此人善得胜寿命，　此人善来人中生，
此人不久当成就，　如彼普贤菩萨行。
往昔由无智慧力，　所造极恶五无间，
诵此普贤大愿王，　一念速疾皆销灭。
族姓种类及容色，　相好智慧咸圆满，
诸魔外道不能摧，　堪为三界所应供。
速诣菩提大树王，　坐已降伏诸魔众，
成等正觉转法轮，　普利一切诸含识。
若人于此普贤愿，　读诵受持及演说，
果报唯佛能证知，　决定获胜菩提道。
若人诵此普贤愿，　我说少分之善根，
一念一切悉皆圆，　成就众生清净愿。
我此普贤殊胜行，　无边胜福皆回向，
普愿沉溺诸众生，　速往无量光佛刹。」`,"尔时，普贤菩萨摩诃萨于如来前，说此普贤广大愿王清净偈已，善财童子踊跃无量，一切菩萨皆大欢喜。如来赞言：「善哉！善哉！」尔时，世尊与诸圣者菩萨摩诃萨演说如是不可思议解脱境界胜法门时，文殊师利菩萨而为上首，诸大菩萨及所成熟六千比丘；弥勒菩萨而为上首，贤劫一切诸大菩萨；无垢普贤菩萨而为上首，一生补处住灌顶位诸大菩萨，及余十方种种世界普来集会一切刹海极微尘数诸菩萨摩诃萨众；大智舍利弗、摩诃目犍连等而为上首，诸大声闻；并诸人天一切世主、天、龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽、人、非人等一切大众，闻佛所说，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T10n0293_040",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T10/T10n0293.xml",sourceLabel:"CBETA T10n0293",scope:"卷四十完整正文（非全四十卷）",originalTitle:"大方廣佛華嚴經",juan:[40]},{id:"diamond",title:"金刚般若波罗蜜经",subtitle:"金刚般若波罗蜜经 · 姚秦 鸠摩罗什译",paragraphs:["如是我闻：","一时，佛在舍卫国祇树给孤独园，与大比丘众千二百五十人俱。尔时，世尊食时，著衣持钵，入舍卫大城乞食。于其城中，次第乞已，还至本处。饭食讫，收衣钵，洗足已，敷座而坐。","时，长老须菩提在大众中即从座起，偏袒右肩，右膝著地，合掌恭敬而白佛言：「希有世尊！如来善护念诸菩萨，善付嘱诸菩萨。世尊！善男子、善女人，发阿耨多罗三藐三菩提心，应云何住？云何降伏其心？」","佛言：「善哉，善哉！须菩提！如汝所说：『如来善护念诸菩萨，善付嘱诸菩萨。』汝今谛听，当为汝说。善男子、善女人，发阿耨多罗三藐三菩提心，应如是住，如是降伏其心。」","「唯然。世尊！愿乐欲闻。」","佛告须菩提：「诸菩萨摩诃萨应如是降伏其心：『所有一切众生之类，若卵生、若胎生、若湿生、若化生，若有色、若无色，若有想、若无想、若非有想非无想，我皆令入无余涅槃而灭度之。』如是灭度无量、无数、无边众生，实无众生得灭度者。何以故？须菩提！若菩萨有我相、人相、众生相、寿者相，即非菩萨。","「复次，须菩提！菩萨于法应无所住行于布施，所谓不住色布施，不住声、香、味、触、法布施。须菩提！菩萨应如是布施，不住于相。何以故？若菩萨不住相布施，其福德不可思量。","「须菩提！于意云何？东方虚空可思量不？」","「不也，世尊！」","「须菩提！南、西、北方，四维、上、下虚空可思量不？」","「不也，世尊！」","「须菩提！菩萨无住相布施，福德亦复如是不可思量。须菩提！菩萨但应如所教住。","「须菩提！于意云何？可以身相见如来不？」","「不也，世尊！不可以身相得见如来。何以故？如来所说身相，即非身相。」","佛告须菩提：「凡所有相，皆是虚妄；若见诸相非相，则见如来。」","须菩提白佛言：「世尊！颇有众生，得闻如是言说章句，生实信不？」","佛告须菩提：「莫作是说。如来灭后后五百岁，有持戒修福者，于此章句能生信心，以此为实，当知是人不于一佛二佛、三、四、五佛而种善根，已于无量千万佛所种诸善根。闻是章句，乃至一念生净信者，须菩提！如来悉知悉见是诸众生得如是无量福德。何以故？是诸众生无复我相、人相、众生相、寿者相。","「无法相，亦无非法相。何以故？是诸众生若心取相，则为著我、人、众生、寿者。","「若取法相，即著我、人、众生、寿者。何以故？若取非法相，即著我、人、众生、寿者。是故不应取法，不应取非法。以是义故，如来常说：『汝等比丘，知我说法，如筏喻者，法尚应舍，何况非法。』","「须菩提！于意云何？如来得阿耨多罗三藐三菩提耶？如来有所说法耶？」","须菩提言：「如我解佛所说义，无有定法名阿耨多罗三藐三菩提，亦无有定法如来可说。何以故？如来所说法，皆不可取、不可说、非法、非非法。所以者何？一切贤圣皆以无为法而有差别。」","「须菩提！于意云何？若人满三千大千世界七宝以用布施，是人所得福德，宁为多不？」","须菩提言：「甚多，世尊！何以故？是福德即非福德性，是故如来说福德多。」","「若复有人，于此经中受持乃至四句偈等，为他人说，其福胜彼。何以故？须菩提！一切诸佛及诸佛阿耨多罗三藐三菩提法，皆从此经出。须菩提！所谓佛法者，即非佛法。","「须菩提！于意云何？须陀洹能作是念，『我得须陀洹果』不？」","须菩提言：「不也，世尊！何以故？须陀洹名为入流，而无所入，不入色、声、香、味、触、法，是名须陀洹。」","「须菩提！于意云何？斯陀含能作是念，『我得斯陀含果』不？」","须菩提言：「不也，世尊！何以故？斯陀含名一往来，而实无往来，是名斯陀含。」","「须菩提！于意云何？阿那含能作是念，『我得阿那含果』不？」","须菩提言：「不也，世尊！何以故？阿那含名为不来，而实无来，是故名阿那含。」","「须菩提！于意云何？阿罗汉能作是念，『我得阿罗汉道』不？」","须菩提言：「不也，世尊！何以故？实无有法名阿罗汉。世尊！若阿罗汉作是念『我得阿罗汉道』，即为著我、人、众生、寿者。世尊！佛说我得无诤三昧人中最为第一，是第一离欲阿罗汉。我不作是念：『我是离欲阿罗汉。』世尊！我若作是念『我得阿罗汉道』，世尊则不说须菩提是乐阿兰那行者。以须菩提实无所行，而名须菩提是乐阿兰那行。」","佛告须菩提：「于意云何？如来昔在然灯佛所，于法有所得不？」","「世尊！如来在然灯佛所，于法实无所得。」","「须菩提！于意云何？菩萨庄严佛土不？」","「不也，世尊！何以故？庄严佛土者，则非庄严，是名庄严。」","「是故须菩提，诸菩萨摩诃萨应如是生清净心，不应住色生心，不应住声、香、味、触、法生心，应无所住而生其心。","「须菩提！譬如有人，身如须弥山王，于意云何？是身为大不？」","须菩提言：「甚大，世尊！何以故？佛说非身，是名大身。」","「须菩提！如恒河中所有沙数，如是沙等恒河，于意云何？是诸恒河沙宁为多不？」","须菩提言：「甚多，世尊！但诸恒河尚多无数，何况其沙。」","「须菩提！我今实言告汝，若有善男子、善女人，以七宝满尔所恒河沙数三千大千世界以用布施，得福多不？」","须菩提言：「甚多，世尊！」","佛告须菩提：「若善男子、善女人于此经中，乃至受持四句偈等，为他人说，而此福德胜前福德。","「复次，须菩提！随说是经，乃至四句偈等，当知此处，一切世间天、人、阿修罗皆应供养，如佛塔庙，何况有人尽能受持读诵？须菩提！当知是人成就最上、第一、希有之法，若是经典所在之处，则为有佛，若尊重弟子。」","尔时，须菩提白佛言：「世尊！当何名此经？我等云何奉持？」","佛告须菩提：「是经名为『金刚般若波罗蜜』。以是名字，汝当奉持。所以者何？须菩提！佛说般若波罗蜜，则非般若波罗蜜。须菩提！于意云何？如来有所说法不？」","须菩提白佛言：「世尊！如来无所说。」","「须菩提！于意云何？三千大千世界所有微尘是为多不？」","须菩提言：「甚多，世尊！」","「须菩提！诸微尘，如来说非微尘，是名微尘。如来说世界，非世界，是名世界。","「须菩提！于意云何？可以三十二相见如来不？」","「不也，世尊！不可以三十二相得见如来。何以故？如来说三十二相，即是非相，是名三十二相。」","「须菩提！若有善男子、善女人，以恒河沙等身命布施；若复有人，于此经中，乃至受持四句偈等，为他人说，其福甚多。」","尔时，须菩提闻说是经，深解义趣，涕泪悲泣，而白佛言：「希有世尊！佛说如是甚深经典，我从昔来所得慧眼，未曾得闻如是之经。世尊！若复有人得闻是经，信心清净，则生实相，当知是人，成就第一希有功德。世尊！是实相者，则是非相，是故如来说名实相。世尊！我今得闻如是经典，信解、受持不足为难，若当来世后五百岁，其有众生得闻是经，信解、受持，是人则为第一希有。何以故？此人无我相、人相、众生相、寿者相。所以者何？我相即是非相，人相、众生相、寿者相即是非相。何以故？离一切诸相，则名诸佛。」","佛告须菩提：「如是，如是！若复有人得闻是经，不惊、不怖、不畏，当知是人甚为希有。何以故？须菩提！如来说第一波罗蜜，非第一波罗蜜，是名第一波罗蜜。须菩提！忍辱波罗蜜，如来说非忍辱波罗蜜。何以故？须菩提！如我昔为歌利王割截身体，我于尔时，无我相、无人相、无众生相、无寿者相。何以故？我于往昔节节支解时，若有我相、人相、众生相、寿者相，应生瞋恨。须菩提！又念过去于五百世作忍辱仙人，于尔所世，无我相、无人相、无众生相、无寿者相。是故，须菩提！菩萨应离一切相，发阿耨多罗三藐三菩提心，不应住色生心，不应住声、香、味、触、法生心，应生无所住心。若心有住，则为非住。是故，佛说菩萨心不应住色布施。","「须菩提！菩萨为利益一切众生，应如是布施。如来说：『一切诸相，即是非相。』又说：『一切众生，则非众生。』","「须菩提！如来是真语者、实语者、如语者、不诳语者、不异语者。","「须菩提！如来所得法，此法无实无虚。须菩提！若菩萨心住于法而行布施，如人入暗，则无所见；若菩萨心不住法而行布施，如人有目，日光明照，见种种色。","「须菩提！当来之世，若有善男子、善女人，能于此经受持、读诵，则为如来以佛智慧悉知是人，悉见是人，皆得成就无量无边功德。","「须菩提！若有善男子、善女人，初日分以恒河沙等身布施，中日分复以恒河沙等身布施，后日分亦以恒河沙等身布施，如是无量百千万亿劫以身布施；若复有人，闻此经典，信心不逆，其福胜彼，何况书写、受持、读诵、为人解说。","「须菩提！以要言之，是经有不可思议、不可称量、无边功德。如来为发大乘者说，为发最上乘者说。若有人能受持、读诵、广为人说，如来悉知是人，悉见是人，皆得成就不可量、不可称、无有边、不可思议功德，如是人等，则为荷担如来阿耨多罗三藐三菩提。何以故？须菩提！若乐小法者，著我见、人见、众生见、寿者见，则于此经，不能听受、读诵、为人解说。","「须菩提！在在处处若有此经，一切世间天、人、阿修罗所应供养；当知此处则为是塔，皆应恭敬、作礼、围绕，以诸华香而散其处。","「复次，须菩提！善男子、善女人受持、读诵此经，若为人轻贱，是人先世罪业应堕恶道，以今世人轻贱故，先世罪业则为消灭，当得阿耨多罗三藐三菩提。","「须菩提！我念过去无量阿僧祇劫，于然灯佛前，得值八百四千万亿那由他诸佛，悉皆供养承事，无空过者；若复有人，于后末世，能受持、读诵此经，所得功德，于我所供养诸佛功德，百分不及一，千万亿分乃至算数、譬喻所不能及。","「须菩提！若善男子、善女人于后末世，有受持、读诵此经所得功德，我若具说者，或有人闻，心则狂乱，狐疑不信。须菩提！当知是经义不可思议，果报亦不可思议。」","尔时，须菩提白佛言：「世尊！善男子、善女人发阿耨多罗三藐三菩提心，云何应住？云何降伏其心？」","佛告须菩提：「善男子、善女人发阿耨多罗三藐三菩提者，当生如是心：『我应灭度一切众生。灭度一切众生已，而无有一众生实灭度者。』何以故？须菩提！若菩萨有我相、人相、众生相、寿者相，则非菩萨。所以者何？须菩提！实无有法发阿耨多罗三藐三菩提者。","「须菩提！于意云何？如来于然灯佛所，有法得阿耨多罗三藐三菩提不？」","「不也，世尊！如我解佛所说义，佛于然灯佛所，无有法得阿耨多罗三藐三菩提。」","佛言：「如是，如是！须菩提！实无有法，如来得阿耨多罗三藐三菩提。须菩提！若有法，如来得阿耨多罗三藐三菩提者，然灯佛则不与我受记：『汝于来世当得作佛，号释迦牟尼。』以实无有法得阿耨多罗三藐三菩提，是故然灯佛与我受记，作是言：『汝于来世当得作佛，号释迦牟尼。』何以故？如来者，即诸法如义。","「若有人言『如来得阿耨多罗三藐三菩提』，须菩提！实无有法，佛得阿耨多罗三藐三菩提。须菩提！如来所得阿耨多罗三藐三菩提，于是中无实无虚，是故如来说：『一切法皆是佛法。』须菩提！所言一切法者，即非一切法，是故名一切法。","「须菩提！譬如人身长、大。」","须菩提言：「世尊！如来说人身长、大，则为非大身，是名大身。」","「须菩提！菩萨亦如是，若作是言『我当灭度无量众生』，则不名菩萨。何以故？须菩提！实无有法名为菩萨。是故，佛说：『一切法无我、无人、无众生、无寿者。』须菩提！若菩萨作是言『我当庄严佛土』，是不名菩萨。何以故？如来说庄严佛土者，即非庄严，是名庄严。须菩提！若菩萨通达无我、法者，如来说名真是菩萨。","「须菩提！于意云何？如来有肉眼不？」","「如是，世尊！如来有肉眼。」","「须菩提！于意云何？如来有天眼不？」","「如是，世尊！如来有天眼。」","「须菩提！于意云何？如来有慧眼不？」","「如是，世尊！如来有慧眼。」","「须菩提！于意云何？如来有法眼不？」","「如是，世尊！如来有法眼。」","「须菩提！于意云何？如来有佛眼不？」","「如是，世尊！如来有佛眼。」","「须菩提！于意云何？恒河中所有沙，佛说是沙不？」","「如是，世尊！如来说是沙。」","「须菩提！于意云何？如一恒河中所有沙，有如是等恒河，是诸恒河所有沙数佛世界，如是宁为多不？」","「甚多，世尊！」","佛告须菩提：「尔所国土中，所有众生若干种心，如来悉知。何以故？如来说诸心，皆为非心，是名为心。所以者何？须菩提！过去心不可得，现在心不可得，未来心不可得。","「须菩提！于意云何？若有人满三千大千世界七宝以用布施，是人以是因缘得福多不？」","「如是，世尊！此人以是因缘得福甚多。」","「须菩提！若福德有实，如来不说得福德多；以福德无故，如来说得福德多。","「须菩提！于意云何？佛可以具足色身见不？」","「不也，世尊！如来不应以具足色身见。何以故？如来说具足色身，即非具足色身，是名具足色身。」","「须菩提！于意云何？如来可以具足诸相见不？」","「不也，世尊！如来不应以具足诸相见。何以故？如来说诸相具足，即非具足，是名诸相具足。」","「须菩提！汝勿谓如来作是念，『我当有所说法』。莫作是念，何以故？若人言『如来有所说法』，即为谤佛，不能解我所说故。须菩提！说法者，无法可说，是名说法。」","尔时，慧命须菩提白佛言：「世尊！颇有众生于未来世，闻说是法生信心不？」","佛言：「须菩提！彼非众生，非不众生。何以故？须菩提！众生、众生者，如来说非众生，是名众生。」","须菩提白佛言：「世尊！佛得阿耨多罗三藐三菩提，为无所得耶？」","「如是，如是！须菩提！我于阿耨多罗三藐三菩提乃至无有少法可得，是名阿耨多罗三藐三菩提。","「复次，须菩提！是法平等，无有高下，是名阿耨多罗三藐三菩提；以无我、无人、无众生、无寿者，修一切善法，则得阿耨多罗三藐三菩提。须菩提！所言善法者，如来说非善法，是名善法。","「须菩提！若三千大千世界中所有诸须弥山王，如是等七宝聚，有人持用布施；若人以此《般若波罗蜜经》，乃至四句偈等，受持、读诵、为他人说，于前福德百分不及一，百千万亿分，乃至算数、譬喻所不能及。","「须菩提！于意云何？汝等勿谓如来作是念：『我当度众生。』须菩提！莫作是念。何以故？实无有众生如来度者，若有众生如来度者，如来则有我、人、众生、寿者。须菩提！如来说有我者，则非有我，而凡夫之人以为有我。须菩提！凡夫者，如来说则非凡夫。","「须菩提！于意云何？可以三十二相观如来不？」","须菩提言：「如是，如是！以三十二相观如来。」","佛言：「须菩提！若以三十二相观如来者，转轮圣王则是如来。」","须菩提白佛言：「世尊！如我解佛所说义，不应以三十二相观如来。」","尔时，世尊而说偈言：",`「若以色见我，　以音声求我，
是人行邪道，　不能见如来。`,"「须菩提！汝若作是念：『如来不以具足相故，得阿耨多罗三藐三菩提。』须菩提！莫作是念：『如来不以具足相故，得阿耨多罗三藐三菩提。』","「须菩提！汝若作是念：『发阿耨多罗三藐三菩提者，说诸法断灭相。』莫作是念。何以故？发阿耨多罗三藐三菩提心者，于法不说断灭相。","「须菩提！若菩萨以满恒河沙等世界七宝布施；若复有人知一切法无我，得成于忍，此菩萨胜前菩萨所得功德。须菩提！以诸菩萨不受福德故。」","须菩提白佛言：「世尊！云何菩萨不受福德？」","「须菩提！菩萨所作福德，不应贪著，是故说不受福德。","「须菩提！若有人言『如来若来若去、若坐若卧』，是人不解我所说义。何以故？如来者，无所从来，亦无所去，故名如来。","「须菩提！若善男子、善女人以三千大千世界碎为微尘，于意云何？是微尘众宁为多不？」","「甚多，世尊！何以故？若是微尘众实有者，佛则不说是微尘众。所以者何？佛说微尘众，则非微尘众，是名微尘众。世尊！如来所说三千大千世界，则非世界，是名世界。何以故？若世界实有者，则是一合相。如来说一合相，则非一合相，是名一合相。」","「须菩提！一合相者，则是不可说，但凡夫之人贪著其事。","「须菩提！若人言『佛说我见、人见、众生见、寿者见』，须菩提！于意云何？是人解我所说义不？」","「世尊！是人不解如来所说义。何以故？世尊说我见、人见、众生见、寿者见，即非我见、人见、众生见、寿者见，是名我见、人见、众生见、寿者见。」","「须菩提！发阿耨多罗三藐三菩提心者，于一切法，应如是知，如是见，如是信解，不生法相。须菩提！所言法相者，如来说即非法相，是名法相。","「须菩提！若有人以满无量阿僧祇世界七宝持用布施，若有善男子、善女人发菩萨心者，持于此经乃至四句偈等，受持、读诵、为人演说，其福胜彼。云何为人演说？不取于相，如如不动。何以故？",`「一切有为法，　如梦、幻、泡、影，
如露亦如电，　应作如是观。」`,"佛说是经已，长老须菩提及诸比丘、比丘尼、优婆塞、优婆夷，一切世间天、人、阿修罗，闻佛所说，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T08n0235",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T08/T08n0235.xml",sourceLabel:"CBETA T08n0235",scope:"全经正文",originalTitle:"金剛般若波羅蜜經",juan:[1]},{id:"mahayana",title:"入大乘论",subtitle:"入大乘论 上下卷 · 坚意菩萨造 · 北凉 道泰等译",paragraphs:["今欲解入大乘义。问曰：何故说入大乘义？答曰：我为众生欲遮苦因故，汝今当知。或复有人近恶知识，为恶所误，偏执己法、专著邪见、颠倒思惟，不解实义、不顺佛智，诽谤圣说、诽谤圣说者，则坏正法。坏正法者，得大罪报，如世尊说：谤法之罪，重于五逆，恶道长远久受苦报。如偈说曰：",`「诽谤大乘法，　决定趣恶道，
此人受业报，　实智之所说。
生堕地狱中，　大火炽然身，
焚烧甚苦痛，　业报罪信尔。
炽然大铁犁，　具满五百数，
而耕其舌上，　遍碎身苦恼。
若从地狱出，　复受余恶报，
诸根常缺漏，　永不闻法音；
设使得闻者，　复生于谤法，
以谤法因缘，　还堕于地狱。」`,"谤法众生闻如是说，于大乘中便生疑心，如尊者提婆所说偈：",`「薄福之人，　不生于疑；　能生疑者，
必破诸有。」`,"若有疑者皆应听法，闻已意解便得开悟，得开悟已即生信心，生信心已便生喜乐，生喜乐已如是次第生闻思修，乃至具足得一切种智。因谤大乘而堕恶道，亦由大乘起诸善业，如人因地故倒，还依地而起。又因于智趣菩提道，亦与众生共和合有，若离众生则无有得菩提道者。从众生界出生一切诸佛菩提，如尊者龙树所说偈：",`「不从虚空有，　亦非地种生，
但从烦恼中，　而证成菩提。」`,"问曰：汝说善入摩诃衍论。如是功德云何名为摩诃衍耶？答曰：菩萨藏处名摩诃衍。","问曰：佛不说三乘亦摩诃衍乎？答曰：如是。此大乘中亦说三乘即名三藏。如《菩萨藏经》中说，佛告阿阇世王：族姓子！藏有三种。何等为三？谓声闻藏、辟支佛藏、菩萨藏。族姓子！非以声闻乘故名为三藏，亦非以辟支佛乘故名为三藏，唯诸菩萨所学大乘得名三藏。何以故？夫说法者具足三乘乃名三藏。以菩萨说法能具三乘故，是故我说名三藏耶。族姓子！有三种学人：声闻学、辟支佛学、菩萨学。声闻乘者不学辟支佛乘。何以故？非所解故。辟支佛乘者不学菩萨乘。何以故？亦非所解故。族姓子！唯诸菩萨虽学声闻、辟支佛乘，而不证于声闻、辟支佛道。学菩萨乘，深知菩萨所行之法，常乐随顺。以是义故，菩萨乘者名为三藏，非谓声闻、辟支佛乘。于余经中以具分别，是故我今但略说耳。如汝意谓非三藏者，汝今但以《增一阿含》、《中阿含》、《长阿含》、《杂阿含》百千等偈以为一藏，毘尼、阿毘昙二百千偈名为二藏，尽具修习，名为三藏。若如是说，不名三藏。所以者何？诸余经等则非佛说，有如是过。阿含、毘尼、阿毘昙等亦是三藏。杂藏、舍头罗经、胎经、谏王本生、辟支佛因缘，如是八万四千法藏，尊者阿难从佛受持者，如是一切皆有非佛语过。若无过者，当知一切尽是佛说。如是所说若皆是藏，此则便有百千等藏。汝言三藏，是语自坏。复有阿难所不受者，佛成道二十年后方于僧中自言：我年老大，须供给人。若能为我作给侍者，当自言能。尔时大众和合，即差阿难为佛侍者。阿难便语同梵行人：如来有八万四千法聚，我今悉能受持。唯先二十年中，有二比丘所受持者，皆悉不了。以是义故，当知阿难所受持者，不名多闻。佛所说法中，阿难实有不任器者，如《中阿含》说，释提桓因语欝多罗言：尊者！我得他心智，观阎浮提一切众生，无有尽能受持佛法；唯除尊者，余不能了。以是因缘，当知阿难非悉能持一切佛法。声闻弟子及以阿难不任法器，诸大乘经已具广说。如《首楞严经》中，佛为净月藏天子说：阿难所持少不足言，不受持者乃有无量。我所知法百千亿分不说其一，阿难于我所说法中百千亿分不持其一。善男子！我于一日一夜，十方世界梵、释、四天王、天、龙、夜叉、乾闼婆及诸菩萨一切来集，为说智慧修多罗偈颂章句，众生所行诸波罗蜜，及说声闻辟支佛乘厌恶生死、赞叹涅槃、满足诸波罗蜜，乃至为诸天子广演说法一日一夜，假使满阎浮提如微尘数多闻智慧皆如阿难，于一日一夜百千亿分亦不能持具足一分。乃至复满十方微尘世界皆如阿难，不能尽持亦复如是。处处经中亦说，阿难不任法器。以是义故，当知阿难不能尽持一切佛法。","问曰：如来世尊不说阿难于多闻中为第一耶？答曰：佛于声闻众中假说阿难以为第一，非谓菩萨。又复汝等于阿难所持尚不尽闻，况于大乘具足深义！汝意若谓是声闻乘即大乘者，此事不然。何以故？因果异故。若声闻乘因与大乘因而不异者，果亦应不异。现见果异故，当知因亦异。何以故？声闻学者但断结障、观无常行、从他闻法。菩萨所断微细诸习，乃至究竟观一切法，不从他闻得自然智、无师智。以是义故，非以声闻乘同大乘也。","问曰：佛不说解脱无异也。答曰：声闻解脱时，颇能令使须弥山等尽向道场、悉皆曲躬，光明遍照十方世界，八十由旬一切魔众悉来降不。菩萨解脱，如上所说悉能为之。以是义故，佛于余经虽说解脱相等无异，大小实殊。犹如虫啮芥子中空，虽有空名，当与十方世界中空得为一不？空虽不异，大小有别。又如荧火欲等日月，亦如蚊子比金翅鸟。如娑留枝比丘说佛本行偈：",`「一切诸光明，　灯焰与掣电，
星月照差别，　日光最第一。
飞行诸禽兽，　蚊蚁及与蜂，
众鸟飞各异，　金翅最不同。」`,"以是故，虽少相似，大小有殊。当知因既有异，果岂同耶？汝言解脱无异，如是观察解脱不同。声闻解脱名爱尽解脱，非一切解脱，但为钝根少智众生假分别说；大乘解脱，断烦恼习一切都尽，为利根菩萨广分别说。如汝今说声闻解脱即大乘解脱者，如来则非一切种智。有如是过。如佛小疾，遣目连诣耆毱所，当须何药。是时耆毱已亡七日，生忉利天，目连即便诣彼天所。尔时耆毱将入后园，即便问言：如来有疾，当须何药？答曰：用酥。如来身者犹如金刚，诸恶已灭岂有疾乎而问耆毱？如婆拘罗比丘，于九十劫前以一药果施同梵行者，于九十劫中身常无病。于最后身，年至八十初无微病。正以此一诃梨勒果微施因缘尚得无病，况复如来亿百千万阿僧祇劫具足檀波罗蜜、备诸功德，乃至截身手足髓脑血肉而施病者，以是因缘岂得疾耶？如经所说则现如来非一切智。如来又时入城乞食，空钵还归。为度于提婆达多令使出家，如《枯树经》说，见大火聚，尔时诸比丘中便有生退心者。为度马师、满宿故，数数骂婆罗门、夺赖阇。萨遮、尼干。孙陀利等。于九十日中受食马麦，目连、舍利弗入于陶室，乃有如是等事。汝意若谓有余业者。此则不然。何以故？如来已尽一切诸恶、具满一切无量功德。有余恶业则有大过，汝曾不闻诸经中说如来永断一切烦恼业结习耶？如摩陀遮离所说偈赞：",`「一切结习尽，　唯有救世者，
一切智所有，　功德悉成满。」`,"有三种习，所谓业习、烦恼习、威仪习，此三种习如来永尽。以是因缘，若有余业此则大过。汝今若谓是方便者，此亦不然。何以故？汝意先谓佛身是实，不言方便及与应化。汝常自言佛身是一，何得复有方便应化？汝于何经闻说方便及应化耶？汝经中说唯有后边身，不言别有法身与应化方便身异。而我《十住经》中所说别有法身，不与方便应化身同。是故大乘经中说佛是一切智，则无有过；汝小乘中说一切智，则有大失。若谓声闻乘即是大乘，此事不然。大乘者与声闻乘则有差别，以广大故。汝意若谓声闻乘中显示大乘，是亦不然。何以故？理相违故。声闻乘者从他闻法，大仙之乘绍三宝种不断绝故。如毘琉璃宝终不出于水精之中，体差别故。是故大乘微妙甚深，其心广大。菩萨摩诃萨次第修学，始从初地乃至十地，具足一切功德智业，是故佛说名为摩诃衍乘。若声闻乘从摩诃衍出，则有是理。是故菩萨修学十地，具满一切诸波罗蜜故，能出生三乘善法。如《十地经》说，金刚藏菩萨语解脱月菩萨言：佛子！譬如字章，字本为初，一切文字皆出字本。如是佛子！一切佛法亦复如是，以地为初，亦从于地而得究竟成自然智。是故大乘名曰甚深，出生一切声闻功德，非谓小乘能出大也。佛说十地，犹如金聚具足无失，云何不受？如来以慈悲力，为钝根故说声闻乘。而汝信受，便自偏执受行小法，不信大乘平等正教。是故当知佛说大乘名最吉胜。","问曰：世尊昔说：于我灭后当来世中，多有众生起诸诤论，此是佛说、此非佛说。是故如来以法印印之，若义入修多罗、随顺毘尼、不违法相，是名佛说。答曰：佛亦不言声闻乘者非是我说，乃至菩萨大乘亦复如是。佛说不异，等一相故，以法印印。汝言入者，为是义入修多罗、为文字入耶？若以文字入者，无有是处。何以故？十二部经一切文偈章句各异，是故当知非文字入。若以义入，理不相违。义者，若顺修多罗义，与法相相应其义显现，是故名为顺修多罗耶。若显示声闻法，名声闻乘，随顺入修多罗。若显示辟支佛法，名辟支佛乘，随顺入修多罗。若显示菩萨法，名菩萨乘，随顺入修多罗。若我显示十地功德、明菩萨行，是名真说，随顺入于大乘。但汝意偏党，独谓入小乘三藏。大乘三藏中我已说入，是故三藏即是大乘。何以故？十二部中说毘佛略即是大乘。如《中阿含》说，云何名比丘？所谓知法，以能善解十二部经，修多罗乃至忧婆提舍。毘佛略者是摩诃衍。何以故？毘佛略经为诸众生说修对治法故名毘佛略，亦有众多乘故名毘佛略，亦以多庄严具故名毘佛略，亦能出生无量大果报故名毘佛略，非是称量所能知故名毘佛略，除断一切诸邪见故名毘佛略。若汝意谓，我声闻法中广说修多罗偈颂章句亦名毘佛略者，无有是处。何以故？汝依阿含说为毘佛略，但有言语。若但言语，此非可信。若《阿含经》中必有斯义，何处章句为声闻说是毘佛略？若无定文，是故当知毘佛略者显发大乘，非谓声闻小乘说也。汝声闻经一部所说，终无百千偈赞文句，况复当有亿万广说。如来世尊教诸声闻，唯示无常令厌生死，使知苦本速求涅槃。从初如是乃至奉行，句味尠少，则无甚深广大之义。大乘经说菩萨所为，其事深广。如《大喻经》、《贤劫三昧经》、《解脱经》、《华首经》如是等，悉是摩诃衍，皆名毘佛略。如《结解脱经》中，善财童子诣善知识海幢比丘所，十二年中入大海三昧，白海幢言：此三昧中深广无边，更有法门大此三昧不？说是语已，于大海三昧中见大莲华，佛从中出，即以右手摩海幢顶，赞言：善哉善哉！善男子！更有普眼法门，汝当受持。海幢即受普眼法门章句，次第为他广说，告善财言：善男子！我于一刹那顷所可受持普眼法门，用大海水尽以磨墨，积大纸聚犹如须弥山，天下草木持以为笔，三千世界水陆众生悉为书师，于一刹那顷所受法门百千分中犹不能书尽其一分，况复一日一夜乃至十二年中所受甚深无量无边大分要义。善财童子于一善知识所，从闻法已能如是无量无边过亿千数，况复咨问微尘世界诸佛等边，及善知识所受教法。以是因缘，具足大乘名毘佛略，无量无边非声闻耶。此义甚深，是故一切声闻所修行法悉入摩诃衍道，最为大吉，是名随顺修多罗义。今当复说随顺比尼。三乘圣道皆同断贪欲、瞋恚、愚痴，名为比尼。修多罗者，分别因果。阿毘昙者，分别法相亦断烦恼。摩诃衍者，亦说断除贪欲瞋恚愚痴烦恼一切恶法。佛教声闻净己三业名为比尼。为菩萨说净己三业，乃至成佛，兼及众生满足一切尸波罗蜜。菩萨所持是自性戒，发菩提心得真实果。是故当知摩诃衍者随顺比尼。不违法相者，三乘经说不违十二因缘，大乘亦不违十二因缘。善观察者能知大乘即三法印，若不善观察则无大乘亦不具三乘。若诽谤摩诃衍者是大过罪，汝今若言此是魔说，佛所不说。然诸经中实无此语，若但口言为大乘者，是魔所说终不可信。汝意若谓是佛说者，犹如师子身中生虫则还食师子。三乘皆尔，不独大乘。是故当知摩诃衍者非魔所及，唯佛能说。","问曰：汝非魔说，我是魔乎？答曰。我与汝等俱非魔耶。","问曰：若谓我与汝等俱非魔，说言魔说者此则应遮。答曰：我大乘法利及与众生、顺于法相，故多魔事，是故如来于大乘中说言遮魔。汝小乘法唯能自度，魔不扰恼，何须遮乎？是以如来昔于《法华》及《般若经》中说，于当来世，多有众生喜起嫉妬故遮诽谤，堕于恶趣。汝所诵习，于何部经中言摩诃衍是魔所说？若汝经中不言摩诃衍魔所说者，自言魔说此亦叵信。汝意若谓声闻法中亦有遮断，但事已久灭难可证据。此亦不然。何以故？非处所故。若假令遮，佛以神力则能守护此法，经劫亦不坠没。是故当知汝言久者，但有言语。假令魔说，能除惑障、不违正法，虽曰魔说即是正法，与佛语不异。何以故？如佛所说依法不依于人，是以我今但从正理、不取名字。又我等所求能灭智障、烦恼障者，即是世尊，若实魔者终不能说菩萨之法。何以故？魔不能知菩萨从禅定生闻思修慧。厌离欲恶不善之法是大乘义，唯佛能说。从于初地乃至十地，如是次第，四禅、四无量心、四无色定、灭受想定、菩提心、诸波罗蜜，随宜方便成熟摄众生法。十善道、戒、闻、智慧、不放逸、离世八法、八圣道、转法轮、坚持头陀具足功德、苦空无常无我寂灭、十二因缘、出入诸禅、三解脱门、诸陀罗尼、三十七品助道之法、诸神通门、实谛四辩、禅智二轮以自庄严皆悉和合，游戏诸法而于生死涅槃等中不背生死亦不向涅槃，心常厌恶，正观诸地出离诸地，不堕声闻、辟支佛地，净佛国土，随顺法忍、无生法忍，不退转地、受正位地，力、无畏、不共法、相好法身，为众生故住于生死，顺转决定转，随顺不转决定不转。如是等因果次第法、不共法、非觉法，魔不能说，非魔境界故。魔有四种，若言阴魔作是说者，我终不说佛有阴身。又复若言实是魔说，如斯语者，弥勒菩萨亦应遮止。又尊者宾头卢、尊者罗睺罗如是等十六人诸大声闻，散在诸渚，于余经中亦说有九十九亿大阿罗汉，皆于佛前取筹护法住寿于世界。东方弗婆提渚、麦渚、粟渚、师子渚、阎浮渚、大阎浮渚、跋提梨伽处、罽宾乃至阿耨大池，诸贤圣等皆住，守护佛法。若言摩诃衍是魔所说者，则为佛法之大患也，诸贤圣等悉应遮断。是故当知言魔说者，皆是妄语，空作斯说。又大菩萨诸贤圣等皆护大乘，是摩诃衍绍三宝种不令断绝。","问曰：如汝所说，若摩诃衍是三宝种，皆悉拥护菩萨声闻。如今云何于诽谤大乘者何不遮止，使斯人辈不堕地狱、不趣恶道、不坏佛法。答曰：业报决定，不可除断。业有二种，一者决定增长、二者决定受报，非诸菩萨声闻贤圣所能除灭。造作恶业决定受报，不可救止。如瞿迦离比丘诽谤摩诃衍经是魔所说，当知是人必堕地狱，无能拔者。","问曰：汝言谤摩诃衍能入恶道。亦是麁语，我未信耶。答曰：汝言佛说摩诃衍是魔语者，即是诽谤三世诸佛，亦是一切众生大怨。所言甚麁犷，当受恶口不善重报，如佛偈说：",`「人生于世间，　如斧在口中，
自斩害其身，　斯皆由恶业。」`,"汝谤摩诃衍，如是麁语非我所说。我今但欲令汝不起诽谤，为利益故便作是说。犹如病人食不应食，良医瞻病，禁断不听，为怜愍汝妄作绮语，言摩诃衍是魔所说。过去诸佛已说摩诃衍、未来诸佛当说摩诃衍、现在诸佛今说摩诃衍，是名遮断诽谤摩诃衍论。菩萨为断诽谤大乘，是故演说初入摩诃衍论品。","问曰：汝已遮他不令诽谤，今当云何入摩诃衍行？答曰：菩萨当先具种性，随顺善行，所解广大、内心广大、界分广大、种性广大。性既具足，其心调柔，渐损烦恼、少贪瞋痴，好修诸善、精勤诵习。如是众生六根广大，能发大愿欲求佛道。种性相貌，如佛所说：下根、下性、下发道意，所愿亦下；中根、中性、中发道意，所愿亦中；上根、上性、上发道意，所愿亦上。是故诸佛随其根性，则以慈心分别教授。","问曰：若诸众生各有根性，云何应为随根说法？答曰：上根众生为说菩萨深妙法藏，以知根性堪菩萨行故说菩萨藏。","问曰：为菩萨藏者当住何地？答曰：有十种行到解脱地。能听菩萨藏时得十种法行，离解脱行便得入于菩萨之行。何等为十？一者修菩萨解脱行，若多若少皆悉修习。二者菩萨所有之法，若多若少皆悉书写。三者菩萨藏法，若多若少皆悉供养。四者菩萨之法，若多若少皆悉转读。五者菩萨之法，若多若少皆悉听受。六者菩萨之法，若多若少，皆悉受持。七者菩萨之法，若多若少皆悉习诵渐渐通利。八者菩萨之法，若多若少皆悉为他分别演说。九者菩萨之法，若多若少皆悉思惟善解义趣。十者菩萨之法，若多若少独处思惟修集增明。是名菩萨十行。第八者是菩萨闻慧，第九者是菩萨思慧，第十者是菩萨修慧。","问曰：菩萨得是闻思修已，当入何行？答曰：为得己地入解脱门，如是次第闻思修生。为见法界、得于己地，修三解脱门。","问曰：何等名为三解脱门？答曰：行空、无相、无愿。","问曰：云何为空？答曰：观我人众生无有自体、性相常寂。","问曰：云何解了？答曰：当入十二因缘。","问曰：是空解脱异十二因缘法耶？答曰：空与十二因缘等无异相，空即十二因缘、十二因缘即是空。何以故？因缘假起无有自体。如尊者龙树所说偈：",`「十二因缘空，　我今欲解说，
假名因缘法，　此即是中道。」`,"一切诸法悉皆空寂。何以故？皆属因缘，无自性故。","问曰：若一切法因缘生者，何故说言无体性耶？答曰：所言因缘，世谛故说。第一义谛则无体性亦无有生，既无有生亦无有灭，无生无灭即真寂灭，真寂灭者即是一切诸法寂灭，是故我说一切诸法无有体性。如《老母经》中世尊所说：姊！譬如因人因桴因鼓，众缘和合便有声出。如此之声，不在三世，亦非内外及在中间。其性空寂，无生无灭。姊今当知一切诸法体性亦然。《老母经》中佛自说空，是故菩萨于无量劫，修集福德、禅定、智慧，悉入三解脱法门。善观生灭皆悉空寂，犹如幻、炎、乾闼婆城，皆同梦化。如佛说言：",`「初觉十二缘，　众生皆悉空，
刹那顷所得，　幻炎干闼城。」`,"如是次第入空解脱门，其心快乐，逮得义利。","问曰：外道各著我见，云何遮断？答曰：如是外道，于内外色皆生染著，取我我所、顺生死流。彼著我者，我能施与饮食财利。如是种种依止我见、众生等见。彼我我所者，我之造作是我，瓶物如是等名依止我所。彼所作业，若一、若异、若一异、若不一不异，取著偏执，但以言语诳惑于世及以己身。以是义故流转生死，不解因缘诸法性空。","问曰：是诸外道不解因缘而起四执，何者为过？答曰：僧佉所说，有计一过。作与作者一、相与相者一、分与有分一，如是等皆名为一。优楼佉计异，尼健陀计一异，若提子计非一非异，一切外道及摩他罗等异计，皆悉不离如是四种。","问曰：僧佉人言作与作者一，有何过？答曰：语有二故，不名为一。作是因、作者名果，是事不同，云何说一？若实异言一，此则颠倒。何以故？以作者即是作故。作与作者前后时异，云何为一？","问曰：前后一用，如种生芽。时虽前后，但相似相续故名为一。答曰：此亦有过。若作在先、作者在后，生、未生异，云何为一？譬如有瓶终不得并，如牛角不相因生，作以作者亦复如是。复次所以作与作者不得为一，声别义别、因缘别时别、字别体别。若如是者，则有多过。若但一者，不应二名；声义体相先后异故，不得为一。若作与作者一，如取泥团，陶师、轮绳、酥酪等物皆悉应得。以不得故，当知非一。如我心不得为一，若是一者，心无常故我亦应无常。以是故作与作者、相与相者、量与量者、分与分者悉同是破，有一瓶等亦应破遮。如色与瓶一，及白㲲青叶、长短方圆，如是等物亦悉应遮。","问曰：比舍师计异，有何过耶？答曰：若作与作者异，亦有大过。","问曰：云何为过？唯愿说之。答曰：若瓶与泥异，作瓶时应取缕、作㲲时应取泥。以作瓶不取缕故，当知不异。复次泥团因微尘成，瓶因泥团成。若瓶异泥团者，瓶则无体。泥团成瓶故，不得为异。泥团于微尘为作者、于瓶为作，若作与作者异，泥于微尘瓶但名异，不应有二。以是故作与作者不得为异。因缕成㲲、因蒲成席，皆亦同是说。复次若有一瓶异，则一切法坏。何以故？若有一非瓶，离应有瓶。若有一是瓶，则为多瓶。有一非故，异亦应非，是则无瓶。以是义故，汝计异者即坏一切法。","问曰：如此说者非坏一切法。何以故？有一依瓶立，是故有一瓶等皆成。答曰：若有一与瓶合，有一应是瓶。若瓶与有一合，瓶亦应名有一，以有一合故不得为异。复次有一异者，犹如白㲲，此亦有过。何以故？白则非㲲、㲲亦非白，白与㲲异，余物亦然。如烧㲲时白不应烧，若㲲烧时白亦烧者，不得为异。汝今以言物异相异，此事不然。汝先言六事各异，此则应遮。","问曰：尼健陀先言一异，有何过耶？答曰：汝所谓一异者，或说作以作者一，或说作以作者异，此亦多过。","问曰：有何过耶？答曰：若作即是作者，事则不成。若作与作者异，事亦不成。何以故？因果各异，云何为一？以众缘成果故，不得为异。作相作者相亦皆如是。","问曰：如瓶相破而体不破，以体不破故，亦得为异，以见体在而相破故。若破瓶时，本成体无，不得为异。答曰：若言一，同僧佉破。若言异，同比舍师破。如叶青㲲白，亦皆俱破。","问曰：若提子计不一不异，有何过耶？答曰：前三计者各有所执。汝说不一，应当是异；若说不异，即应是一。何所执故而言不一不异？若无所执妄有所说则坏法相。","问曰：汝说大乘亦无所执，汝亦应坏一切法相。答曰：我之所执，世间现见是因缘法。汝之所说，但是颠倒不顺法相故。","问曰：何者是法相，而说我坏法相耶？答曰：无体相者即是体相。","问曰：云何无体相为体相耶？答曰：空名无体相。","问曰：云何名空？以有为空、以无为空耶？答曰：我不以有义故名空，亦不以无义故名空，以离于有无故名为空。如尊者龙树所说偈：",`「执有名为常，　计无则为断，
若离于有无，　是名真实空。」`,"复次如龙树《中论》中说偈：",`「执有取体相，　执无著无体，
不存于有无，　是名真实观。」`,"以是故，以离有无名空，离断常故名为中道。若能觉悟如是法相，故名为佛。是故十二因缘义，名之为空。","问曰：十二因缘以何为证而知为空？答曰：譬如瓶，泥团轮绳及以陶师众缘和合，然后成瓶。非即泥团是瓶，亦非离泥团有瓶。但假名说瓶，属众因缘，无有体相。无体相故无生，无生故体相寂灭。因缘所成，是故无体。若诸法定有自体、不假因缘，则无是处，以无自相故无瓶，瓶无故一切法亦无。如尊者提婆所说偈：",`「一法若有体，　诸法亦复然，
一切法本无，　因缘皆悉空。
真实观一法，　诸法不二相，
谛了是空已，　则见一切空。」`,"问曰：因缘生法即是体相。答曰：是事不然。何以故？若有体相、若无体相，非汝所及。如汝所说，以因缘为体相者，因缘从他生故，云何有体？言体相者，自性而起，不属因缘。若属因缘则无自性，譬如假借非自有也。是故因缘假他而成，无有自体。如尊者龙树所说偈：",`「因缘所生法，　是即无自性，
若无自性者，　云何有体相？」`,"问曰：诸法体相，世间现见。云何无耶？答曰：是事不然。凡愚妄见，此非可信。生灭之法皆悉是空，生灭流速无暂停时，相似相续故妄见为实，犹如灯炎念念生灭，凡夫愚人谓为一炎，亦如驶流、影、响、幻、炎。如佛所说，幻及幻者都无所有，而妄见者谓之为实。若是实者，饿鬼不应见水为火、沙石脓血。而诸众生以善恶故，随业所见，若有净心利根众生则能见空，夜叉饿鬼远见其水近则见火。便生疑惑：若物有实，不应二见。以二见故，则知非实，但妄见故。当知一切诸法皆无体相，以无体相故都无生灭。","问曰：若一切法无生无灭，云何得有来去计、断常过？答曰：以见种子故便计来去，若得法空则离断常。如因种子有芽茎枝叶花果，次第而见芽生故种子灭，是以不断。乃至果生故花灭，亦无常过。如尊者提婆所说偈：",`「诸法相续有，　则非是断灭；
因灭故果生，　不得名为常。」`,"以是故，见因缘空即离断常。","问曰：痴因缘行，云何而得离于断常？答曰：因无明故有善恶行，乃至因生故有老死。凡夫不解因缘相续，妄计为实。无明体空故行亦体空，乃至生体空故老死体空，以世间假名有相续故无断灭过，念念不住无有常过，以凡夫众生死此生彼相似相续故。如佛所说，第一义中无有众生死此生彼，但以世谛假名说故。识为种子，行业为田，以慢土覆，无明为粪，爱水为润，父母精气，众缘和合生名色芽，是故名色无有自体，犹如床脚相假而用。初名歌罗罗，二名安浮陀，三名肉段，四名坚实，五名诸炮开张，六名为触，生法次第相假而有，不名为断。菩萨善解因缘法故即知其空，以因缘空故一切法空，解法空故无断常过。如《出胎经》中佛所说偈：",`「随假名字，　而得诸法；　名中无法，
是则真实。」`,"以是故，非言说故有法。若随名字有诸法者，法则多体。犹如空法，无一、无多。","问曰：若一切法无体，汝言有过，现见有故。答曰：若法是有，言无则过。法既非有，云何言过？以是故，诸法如初，后亦复然。若诸法定有体相，后涅槃时应是断灭。若先非是空，后言空者，则是邪见，坏于正法亦无解脱。如尊者提婆所说偈：",`「不空而见空，　我应得涅槃；
邪见非涅槃，　如来之所说。」`,"诸法本空故恒见是空，如过去佛所见空相，今亦复然。是故我说因缘法空，是则无过。如是先立第一义谛，后分别世谛，我及众生、作与作者，乃至一异，则无过失。如尊者龙树所说偈：",`「不说分别谛，　不得于实谛，
若不得实谛，　则无得涅槃。」`,"复次说偈：",`「诸佛演说法，　常依于二谛，
分别于世谛，　及与第一义。
若不能分别，　真俗二圣谛，
如是则不知，　佛法甚深义。」`,"是故因缘法空，名为真如、法性、实际，是名修习第一义禅。见因缘空，即是空解脱门。若见空者，则不见诸法相，是名无相解脱门。见无相故，无所愿求，是名无愿解脱门。安住如是三解脱门，识种子于三界内则更不生名色等芽。识无取著，灭三有苦。三有灭故，得寂灭涅槃。如尊者提婆所说偈：",`「识是种子义，　游行于六处；
若见诸尘空，　有芽则断灭。」`,"问曰：菩萨度空出于生死，云何能得胜于声闻？答曰：菩萨得世间利、出世间利，度尔炎地故，虽出世间，能住世间教化众生。声闻不然，怖畏生死，求速灭度，以出世间道见于法界，见法界已到涅槃岸。菩萨不尔。何以故？菩萨见众生苦，起大悲心，为欲度彼坚住庄严，于阿僧祇劫修行出世间道，于一念顷观一切法界。观法界已，众生缘故，不取果证，乃能度脱。如佛《阿耨大池经》中说，譬如二人欲堕山顶，一人有力、善巧方便，以巧便故，虽堕还起，得升山顶。一人力少复无方便，即住退堕，不能复起。菩萨于无为法中不证不著，如善巧人得升山顶。声闻之人以证著无为故，如少方便者堕而不起。譬如长者唯有一子，以饥俭故远至他国，经数十年。长者后时住一大城，其家巨富多积珠珍，渐得佣力故还来本国。菩萨有无量无边阿僧祇功德，到尔炎地，向于涅槃，以愍众生故还入生死，于阿僧祇劫久受勤苦。菩萨摩诃萨乘大苦乘，求无上果不可思议，出过一切声闻、辟支佛上，具足一切功德智慧，是故超度尔炎之地。云何菩萨乘大苦乘？譬如有人乘船入海，遇大恶风涛波如山，有如是等无量众难。诸伴心急，生大恐怖。是时船师巧持帆故，能度众难。有福德人得度难已，获大珍宝。菩萨摩诃萨处生死海亦复如是，为恶知识不信所难，趣向恶道。第一阿僧祇劫修治净地行，求净解脱；第二阿僧祇劫修净禅定行；第三阿僧祇劫修净智慧行，除尔炎地障。是故菩萨名乘苦乘。满足十地，得无碍无障一切行具足故，得阿耨多罗三藐三菩提，是故以尔炎智得成大果。","讥论空品第二","问曰：汝先说调顺乘、大苦乘得妙果报，菩萨所得境界甚难了知。答曰：菩萨行处微妙甚难，于三阿僧祇劫乃可成就。无量百千万亿那由他劫在凡夫中，无有出世之法。如尊者提婆所说偈：",`「无量亿劫中，　常在凡夫地，
汝今应当知，　未来亦如是。」`,"是故菩萨行处甚大，亦复难得。散乱众生得闻甚难、能说亦难，况复修行。如尊者提婆所说偈：",`「生得值法难，　听说亦复难，
生死虽无际，　听法故有边。」`,"问曰：尊者先所说十地，愿时为我分别演说，何等为菩萨十地？答曰：初欢喜地、二离垢地、三名明地、四名焰地、五难胜地、六现前地、七深远地、八不动地、九善慧地、十法云地。云何名欢喜地？出过凡夫，得不思议出世间道，心生欢喜故，名欢喜地。云何名为离垢地？离破戒垢故，名为离垢地。云何名明地？依十二门禅，得明智慧故，名为明地。云何名焰地？得增上觉意分别道品，烧烦恼薪，功德炽然，故名焰地。云何名难胜地？修习十智，虽伏烦恼，未能胜故，名为难胜地。云何名现前地？能逆顺观十二因缘，得法现前故，名为现前地。云何名深远地？爱佛功德智慧次第不间余心，深入法相故，名深远地。云何名不动地？离色等相，坚固难动故，名为不动地。云何名善慧地？入四辩才，解一切音声，随其所问，于一刹那顷悉皆能答故，名善慧地。云何名法云地？能受一切佛法，犹如大云能注法雨故，名法云地。是名菩萨具足十地。如是十地，是菩萨安住行处，亦能满足一切智慧。如《十地经》中之所广说。若能如是知菩萨十地者，是名善知安住行处，亦名善知菩萨广大功德处所，亦能善知如来无量功德广大处所。若不能如是知者，我今立决定誓，当知是人于菩萨法及如来法皆悉不了。菩萨摩诃萨从初发意乃至十地，常修四行，如《宝顶经》中说，善知无明行、诸波罗蜜行、分别道品行、成熟众生行。如是四行，总入二轮，所谓福轮、智轮。菩萨诸地悉具二种，智果、福果。","问曰：云何成就二果？答曰：初地福果为阎浮提王；第二地福果为转轮圣王，主四天下；第三地福果为天帝释；第四地福果为焰魔天王；第五地福果为兜率陀天王；第六地福果为化乐天王；第七地福果为他化自在天王；第八地福果为千世界梵；第九地福果为二千世界梵；第十地福果为三千大千世界净居天王，如《花严经》广说。如来出生果报及摄受世界，是名菩萨福轮。云何名菩萨智轮？初地菩萨于一刹那顷得百三昧，见百诸佛神通，能过百佛国土，能动百佛世界，光明遍照百佛世界，能成就百众生，能知过去百劫、未来百劫，能入百法门，能现百身、复为一身，以百菩萨庄严眷属。若以愿力，复过于此百千万亿无量无边，亦非算数譬喻所知。若身力，若光明力，若神通力，若眼力，若声力，若行力，若庄严力，若住持力，若解脱力，造众善业，是名初住菩萨于刹那顷成就如是无量功德。二住菩萨得千三昧，如是广说。三住菩萨得十万三昧，余亦如初住广说。四住菩萨得亿三昧，余亦如初住广说。五住菩萨得千亿三昧，余亦如初住广说。六住菩萨得万亿三昧，余亦如初住广说。七住菩萨得亿百千那由他三昧，余亦如初住广说。八住菩萨得十三千大千世界微尘数三昧，余亦如初住广说。九住菩萨得十佛世界百千阿僧祇微尘数三昧，诸余功德如初住广说。十住菩萨得十佛世界不可说不可说亿百千那由他微尘数三昧，诸余功德如初住广说。于一刹那顷乃至见十佛世界不可说不可说亿百千那由他微尘数诸佛，如初住菩萨于一刹那顷见百佛世界乃至成就百众生，十住菩萨亦复如是。","问曰：如佛所说，一世界中无二佛出。云何菩萨见十佛世界不可说不可说亿百千那由他微尘数诸佛？答曰：诸佛说言一世界中无二佛者，为彼钝根小心众生，不为利根大心者说。如汝经中说，一世界无二转轮圣王、无二佛出。然诸四天下实有众多转轮圣王，诸佛出世亦复如是。","问曰：释迦牟尼佛亦能遍一切佛国，何必余佛？答曰：若如汝言，但一佛能遍满一切世界者，不应有过去大释迦牟尼佛、七佛出世得成正觉。是以我言多佛无过。假使释迦牟尼佛神力能遍一切世界，今无量诸菩萨等广修万行，功德满足皆当成佛；无有一人独成正觉，而障诸菩萨使不成佛，无有是处。如《阿含》、《枯树》、《法轮》及余诸经，说是经时有六十比丘漏尽意解，俱得阿罗汉果。菩萨亦尔，功行齐等同时成佛，当知十方有无量诸佛。又《金沙》、《阿含》二部经说，有佛始成、有佛现在、有佛灭度。复次说偈：",`「过去无量佛，　未来亦复然，
及今成佛者，　皆灭于愁忧。
一切尊重法，　今本皆修行，
未来亦复然，　正觉法如是。」`,"昙无毱多亦说是偈：",`「顶礼一切佛，　漏尽无有上，
无量诸佛身，　正觉最胜尊。
正觉所生处，　并及得菩提，
能转正法轮，　入无漏涅槃。
若住若经行，　如来之所坐，
卧如师子王，　我今皆悉礼。
上下诸世尊，　方面及四维，
法身与舍利，　敬礼诸佛塔。
东方及北方，　在世两足尊，
厥名曰难胜，　彼佛所说偈。
若以此偈诵，　常赞于世尊，
生死百劫中，　终不堕恶道。」`,"如佛为尊者目连说言：非汝退神足，但是舍利弗以神通力，用其衣带系难胜坐。如是等佛而汝经中自作此说，况摩诃衍辩明诸佛无量无边，等于法界、同虚空界诸佛世界悉有诸佛。初地菩萨身行清净，虽有结使而不能扰。七住菩萨不名断结，亦不名有结。云何名不有结不断结？以不为结使所扰故名为无结，爱佛功德故名为有结。第二阿僧祇劫满足得于八地，一切行具足无有所作，一切结使尽故得成菩提，空静住处得灭尽定如阿罗汉。如是得无生法忍，若诸佛不劝请者，即于彼定入无余涅槃。如经中说，得无生法忍，离烦恼障，如阿罗汉。得寂灭无余，离于生死，得十自在。何等为十？寿命自在、得心自在、众具自在、作业自在、生处自在、解脱自在、神通自在、愿自在、法自在、智自在。得如是自在，善修如意足故。降伏四魔。何等为四？阴魔、烦恼魔、死魔、天魔。为众生故皆悉一味，得无缘慈。犹如如意药树，随众生所愿，皆使成就。","问曰：云何菩萨自身作业，能令众生随愿令得？答曰：菩萨以慈心为体，犹如见毒而能杀人，众生见菩萨故便得利益。","问曰：八住菩萨以尽结使，云何最后身菩萨生罗睺罗？答曰：诚如所言。若最后身菩萨有实欲者，乃至无佛可得，况罗睺罗。","问曰：云何无佛？答曰：若毁戒，无尸波罗蜜。若无尸波罗蜜，则无诸波罗蜜。如佛所说，若无戒则无施，无施则无忍，无忍则无精进，无精进则无禅定，无禅定则无智慧，无智慧则无一切诸功德，无一切诸功德则无佛，无佛则无罗睺罗。汝何以疑生罗睺罗有结无结？八住菩萨无诸烦恼，如阿罗汉，以方便力故现受五欲、作诸过恶，舍四天下转轮王位，令使众生得厌离心。犹如娑留枝比丘说佛本行偈：",`「一身为多身，　作已极为胜，
非实亦非虚，　各各令喜悦。
放恣生欲意，　盛壮狂所乱，
现同行于欲，　引令到彼岸。
禅智能烧灭，　欲界诸结使，
欲结甚狂逸，　能示现其心。」`,"菩萨观欲知如幻梦，是故以此令转其意，大悲菩萨作诸幻术而化其心。","问曰：云何作此幻术诳惑众生？答曰：菩萨常以四摄法方便教化一切众生。同事利益，为破结使故。如翅烧菩萨本事因缘，以欲狂心担负死尸走唤歌舞。菩萨方便亦现同彼，为除彼女炽欲忧患故现同事，不名妄语。一切菩萨方便同事，皆非妄语。世间幻术少有利益，菩萨得无量解脱如幻三昧门，诸有所为能大利益成就众生，故无有过。","问曰：罗睺罗为是应化、为真实耶？答曰：二俱无过。菩萨身者即是天身。如《本起经》说，佛告阿难：如来为众生故出现于世，不以天身转于法轮。何以故？欲令众生不懈怠故。佛以天身得成正觉，非我凡夫之所能成。以是故天中天为怜愍众生故，示现世间，有其父母妻子眷属。若是幻化现有罗睺罗，此亦无过。若是实人，亦无有过。菩萨方便得不思议解脱，住于大地，成就众生，互为化生父母兄弟妻子。","问曰：罗睺罗是菩萨耶？答曰：不但罗睺罗独是菩萨，住迦毘罗卫城诸释种童子，阿难、难陀、提婆达多、阿㝹楼驮等，皆是大力不退转菩萨。如婆罗楼志于本行经中所说偈：",`「或是大丈夫，　或是佛所化，
提婆达多者，　大仙之同伴。
或复为父子，　常作内眷属，
菩萨有大力，　权变能为此。
共佛及余人，　菩萨诸大仙，
阿难难陀等，　那律释摩南，
跋陀与桎沙，　忧波桎丽等，
作父子眷属，　咸皆共围绕。」`,"问曰：提婆达多于五百身中，常与菩萨而作大怨。云何复言名菩萨耶？答曰：提婆达多非佛怨耶。何以故？若提婆达多是佛怨者，菩萨修善，提婆达多恒造诸恶，云何世世得与菩萨共俱相值？以是义故，提婆达多非菩萨怨。譬如二人各行，一人趣东、一人向西，步步相远而常违背，云何为伴得相值耶？若提婆达多是菩萨怨者，如来世尊应有大过。","问曰：有何过耶？答曰：若尔者，佛非一切智、亦无神力、是为愚痴、则不能得拥护众生、非金刚身、如来便应有余业不能断尽。云何知佛非一切智？如来在耆阇崛山，为提婆达多推石所压而不觉知，是故当知如来非一切智。云何名为无有神力？提婆达多持杵打害，不能禁制，以是当知无有神力。云何名为愚痴。现见害至而不知避，是以当知为愚痴也。云何名为不能拥护众生？提婆达多作五逆罪而不救度，以是当知不能拥护众生。云何名非金刚身？转轮圣王以少福报而无怨害，何况如来转法轮王为石所压身血流现，当知如来非金刚身。云何名有余作业不能断尽？为他所打，当知如来余业不尽。若欲令佛无是过者，如来便应悉灭怨敌。但以善巧方便，欲令众生起厌恶心，现作逆害堕于地狱，欲示业报不可坏故。又复欲为堕地狱者，归依如来、请佛救护。又为来世豪贵之人入佛法中，若有恃其势力，复以鞭杖加打于人，令此众生便作是念：如来之身犹被毁害，况我凡夫薄福德者。汝言逆罪，但是菩萨善权方便。如是逆罪名虽有五，而实有二：破僧、害佛，如是等业世间所无。提婆达多是大宾伽罗菩萨，为遮众生起逆罪故，现作二业堕于地狱。菩萨摩诃萨随所应作以化众生，乃至现同魔业，令魔波旬以三玉女显现如来无欲之相。又雨刀剑、一切𫓴矟，显现如来无瞋恚相，亦无贪爱及愚痴相。","问曰：天魔来意，欲坏如来正觉之心。汝云何言欲显如来无贪瞋耶？答曰：不为遮断。何以故？若如来出过魔界，犹为魔遮者，大梵天王亦出魔界，云何不遮菩提？是道之妙果，无能夺者亦无与者，故不可坏。言魔扰乱，凡有二义。何等为二？一者实有恶业，为魔所扰；二者为进新学令心坚固，为魔逼试，实是菩萨真善知识现作魔来增益功德。譬如道路，以恐畏故疾度崄难；犹如好牛，以少鞭杖则得调利。","问曰：天魔亦有是菩萨耶？答曰：非但此世界魔是菩萨，十方世界魔王者多是菩萨。如《维摩诘经》中所说，十方世界作魔王者，多是住不可思议解脱菩萨。能乞手足头目髓脑，如是言者，皆是住不可思议解脱菩萨。何以故？若非菩萨者未堪斯事。譬如香象蹴踏非驴所及，唯诸菩萨乃能行耳。如彼广说。以是义故，当知菩萨善知众生种种所行，为欲显其功德智慧方便力故，或现作杀杀者、作乞乞者。","问曰：若罗睺罗实是菩萨者，云何复言声闻阿罗汉耶？答曰：菩萨亦名声闻，亦名阿罗汉。何以故？令一切众生闻阿耨多罗三藐三菩提，故名声闻。于一切天、人、阿修罗应受供故，名为应供。菩萨摩诃萨为化众生故，现作声闻阿罗汉。","问曰：诸余声闻亦是菩萨耶？答曰：诸余声闻亦有是菩萨者，如《法华经》中舍利弗等五百弟子悉是菩萨，皆当作佛。一切声闻皆是阿鞞跋致菩萨，如《不退转法轮经》中广说。以是故，当知菩萨皆现为声闻。","问曰：一切声闻皆成佛不？答曰：声闻成佛，此亦无过。","问曰：云何无过？答曰：先断结障，后断智障，净治诸地向一切智，是以无过。","问曰：烧灭结使，如焦谷芽。云何得佛？答曰：若如汝言，断灭结使不得成佛者。汝及一切众生皆具诸烦恼，即应是佛。汝意若谓具烦恼人非是佛者，离烦恼者应当得佛。汝言烧烦恼结如焦谷芽而不成佛，亦无是处，我不欲令具烦恼种生佛法芽。汝痴无智、颠倒解故，谓烦恼为佛法种。阿罗汉初断烦恼，后除智障，修菩提道得成正觉。阿罗汉中有少断智障者、有不断者，有得无诤三昧者、有不得无诤三昧者，有得五神通者、有不得五神通者，有得四辩者、有不得四辩者，有得禅出入自在者、有不得禅出入自在者。何以故？不断一切智障故。","问曰：云何名为智障？答曰：出世间无明名为智障。犹如娑罗留枝本行中说偈：",`「无明有二种，　世间出世间，
世间无明行，　贤圣已远离。
愚痴无妙解，　不能如实知，
依止此心识，　法界诸崄处。
未能及本原，　云何决定出？
法身证涅槃，　唯佛能了知。」`,"佛婆伽婆乃能知其体性智慧，及大悲断结，是名声闻所断智障。声闻有二种，一者勤修禅定，是钝根人；二者回向菩提，能断智障，是利根人。乐行禅者，如《宝良经》说，犹如水精，终不能成摩尼宝珠。声闻修禅亦复如是，终不能成菩提果也。此是诸佛境界，非我所知。一乘多乘，今但略举其义，以明佛教不相违背。我未能了。譬如长者远行疲极，现作化城。此经中说，但有一乘，实无有三。佛亦自说，唯有一乘，更无二三。","问曰：如来以何行得断结使而成佛耶？答曰：经中说言，佛告阿难：能修四如意足者，若住一劫若住多劫，乃尽生死。一切诸经皆同是说。若汝言无烦恼者，我亦如是。若有亲爱信归于我，当为汝说。","问曰：云何住寿？答曰：阿罗汉无烦恼，与八住菩萨同，善修如意足故，能随意住世，乃至尽于生死。罗睺罗、宾头卢等尽住于世，为以此身住世、为更有余身住？若以实身而住世者，则无其义。若变化身住寿多劫，斯有是处。亦如僧祇中说青眼如来等，为化菩萨故，在光音天与诸声闻众无量百千亿那由他劫住，如彼天中声闻住寿多劫。当知此界亦有声闻能如是住。声闻无结能如是住者，当知八地菩萨亦能如是尽生死住。","问曰：佛言弥勒菩萨一生补处。以是因缘当知菩萨有生耶？云何得名无生乎？答曰：言有生者是戏论法。菩萨摩诃萨以方便力示现受生，非是真实。如维摩诘语弥勒菩萨言：无生可得，云何如来授仁者记一生当得阿耨多罗三藐三菩提？为过去生、未来生、现在生？若以过去生，过去生已灭。未来生，未来生未至。现在生，亦无住故。如观过去未来现在生皆不可得，是故我说八住菩萨于第二阿僧祇劫尽有作行、住无作行，如阿罗汉断结使而说偈言：",`「从初发意来，　方便行诸地，
得到第八地，　自在尽诸结。」`,"顺修诸行品第三","问曰：如向所说，八地菩萨善断烦恼一切结使，云何成佛得一切智？答曰：菩萨摩诃萨除身诸恶、寂灭结使，离于生死、游戏自在，金刚力士常随护助，获得清净金刚之身，如《如来藏经》中广说。得四辩智，净治第九地，于二千梵中得自在力，能善说法为大法师，能入如来秘密之藏。净治第十地，得无量无边禁呪方术，能令一切自在无碍，作摩醯首罗天子，亦为一切世间依止。","问曰：所言摩醯首罗者，为同世间摩醯、更有异耶？答曰：是净居自在，非世间自在。汝言摩醯首罗者，名字虽同而人非一，有净居摩醯首罗、有毘舍阇摩醯首罗。其净居者，如是菩萨隣于佛地犹如罗縠障，于一刹那顷，十方世界微尘数法悉能了知，能以口吹十方世界皆大震动。又以一身遍一切佛国，亦如皇太子初受职时，以己业力故大宝莲华自然化出，受一切种智位，坐宝莲华王座，有无量菩萨亦坐莲花上而自围绕。坐宝莲花已，十方世界诸佛放大光明照此菩萨受灌顶位，如转轮圣王长子受王位时。受灌顶已，即于彼座断除智境微细之障，得首楞严三昧、毘楞严三昧、法华三昧，得一切实法决定三昧、不可思议解脱三昧、甚深无畏海水三昧、微妙清净离垢三昧、诸法平等无言说三昧乃至金刚三昧。得如是诸三昧已，悉无障碍，一切行满足，觉一切智境，成阿耨多罗三藐三菩提。成正觉已，得如来十力；得四辩智、十八不共法，能遍至一切佛国；得一切诸佛不坏法身，遍满一切法界；一切身口意业相皆悉除灭；得无为寂灭处。登如来地有二因缘，一于一切世间显现色身，悉以本愿无作业力；二以众生分别想异，是故能作种种色像皆悉应之。是名如来无碍法身。","问曰：如经中说，从初出家能住佛法名为法身。答曰：此事不然。汝若以是名为法身，唯法无佛，则无三归。若欲令具三归依者，始从初地乃至十地在净居天成于正觉，自在应化名为法身，具足三宝。","问曰：若以如是名法身者，虚诳无实。何以故？如来具足功德，舍兜率天、降阎浮提生于王宫，于后边身得成菩提。云何而言于净居天得成佛道名为法身耶？答曰：非阎浮提成佛，十地功德非欲界法，况于阎浮提得成正觉。我先不言八住菩萨尽一切结漏能作千世界梵王，九住菩萨作二千世界梵王，十住菩萨作三千大千世界梵王。以誓愿力故生净居天，斯有是处。于阎浮提实身成佛者，则非其义。以是义故，当知净居天成佛，非阎浮提乎。","问曰：假使生于阎浮提得成佛者，亦能于三千大千世界而得自在。答曰：此事不然。何以故？福德果报决定有处，汝不知故而作是说。若释迦牟尼佛生阎浮提，于三千大千世界得自在者，于一切十方世界亦应自在。","问曰：纵令十方皆使自在，复有何过？答曰：若尔者，但是一佛世界，十方诸佛则无依果。复次如诸经说，皆谓释迦如来王领三千大千世界，不言乃至十方世界。若如汝语，则无因果。如经中说，诸佛出世，国土众生皆是依报，各有齐限。是故当知，在净居天成于正觉，领三千大千世界，非阎浮提。","问曰：若佛非阎浮提成正觉者，如来四塔则无利益。答曰：我先不已说耶。若以结使因缘受身，则无成道、无尸波罗蜜，若无尸波罗蜜则无诸波罗蜜，若无诸波罗蜜则无佛，若无佛则无四塔。","问曰：汝之所说皆非义理。何以故？一切诸部论师皆说，一切诸佛皆从阎浮提出。而释迦如来生于林弥尼园，在伽耶城坐于道场成等正觉，于波罗㮏而转法轮，拘尸那城入般涅槃。是故汝言非也。答曰：此事不然。何以故？我意不欲令诸如来于此而出，在首陀会天而成正觉。若首陀会成正觉者，则无王宫生亦无出家亦无成道。何以故？若尔，如来便无亲族，亦无生处亦无有灭。如《法华经》、《智照经》、《如来出生经》皆广说，如来不生不灭。迦叶亦自说言，我依一切种智出家。当知此义即是示现如来不生；于金棺内而出其脚，迦叶致礼，则明如来不灭。是故当知如来法身不生不灭。","问曰：如来都无少生灭耶？答曰：我今依理正说如来实无生灭，非为虚妄。如来但以方便示现生灭，皆是不可思议，为化众生故。如佛于《修赖经》中说，我于娑婆世界若以实身现者，则无一人而受我化。是故此处最为甚深，亦是秘密，亦名显现，皆为下根众生智慧微浅，不能得知甚深之法，是故方便为现斯事。以偈颂曰：",`「大乘甚深广，　显现易可说，
钝智心狭劣，　闻则怀惊疑。
真是佛子者，　能知其甚深，
今乃真实说，　但为求佛者。
成就于二乘，　人天诸利根，
受福乘此乘，　是名大乘道。
大乘能出生，　声闻缘觉道，
若遮大乘者，　云何得诸果？
犹如诸字本，　离本则无字，
若离摩诃衍，　亦无一切乘。
钝根少智者，　不信于大乘，
以不能信故，　则无一切乘。
自利而兼他，　是名无上乘，
是故当亲近，　乃至成佛道。」`,"是义甚深、难可显现，不应处处而为人说。","问曰：虽不得一切处说，应为能解者说。若发大心增长智慧，应为是人具足分别如前所说。答曰：有四不思议，所谓佛不思议、禅定不思议、龙神不思议、业报不思议。佛不思议应显现法，唯有利根众生，从卢舍那佛以来所说诸法悉能堪受。","问曰：云何得从彼佛以为次第乃至今耶？答曰：如来法身为化众生有四方便。何等为四？一者多檀多罗波罗比地、二者多檀多罗尼比致、三者阿亶多波罗比致、四者阿亶多罗比致（此四深妙，秦言无以译之，故存梵本耳）。问曰：若如来法身常是寂灭无相无为，云何而得随顺有相？答曰：以本愿力故。如入灭尽定比丘，虽无心相，以先要心，若打揵搥声发至耳，随其声发即得出定。菩萨亦复如是，发菩提心本誓愿力：若使我得寂灭法身，尔时心识虽复无相，以无作力故教化众生。是故如来无相法身，便能普应随顺有相。如三千大千世界百亿兜率天、百亿炎摩天，皆悉俱时示现色身。现色身已，或复舍寿、或现入胎、或现初生、或作释梵四天王等接事左右、或现行七步、或现师子吼、或复自言天上人间最尊最上，是后边身断生老病死，或现童子、或现入宫、或现出家、或现苦行、或现坐道场、或现降魔、或现初成佛、或现觉悟众生、或现久成佛、或现释梵请转法轮、或现成熟不成熟众生、或现度脱已成熟者、或现当入涅槃、或现已入涅槃、或现阎浮提全身舍利分身舍利、或现兜率下来，乃至现度脱成熟众生，随应所见皆为现形，或复数数示现、或复暂时示现。如是说者，名真实义。终不三阿僧祇劫修行诸波罗蜜而成，四十五十年果便灭尽耶？云何当说，因如须弥只罗山等，果如芥子微尘分许。是故汝说即是颠倒。如我法中，乃可令使因如芥子，果如须弥只罗大山，此合斯义。是故三阿僧祇因，得尽一切生死果报，应化众生法身常存，如《法花．寿量》所明，亦如〈文殊师利授记品〉中说也。彼云何名为多但多罗尼比致？如佛所说：我作佛事已竟。语诸比丘：我涅槃时到。如是十方诸佛亦复如是，为化众生故作如是语，其实不灭。一切佛国神通变化，皆与虚空法界齐等。是故当知，法身是常，色身应化故无常。若以色身观佛者，不名见如来。如佛说偈：",`「若以色见佛，　音声求如来，
是人行邪道，　不名为见佛。」`,"以是义故，以法身观佛，名真见如来。如莲花比丘尼见佛色身，便作是念：我最先见佛。佛言：汝不先见我。唯须菩提识于法身，已先见我。是故当知，位阶十住名见法身。若礼法身，即礼一切色身。如佛于《法华经》中说，若人称名供养观世音法身者，胜供养六十二亿诸佛色身。何以故？以其位阶十地，得佛法身，亦名菩萨亦名为佛。以是故知，法身为本，无量色身皆依法身而现化出。是故佛便假说六十二亿恒河沙色身，不如供养一法身乎。如佛于《宝积经》中所说，如是迦叶！如世间人，月初出时恭敬礼拜，至其盛满而不恭敬。何以故？从初以至满故。如是迦叶！若善男子欲恭敬我者，先当敬礼菩萨。何以故？以佛从菩萨地得满足故，乃至经历生死变化色像利益众生。以是义故，彼已得佛果，是佛实说，非虚妄也。","问曰：若未入菩萨地者，受具戒比丘得为礼不？答曰：得礼，以初发心菩萨胜于一切声闻辟支佛故。如尊者罗睺所说偈：",`「若发深心，　必生菩提，　故为一切，
之所恭敬。」`,"问曰：云何受具足戒比丘而礼不具足戒未入正位菩萨耶？答曰：应礼菩萨。何以故？声闻戒要须受得尽寿便舍；菩萨发心成就自性第一义戒、解脱戒，是故声闻虽受具足戒，犹应礼彼未入正位菩萨。以菩萨体性不杀、远离刀杖，乃至虫蚁尽无杀心而有惭愧。如是广说，体性不盗，乃至体性不邪见。如波罗提木叉戒，命终时舍、罢道时舍；菩萨大士性戒成就，乃至道场终不中舍。以是义故，虽受具戒，应为作礼。","问曰：成就体性戒者乃可供养，不应礼拜。答曰：不然。以有戒功德故，亦应礼拜，岂但供养。汝言不受戒菩萨不应向礼，我今复当为汝广说，不但以白四羯磨故而受具足戒。如比尼毘婆沙中说，有十种受具足戒，菩萨有种种受戒。何等为十？如佛自言：「善来比丘！」自然已得受具足戒；如摩诃迦叶，自誓因缘受具足戒；如憍陈如，见谛故受具足戒；如波阇波提比丘尼，以八法受具足戒；如达摩提那比丘尼，遣使受具足戒；如须陀尼耶沙弥，论义受具足戒；如耶舍比丘等，善来受具足戒；如拔陀罗波楞伽，三归受具足戒；如边地，第五律师受具足戒；中国，白四羯磨受具足戒。是以菩萨常受具足戒，未曾舍离。","问曰：若被法服菩萨得礼白衣菩萨不？答曰：菩萨方便具足五通，随顺众生一切形相而同其服，亦随一切众生入于诸趣同其状类。大菩萨等随众生业报变化受身，如尊者拘摩罗陀所说偈言：",`「诸趣悉变化，　唯除净居天，
随业种种转，　无处不受生。」`,"以是故知，诸菩萨常同利益，随其受生而化导之，以方便力但为众生，不随烦恼业报所系。如尊者提婆所说偈：",`「或现作师长，　或复为弟子，
以种种方便，　为化诸凡愚，
自在于诸趣，　常为众恭敬；
若不恭敬者，　是大憍慢业。」`,"是以菩萨虽形服在俗，应得礼敬。犹如如来为化众生，作若干种形。亦如化弗迦沙王，作老比丘形、作瓦师形、作力士形、作琴瑟伎术师形，亦现种种在家人形。虽为种种无量形状，一切皆应恭敬礼拜。是故虽同俗服，应加礼敬。如佛所说偈：",`「严饰诸行而寂灭，　调伏决定修梵行，
于诸众生舍刀杖，　是名沙门婆罗门。」`,"是以于诸菩萨，不应取其形状相貌而生分别。菩萨但为三界众生作大舍宅，或化为佛、或化为天人，乃至化为种种畜生，一切皆应礼彼菩萨功德妙聚；不应作心礼其状貌，如彼世人致礼形像。远敬法身，岂在金石泥团土木而尊事乎？是故菩萨以诸方便作内外形利益众生，礼无咎耶。是以如来非是涅槃、非不涅槃，如罗睺罗所说偈：",`「生死苦长远，　应当入涅槃；
以大慈悲力，　久住而不舍。」`,"是故当知，随生死久远，法身常住、色身应现，犹如灯灭，是故菩萨法身胜于诸佛色身。诸佛色身于欲界而成正觉，菩萨法身住于净居。菩萨法身住于诸佛一切种智，诸佛色身为化众生，令诸释梵、四天王等皆悉恭敬。是以佛说，供养六十二亿恒河沙诸佛色身，不如供养菩萨一法身也。如《集一切福德三昧经》中所说，喜乐正法。终不说佛入于涅槃，如《法华经》中说偈：",`「常在灵鹫山，　及余诸住处；
凡愚无智者，　虽在而不见。」`,"如《入一切世界大庄严三昧经》中说，告善男子：汝见如来法身不？白言：世尊！唯然已见。于一毛孔见亿百那由他诸佛世界，身口业等遍满一切诸佛世界。又如来密藏中说持速疾菩萨观如来顶，上至无量诸佛世界犹不能见。如目连寻如来说法音声，乃至野马世界犹不能尽于佛音声。如《首楞严经》中所说，如来处于宫中，而现无量世界初生、转法轮、入涅槃。如《密藏经》中说，如来法身住于一切众生身中，光影外现，犹如净彩裹摩尼珠，无所障蔽亦复如是。是故当知，如来法身遍在一切诸众生中。如佛所说，乃至枯树焦木亦悉皆入不应生害，况复余类。是故不应称量众生，除诸如来无能知者。如维摩诘所说，一切佛土皆悉严净，此娑婆世界亦是。大心众生有如来藏故，释迦如来以善方便，令诸声闻大弟子等现五浊世。诸外道等虽计一异，如是人等一切身中亦有法身，悉从菩萨善方便生，皆为显发摩诃衍道。是故当知，菩萨于三千大千世界教化众生故，种种不同，若利根众生，为赞大乘而无讥嫌，令心易解；若钝根众生，入邪见林、著愚痴网，得见诸佛菩萨因缘故，灭诸邪见乃入大乘。是故摩诃衍于诸乘中最为根本。若有众生受持信解此大乘者，当知是人业报烦恼皆悉消除，如世尊为阿阇世王解诸疑悔经中所说，光相！勿作是言。何以故？汝于余佛世界十劫修诸禅定，不如于此娑婆世界能一食顷修行慈心。何以故？于余世界断除烦恼，亦复不如于此娑婆世界一食顷中修习善业。如与文殊师利授记中说，及余诸经皆具分别。若有众生诽谤正法，如《般若经》及《法花》中广说其谤法过逆罪；若能受持信解大乘，乃至五无间等皆悉消尽。如佛所说偈：",`「所作重恶业，　能深自悔责，
敬信大乘法，　拔除诸罪根。」`,"佛说如是真实法相，信心次第相续连注皆悉空寂，先所造恶即能消灭。如世尊解除疑悔经中说也。大王！观察汝心，以何心杀父？为过去心、未来心、现在心耶？若过去心，过去心已灭，若心已灭则无方所亦无住处。若未来心，未来心未至。若现在心，现在心不住。譬如幻化，非青黄赤白紫颇梨色，体性纯净，乃至非相非可见。如是广说，即得胜趣。是故当知，摩诃衍者是根本乘。如《弥勒庄严经》中说发菩提心事，解菩提心、住菩提心，得大利益、不堕恶趣。解菩提心、净菩提心，从地至地渐渐增益而得法身，能现神通如卢舍那佛所作变化。而说偈言：",`「若得无垢身，　色像则无量，
或出于阎浮，　或处于兜率。
从于定光佛，　乃尽生死际，
知时与非时，　当知定光化。
非是形色处，　亦复非无相，
悉由于本行，　亦如水中月。
身口意皆密，　悉是不共法，
一切诸世界，　色身现解脱。
持世诸天人，　欲观见佛顶，
无边不思议，　过于亿世界。
目连诸弟子，　至心求佛声，
亦过百千界，　寻声无边际。
法身功德业，　一切无能知，
不可以形类，　言辞巧宣说。」
见闻唯佛力，　非我之境界，
念报佛恩者，　顶戴信奉行。
今我所说法，　回施诸众生，
悉灭烦恼结，　得证无上道。`],source:"https://cbetaonline.dila.edu.tw/zh/T32n1634",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T32/T32n1634.xml",sourceLabel:"CBETA T32n1634",scope:"上下卷完整正文",originalTitle:"入大乘論",juan:[1,2]},{id:"great-man",title:"大丈夫论",subtitle:"大丈夫论 上下卷 · 提婆罗菩萨造 · 北凉 道泰译",paragraphs:["施胜品第一",`敬礼等正觉，　大悲哀世尊！
因彼起正法，　三界中真济。
众中第一尊，　无量功德藏，
菩萨本所行，　我当说少分。
我今哀愍彼，　开演妙施门，
一切诸贤士，　应当欢喜听。
菩萨行施时，　大地皆震动，
巨海涌众宝，　慧云雨妙花，
无心犹如是，　况有情识者？
菩萨施广大，　犹如虚空界，
假使五通仙，　充满十方刹，
听闻犹尚难，　况复分别说？
无有地方所，　而不以求施，
净水浸大地，　无有不遍处，
无有一切物，　菩萨所未施，
无有一众生，　不曾受施者。
论者语大地，　一切应礼汝，
何故礼大地，　菩萨行施处？
菩萨一日施，　种种众杂物，
辟支佛百劫，　不能知边际。
所以不能知，　大悲为施体，
能成种智果，　施因为最大。
此是智者说，　施能到彼岸，
若一到彼岸，　诸度悉具足。
波罗蜜义者，　名为和集声，
譬如多人处，　名之为大众。
菩提之种子，　能成大智果，
一切众事具，　莫不由施成。
施是生天道、　出世之胞胎，
无相施为妙，　平等为最胜。
身及物皆施，　无有所悋惜，
一切处皆施，　无有方所者，
一切时皆施，　无有不施时，
于此四施中，　心智常不动，
如是行施者，　名不思议施。
若施一众生，　一切尽蒙乐，
若不如是施，　是名为欺诳。
虽名施一人，　是为施一切，
所以名一切，　大悲心普故，
大悲所以普，　为求种智故。
施佛及罗汉，　世名良福田，
大悲平等施，　是为最胜施。
无量财宝施，　不如暂止息，
悲心施一人，　功德如大地。
为己施一切，　得报如芥子，
救一厄难人，　胜余一切施，
众星虽有光，　不如一月明。
众生垢心重，　所施恒为己，
菩萨悲心施，　如灰去众秽，
救济慈悲施，　普为群生类。
如是慈悲施，　功德无穷尽，
如此微妙施，　安乐诸众生。
贪求佛智慧，　心无有厌足，
如是悲心施，　能除无明障，
开导愚冥者，　使得智慧眼，
能灭诸结使，　消伏老病死。
施与悲心俱，　众生之甘露。`,"施胜味品第二",`大悲所起施，　意愿成菩提，
如是知见人，　能成一切施，
如是一切施，　终成一味智。
大悲心为体，　能起种种施，
种种救众生，　得到于智处，
能除诸爱结，　及以无明垢，
能令一切众，　悉皆得安乐；
如是悲心施，　谁不生爱乐？
大悲心所起，　功德之施利，
不能生爱乐，　背离于救济。
是人为爱系，　菩提甚难得，
诸欲求佛者，　爱乐施甘味。
智人喜惠施，　甘乐菩提味，
深见三有过，　涅槃味甚乐，
速疾欲远离，　一念顷不住。
又见于施乐，　复过于涅槃，
爱乐施自在，　心则忘菩提，
心既忘菩提，　谓菩提难得。
自观乐施心，　由悲众生故，
不觉施味乐，　施有三乐味：`,"一者求报施味；二者求解脱施味；三者求大悲心施味。此三种味者，名增长乐味施。","施主体品第三","受者得无量珍宝心大欢喜，施者行少施时心大欢喜，过于受者百千万倍。能如是施者是为第一行。",`成就救济者，　饮大悲甘露，
菩萨行此行，　永除悭病老。`,"菩萨悲心以施为体，世间众生以结使为体，纯以众苦以为一味，为得乐故行悲心施。日以照明为用，月以清凉为性，菩萨以悲为体，智慧及财施安乐于一切，如从歌罗逻乃至老时十时差别，虽至于老不舍婴孩之相。菩萨虚渴施心救济众生亦不舍凡夫，离欲至于非想，不离凡夫之相；菩萨不舍施心救济众生亦复如是。欲除施渴当饮大施之水，施渴暂息余渴不已，爱乐施故。一切众生依食而存，大悲亦尔，依施而存。菩萨法身不依饮食而得存济，大悲为食菩萨身存，悲心如火、欲施如饥，施与好食，菩萨乐与无有厌足。悲如大海施如沃焦，救济心为水如沃焦吞流。欲向菩提以众生为伴、悲心为体，施无厌足，如海吞众流无有止息。",`一切众生来，　各各索异物，
菩萨皆施与，　心无有疲惓。
诸苦恼众生，　尽皆为除灭，
设有未除者，　心无有厌足。`,"施主乞者增长品第四","有大悲者能处生死，种种施与灭众生苦。若能如此，善住生死。",`福德善丈夫，　悲心施惠手，
拔贫穷淤泥，　不能自出者。`,"悲心为体，能行大施灭众生苦，如盛热时兴大云雨、起大悲云雨于施雹，摧破贫穷如坏山石，拯贫穷者无限齐施，令彼穷者永离贫苦，以大施雨普益一切，众生贫穷永无住处。菩萨为救众生修行施时，魔及眷属皆生嫉妬愁忧苦恼。菩萨修行无量财施法施之时，悭贪嫉妬悉皆惊号莫不愁怖。",`慈心端严身，　悲心为千眼，
施为金刚杵，　菩萨如帝释，
悉皆能摧坏，　贫穷阿修罗。
菩萨悲心弓，　种种施为箭，
破贫穷怨贼，　永无有住处。
悲心坚固根，　爱语以为茎，
忍辱为枝条，　布施以为果。
求者为鸟鹿，　乞者如大风，
能吹施果落，　贫者得满足。
菩萨出时夜，　慈心如满月，
净施以为光，　求如拘牟头，
以净施光明，　令彼得开敷。`,"乞者既得满足欢喜悦豫转相施与亦如菩萨，施乞求者展转相闻亦如菩萨。菩萨布施流闻一切，诸贫穷者皆来归向，如旷野树行人热时皆往归趣，菩萨爱乐名得胜处。何以故？能使乞求者来，使我得施福故，以施福故名得胜处。一切众生皆来归集，如是大士悉应敬礼。菩萨心喜即觉身轻，以此相故当知必有来乞求者。若有人来语菩萨言：「有乞者来。」菩萨欢喜，即以财物而赏使者，菩萨即以余物而与乞者，见乞者来欢喜爱敬。求者言乞，作此语时怀怜愍心，若有乞者不知菩萨体性乐施，菩萨执手欢喜与语犹如亲友，坏彼不知使生知相。彼乞求者得财欢喜，傍人见之亦复欢喜：「愿此救济我者长存于世。」此乃乞者真济。菩萨见乞者时身心欢喜，面如满月，使彼乞者欢喜悦豫如甘露涂心，菩萨和颜悦色用慈心眼视于前人，如饮甘露。譬如有人盗窃他物至市卖之，若得速售心大欢喜；菩萨得施乞者物时，心大欢喜复过于是。如巨富人多饶财宝千子具足，随意恣与爱念欢喜，不及菩萨于乞者心大欢喜。菩萨见乞者时心大欢喜，胜于他人见所亲者。若见前人得多财宝随心恣意而自矝高，菩萨见之倍生欢喜。若见乞者发言时，菩萨施渴心重，耳闻乞言如饮甘露。若闻乞言心生爱重无能坏者，若闻具足则坏其爱心；菩萨于乞求者常生爱念，若闻其足声则坏其爱味。菩萨观前受施福田，颇有共我等者，遂见贪爱众生则与我等。所以者何？彼贪心无足，我施心无厌。彼贪心者爱大施主，菩萨见多乞者亦深生爱敬。贪求者常求施主欲乞，施者常求乞者所欲与之。菩萨常与世人相乞者，皆就施者而乞，菩萨就乞者而施。乞者闻施者财物匮尽生大苦恼，菩萨求乞者不得之时心生忧恼复过于彼百千万倍。于求乞者菩萨思惟：「佛言求不得苦，真复如是。」菩萨于乞求者生难遭想。所以者何？若无乞者，檀波罗蜜则不满足，无上菩提则不可得，是故于乞求者深生悲恼。若有乞者，无上菩提便为手执不难。菩萨闻乞者言与我与我，心生欢喜：「此今即便与我无上菩提。」世间愚痴众生若闻乞财，则生轻慢不生爱敬。菩萨念言：「所以名为乞者，多是愚痴众生，以悭心故与作恶名。」如是人者乃可名为施者。虽有财物复无施心，虽有财施心复无受者，若具足三事是大福德人。如有贫人得大宝藏心生恐惧，或王、贼、水、火来见侵夺，遇值亲友而语之言「我今为汝作诸方便令无丧失」，即大欢喜；菩萨得乞者以为善伴，心大欢喜亦复如是。菩萨悲心遍一切处，于彼乞者特生怜愍。菩萨悲心见乞者和颜悦色，使彼乞者生必得之想；乞者见菩萨颜色和悦之时，即生决定必得之想。菩萨见乞者时，语言：「汝来，欲须何等随意而取。」安慰之言：「善来贤者！莫生恐怖。我当为汝作依止处。」如是种种安慰乞者，常以爱语使彼乞者心得清凉，种种财宝随意而与。诸乞求者贪火炽盛，菩萨常以施乳灭贪求火。若能如是种种施者名为生人，若不如是名为死人。受施者大得财物，余人见之欢喜赞叹，菩萨尔时菩提之果如在掌中。悲心净则施净，若无悲心施不清净。菩萨作是思惟：「善调顺意者敬悲心胜能使施净。」菩萨见贫穷者悲心极重，众生极贫得菩萨施便成巨富，譬如有人得如意珠所欲皆得，诸贫穷者得值菩萨，一切贫苦悉皆除灭。菩萨先行财施，次舍所亲，又舍手足，复舍身命，如是渐渐次第而舍。菩萨往乞者所与其财宝，唤其乞者与其诸亲。若乞者自来现求索相与其手足，若发言求索便舍身命；若不来者自往施之。有来求者尚舍身命，况复财物而不施与？菩萨成就悲心，如自己体未曾舍离。见来求者，于己身所生于他想，菩萨身中生其恼热：「云何愚痴，乃于我身生于他想？」语乞者言：「一切财物先皆与汝，都是汝物。汝今但取，云何言乞？」诸求者言：「何时见与？」菩萨报言：「我先于三界尊前发弘誓愿，是时与汝。汝今云何方从我乞？」菩萨发心愿一切众生于我财物生己有想，如辛头河飞鸟走兽往至其所，随意而饮无遮护者。与以不与，先以舍离更不言与，亦复不生欢喜之心。何以故？先以与竟。以一切所舍使诸众生皆当得乐，菩萨于一切众生是走使者，一切众生皆是施主。诸贫穷者心充足时，菩萨尔时檀波罗蜜悉得满足，檀波罗蜜满足之时知功德满足。悭贪者见乞者时则背其面，修功德者见乞者时欢喜瞻视亲近，乞者则得。菩萨施时，见受施者展转相施便生欢喜，一切众生赞叹欢喜。菩萨闻其赞叹心大欢悦，胜得解脱之乐。菩萨悲心施时，见一切众生多得财宝充足快乐。诸众生等得快乐已，而发愿言：「我当久处生死修诸功德不求解脱。」菩萨既见众生能久处生死心大欢喜：「我今便为得现果报，设当不得菩提亦为具足。」","胜解脱品第五","菩萨思惟：「常所爱胜解脱者来觉悟我，彼来者不为财宝，为欲成就我大事故来。」菩萨或为人王，修诸功德者来而白王言：「有乞者来。」王即念言：「此言乞者乃是胜解脱来，我今得之。」王自念言：「我今不为贪著王位，为欲利益一切众生，不应空居王位，应修施果满足。而彼使者乃是觉悟我者。」凡为乞者甚难为颜，心怀惭耻言色变异，菩萨即知其意而安慰言：「若有所须随意而求。」乞者既得财物心大欢喜，施者受者二俱欢喜如涅槃乐。三有生死炽然大苦，菩萨处之如涅槃乐。何以故？为欲救济诸众生故。菩萨念言：「悲众生者即是我解脱。以大施惠救济众生，众生得乐即是我解脱。」虽复大施，若无悲心不名为施；若有悲心，施即是解脱。菩萨思念：「我于往昔三界尊前闻解脱极乐，我今已证。何以故？称意而施即是解脱。若阿罗汉解脱乐与悲心所起施乐相似者我则爱之；若不相似我则不爱。唯爱施乐以为解脱。」悲心起施所得快乐无有比类，无悲心施解脱之乐百千万分不得为喻；悲心起施所得喜乐若当可以喻为喻，最为极大，是故不可为喻。","施主增长品第六","悲心起施能与众生乐聚，如是施主与众生乐者，胜于解脱名为最胜。施主成他乐，因修悲者于一切众生得平等心，如是者名为檀越；不能如是施者名为乞者。若行施时使闻者悲泣，是名善施；若不如是不名善施主。若行布施能使受者子孙恣意受用、欢喜赞叹，名健施主。若乞而与不名施主，自往而与名善施主。若舍一切财物，爱心而与不名施主；有悲心虽不与物名大施主。诸来求欲皆使随意使称本望，名善施主；不能称彼本望虽复大富，名贫穷者。富者虽与无悲愍心，名曰与，不名施主；悲愍心施，是名施主。若不食噉无有果报，施虽与不名为施。无悲心施，虽与不名为施；有悲心者虽复不施，名之为施。若求报施者名为施者，商贾之人亦可名施。若求报施，果报犹尚无量，况有悲心不求报施，果报何可称计？若求报施唯可自乐，不能救济徒自疲劳；悲心施者能有救济，后得果时能大利益。贫穷者不如有财者，有财者不如能食者，能食者不如能施者。悲心施者善，一切众生，富者应施、施者应悲。富者能施富得坚牢，施者能悲施得坚牢。修施者得富，修定者得解脱，修悲心者得无上菩提，果中最胜。","恭敬乞者品第七","菩萨思惟：「因彼乞者得证菩提，我当以此菩提回与一切众生，以报恩故。我今因施众生得无比乐，因此乐故得成菩提，如此菩提我当施与乞者。我今因施乞者得于快乐胜解脱乐，因中施乐犹尚如是，况无上菩提？我当舍之施诸乞者。如是乞者其恩甚重无以可报，如此乞者乃能与我作大乐因，若以财宝不足报恩，当以所得无上菩提而施与之。以我福故，愿使乞者于将来世亦如我今成大施主。」菩萨内自思惟：「因于乞者得施快乐，使乞者得无上菩提为法施檀越。」诸乞求者见菩萨大施而问之言：「为求何等而等行大施？」菩萨各答言：「我今不求人天果报、声闻涅槃，愿得无上菩提拔济一切众生。」诸悭贪者而作念言：「菩萨云何能行大施心不疲厌？」菩萨答言：「我师三界尊，悲念一切众生。我今无以报师恩，故施无疲厌。一切之乐无胜解脱乐者，我爱众生胜爱解脱。我以爱念众生欲令得解脱，故修种种施。若生死不极苦者，我施终不求菩提，以生死苦故我施求菩提。」拔生死苦者谁之所作？烦恼以业之所造作。使一切众生以悲心为体，常乐惠施。","施悭品第八","不念恩人无有悲心，若无悲心不能行施，若不施者不能济渡众生生死。无悲心者无复亲友，有悲心者能有亲友。计我者以爱为体，救济者以悲为体。心有重爱无有知者，有重悲心者亦无能知。若不行施覆蔽悲心，如以画石乃知真伪，若见苦厄者能行大施，则知有悲心。悭心多者，正使所亲从乞则成怨憎；悲心多者，假使怨家亦如亲友。悭心多者，虽施泥土重于金玉；悲心多者，虽施金玉轻于草木。悭心多者，丧失财宝心大忧恼；悲心多者，虽有财宝无施处时，心怀悲苦复过于彼。舍财物者凡有二种：一者命终时舍；二者布施时舍。死时舍者，一切都舍，无有毫厘至后世；布施舍者，舍于少物得大果报。何有知者见此过患而不行施？若行施时令受者喜悦，自亦喜悦，若人不能深生喜悦便自欺诳。若有乞者有所求索，为求有故施与少物心则欢喜。复有施者自往施与，不求果报而行大施，余有少许心中快乐不可为喻。设有美食，若不施与而食噉者，不以为美；设令恶食，得行布施然后食者，心中欢喜以为极美。若行施竟有余自食，善丈夫者心生喜乐如得涅槃。无信心者谁信是语？设有美食，有饥者在前不能施与，是人食尚不能施与，况胜解脱能施与人？设令多有财物，有来乞者尚无施心，况施少物？不见是人于生死中有少乐处适可住于涅槃。若人于大水边不能以少水施与，生死之中苦恼无量，汝莫在中住，适可速入般涅槃。如有大水欲施人不以为难，如有悲心欲取涅槃亦不为难。世间粪土易得于水，悭贪之人闻乞粪土犹怀悋惜，况复财物？","财物施品第九","如有二人：一则大富，一则贫穷。有乞者来，如是二人俱怀苦恼，有财物者惧其求索；无财物者我当云何得少财物与之？如是二人忧苦虽同果报各异：悲恼念者生天人中受无量乐，悭贪者生饿鬼中受无量苦。若菩萨有悲愍心，于前众生便为具足，况复与少物？如人大富多有财宝，随意而用心生欢乐，菩萨悲心念施忧恼过于是人百千万倍。有悲心者无有财物，见人乞时不忍言无悲苦堕泪。见苦恼者不能堕泪，何得名为修行悲者？胜者设闻他苦尚不能堪忍，况复眼见他苦恼而不救济者，无有是处。有悲心者见贫苦众生无财可与，悲苦叹息无可为喻。救众生者见众生受苦悲泣堕泪，以堕泪故知其心软，菩萨体净悉皆显现。何以故知其显现？见苦众生时眼中堕泪，以是故知菩萨其体净、软。菩萨悲心犹如雪聚，雪聚见日则皆融消，菩萨悲心见苦众生，悲心雪聚故眼中流泪。菩萨有三时：一者见修功德人，以爱敬故为之堕泪；二者见苦恼众生无功德者，以悲愍故为之堕泪；三者修大施时，悲喜踊跃亦复堕泪。计菩萨堕泪已来多四大海水，世间众生舍于亲属悲泣堕泪，不及菩萨见贫苦众生无财施时悲泣堕泪。菩萨入救众生禅极乐心相应，无尽宝藏自然而出，一切乞者自然而至。善丈夫者能以财物大施乞者，乞者得财物已亦行大施。菩萨能以财物施于众生使其富足，以等悲心闻乞者声为之雨泪。乞者见菩萨雨泪，虽不言与当知必得。菩萨见乞者来时极生悲苦，乞者得财物时心生欢喜得灭悲苦。菩萨闻乞言时悲泣堕泪不能自止，乞者言足尔时方止。菩萨修行种种施已，众生满足，便入山林修行禅定。云何灭除诸众生三毒苦患？菩萨财物倍多无乞者可施，我今何为守之而住？今当舍之出家。","舍一切品第十","菩萨大有财物无有乞者，唤之不来，菩萨思惟：「故当断诸结使，无有来者。」菩萨悲心，一切众生众苦围绕，发愿度诸众生。菩萨诸有所索，一切皆舍无物不与，欲求佛智最上救济一切众生。尊有胜悲心欲行救济，何物不舍？有悲心者，为他故涅槃尚舍，况复舍身？舍身命财有何难也！舍财物者不如舍身，舍身者不如舍于涅槃，涅槃尚舍有何不舍？悲心彻髓得自在悲，作救济者大菩萨施都无难也。是一切众生最亲，与他作向乐因。悲者一切都舍，离诸疲劳，一切众生真济、怨亲平等，身命尚与何物不舍？一切众生极重财利，乐爱命重于财物。一切众生舍财为易、舍命为难；菩萨舍一切财物欢喜，不如舍身命时得胜欢喜。种种施味悉知，以施为食，因之得存。与他乐者，欲知施身气味故施身。见他乞支体者，心中欢喜胜于舍财欢喜。如乐施者得欢喜乐，不如菩萨舍身时得胜欢喜。阎浮提人乞财物者，无我福德故得乞身者来。舍财者，财物由他，或不称意；舍身者，我得自在，随意舍与不由于他。此身不牢不定速朽之物，可爱念者可速疾取。诸食肉者语菩萨言：「汝今以热肉血施我，我当何以报恩？」菩萨报言：「若欲报恩者更语余人：『有悲心者能施身肉，可往取之。』若能如是便是报恩。」语乞者言：「汝今为我取不坚身，使我得坚牢身。汝恩极重，何以可报？未来世中舍身之果即用施汝。我为救济一切众生故舍于身命，舍身者得于法身，得法身者得一切种智，使一切众生皆得此果。舍此身者得于法身，法身者能与一切众生利乐。」能如此思惟，云何不生喜乐速舍此身？菩萨舍身时作是思惟：「我为众生作亲友者，我以度生死，应度一切众生脱于生死，以是故我今舍身。」菩萨作是思惟：「我此舍身功德，不属悲众生数，还以养我功德法身。」若心如是决定之时，舍身无有难相。菩萨舍身所以不难，以当成法身故，是故欢喜。贪爱重者，多得财时欢喜无量，不及菩萨舍身欢喜百千万倍。菩萨以智慧悲心为体，为众生故求于法身。菩萨舍身时乐，胜于世人得转轮圣王自在快乐。如刹利种若坏敌阵，能舍身命得生天上，舍身命时欢喜无量；菩萨以智慧悲心舍于身命时欢喜最胜，复过于彼。凡愚众生为财利故，在于敌阵舍于身命，或为解脱投岩赴火丧身无数，况复菩萨以智慧悲心为一切而不舍身命？愚痴众生以爱著心为国土故舍于身命，菩萨智慧悲心为物而舍身命何足为难？菩萨发誓愿时一切皆舍，虽有是语，一切众生实未得利；修行布施，尔时一切众生得利益受用。菩萨舍身不足为难，知身无常、苦、空、不净，为众生故而不舍离是则为难。菩萨悲心为众生舍身不足为难，乐舍无有厌足此则为难。假设使一凡夫令返大地，力不能就甚生忧恼；菩萨见苦众生未度脱时，心怀悲恼复过于是。以悲心故，菩萨观身轻于草土，为众生舍身何足为难？若人为己身故，一念中受不杀戒，是人命终必生天上；菩萨为众生舍于身命，所有功德生死之中无有受处，唯至菩提乃能容受。菩萨若闻有人来乞身时，即时生念：「我已久舍此身而不自取，方从我索，必当谓我有悭惜心而试我耳。」","舍阴受阴品第十一","阿罗汉舍后边身得涅槃乐，不及菩萨为众生舍身时乐。阿罗汉得解脱，不如菩萨为众生故受身时乐。菩萨生念：「我以不取涅槃为众生故得受是身，是最为妙。」菩萨念言：「我舍身命用施，复更受身不入解脱，是为最胜。我乐闻如来济度众生功德，我得救众生悲心气味不取涅槃，甚爱乐此事。」菩萨为众生舍身施时，虽不证涅槃，胜得涅槃者，以不得为众生舍身气味故。菩萨受是阴身极是大苦，如为众生舍身时乐等无有异。世间凡人为贫穷病苦之所缠逼不能舍离，乐欲舍身；众生厌患阴身不能救济者，欲速入涅槃。菩萨思惟：「涅槃甚乐，生死阴身极为大苦。我当代一切众生受此阴身之苦使得解脱。」阿罗汉身尽佛亦身尽，身尽虽同不能救济，佛灭身为善。","舍身命品第十二","菩萨为一切种智故、大悲心为众生故，舍身舍命，得果报不空。若一切舍身不得果报，名空舍身。菩萨舍身，为著财众生欲使生羞耻故。菩萨为众生舍身命者，易于悭贪者舍一团饭。菩萨舍于身命，为悭贪者生其羞耻。菩萨所以施命，为护他命故。何以故？他命即是我命。菩萨虽舍身命不济他者，为观阴身过故，为益众生复更受身。若非大悲，何有智者而乐阴身？若无大悲施味者，不能乐处生死。菩萨常乐行施，大悲自在，随受生死身如涅槃乐。","现悲品第十三","菩萨悲心极大，在于身中无有知者。菩萨舍身命时，一切天人所以得知，菩萨悲心极以深大遍一切众生，无有见者，以财施、法施、无畏施悉得知见。一切众生身者无不是病，无有知者，以三事故知其有病。何者为三？饮食、衣服、汤药即是病相。菩萨悲心以三事得显。何者为三？即是财、法、无畏施也。菩萨与一切众生作乐，为灭一切众生苦故，舍身救之。菩萨不求果报，视如刍草。菩萨大悲作种种方便，犹如乳聚以血施人，易于世人以水用施。如菩萨昔日五处出血施诸夜叉鬼，踊跃欢喜无可为喻，为欲救济一切诸众生故。有余人问菩萨言：「大悲者有何气味，能使舍血易于舍水？」大悲心菩萨答言：「以不求果报、为他得乐，故舍身命。何以故乐？无相为首，入悲心乐。」有人见菩萨大悲，疑之为是悲体，以大施故知是悲体。世人生疑：为当悲来入菩萨身中？菩萨往入悲中？菩萨舍身者，一切所不能共，唯大悲者能。得一切种智时，一切众生所不能共。有大悲心为益众生，所欲皆得无有难者，决定得空。心欲利益众生，大悲常在心者，无上菩提便如在手中无异。得住无生忍者，能显现陀罗尼得住十地，自在当知如佛。","法施品第十四","财施者，人道中有百千万财施果报。能得法施，唯大悲者能得法施财施果报，后身得无量乐。悲者法施现证涅槃，乐施欢喜甘露满足。菩萨悲一味，以是因缘无一刹那欲趣解脱。种种法施竟，请诸听法者：「我得法施果时必受我请。」菩萨时施名为欲施，非根本施；成佛时施名根本法施。",`佛智处虚空，　大悲为密云，
法施如甘雨，　充满阴界池。
四摄为方便，　安乐解脱因，
修治八正道，　能得涅槃果。`,"财施除众生身苦，法施除众生心苦。无量劫财施为得法施果，法施能与众生无畏施，极厌患生死。智者求涅槃，悲救众生者求于法施。菩萨受钱财为修施故，修行施时为得法施。见众生有二种：贪爱、愚痴。贪爱多者施财宝，愚痴多者施与其法。施财者为其作无尽钱财，施法者为得无尽智故；财施者为得身乐，法施者为得心乐。随所化众生，所欲得义称意，满足称之无疲惓意。得大功德法施欢喜增益，端正如秋满月，常为众生心眼不离。财施者为众生所爱，法施者常为世间之所敬重；财施者愚人所爱，法施者为智者所爱；财施坏财贫穷，法施坏功德贫穷者。此二种施，谁不敬重？财施者能与现乐，法施者能与天道、涅槃之乐。乐爱悲者能爱一切众生，爱一切众生即是爱己。阿罗汉舍于众生入涅槃去，尚不为智者所爱，况苦众生者谁当爱乐？常行惠施、远离十恶、恭敬父母，若如是者是报我恩。若欲续佛种者，当以悲心为首饶益于他，常能思念成就众生事。","发菩提心品第十五","施事已足为一切众生亲者，未曾一念不与悲心相应。菩萨悲心遍缘一切无不缘者，以悲心遍故，后成佛时得一切种智无有障碍。以悲心故，舍声闻解脱发菩提心。此初一念之心，唯佛知其边量，况菩提行解脱乐？方初一念发菩提心，犹如大地金，大地土不相方喻。初发心时以能净诸结，使招一切功德。菩提是发心果，为一切众生求乐。菩萨发菩提心竟，未发愿者问：「解脱云何？」以何因缘故问？以发心者如从解脱中来，是故问言：「云何为解脱相？为往到解脱故知？为解脱来耶？」已发愿者答言：「发菩提心时欢喜快乐犹如解脱，是故得知。」欲供养一切佛者，当发菩提之心；欲报佛恩者，当发坚牢菩提之心。除发菩提心，更无有法能至菩提。若无菩提心则不得佛果，若不得佛果则不能救度众生。欲与一切众生无量大乐，当发菩提之心。何以故？菩提心者是一切众生乐因。一切诸色不离四大，一切乐事不离菩提心。怪哉！云何迺不畏生死之苦，乃畏无畏菩提之心？若欲止息一切众生苦者，无过发菩提之心。发菩提心者是初止息因，初止息得无上止息。得财宝利不如得功德利，得功德利不如得智慧利，得智慧利不如得菩提心利。若放逸废忘不念菩提心者，如禽兽无异。汝今云何不发悲心？当知悲心者即是大菩提。欲趣向佛智，应发菩提之心。为结使所障者不能发解脱之心，为业报障者不能发菩提之心。云何邪趣？云何正趣？为有爱所牵，以四空为解脱者，名为邪趣；发菩提心，修八正道，名为正趣。为得富报者修行于施，为得乐报者修行悲心，为欲救济安乐众生者当坚发菩提之心。不修福者有三事难得：一者不得亲近善友；二者不能悲心厌离；三者不能敬尚佛慧。未发菩提心者应当发心，若发菩提心者得一切种智。","功德胜品第十六","有人等以财物施一福田，心不同故得报有种种——有得三有乐者、有得寂灭乐者、有得利他乐者——思愿胜故得报不同。以爱心作福者，受报时愚暗；悲心修福者，受果时得于智慧；不败坏菩提心为饶益众生作福者，当知此福为福中最胜；其余修福，名相似福非第一福。修一味智慧，当知此福为最第一，饶益世间故三宝种不断，知业知果知归依佛慈悲。计我行福如行恶者甚可惭愧，善丈夫者见人天世间无救，终不为己修福。生死中苦尚不可闻，况复眼见？众生受身极可患厌，云何为我修福作业？悲者所不能作。一刹那顷不离悲心为众生亲友，云何为我作福？有尝功德味者，得自在修福、得他报恩胜气味，梦中尚不为己修福，况复觉时？以智能见过，终不求有造福，悲心者终不为解脱修福。智者弃求有业，悲者弃解脱业。所以者何？悲者为利益他故，无胜智慧平等造作。因福一果福无与等者，从十力得智。为己得乐舍利他乐，名背恩者。唯我能知，从佛得知，故一切众生是我修福之伴。设当得果而独受用，名背恩者。极难得乐，岂得独受？其如是丈夫为一切所弃。设得千涅槃乐不为饶益，不如救一众生苦，胜得千涅槃乐。解脱乐尚不独受。何以故？见世间众生无归无救故。尚不独受解脱乐，况复无上菩提？","胜解脱品第十七","更有余三昧定慧境界众生皆悉作佛，以有此三昧故不欲取于解脱。头陀除一切过恶，寂灭如在口中；真济者为众生苦故而不证取。",`定慧悲自生，　见世间众苦，
世间真济者，　终不越度去。`,"如海潮终不过限，修悲者百劫苦行，若能度于一人，终不出生死。力能得解脱，为众生故处于生死。于三种施一切时常如节会，不乐己乐为他作乐，日夜于生死中而不处，欢喜快乐如处涅槃。菩萨常为众生作利益业欢喜乐味智，菩萨乃于梦中得欢喜乐胜于解脱，菩萨得为他作乐欢喜气味。诸有众生不得气味证于解脱，智人若得解脱知利他乐欢喜气味者，必当还来利益众生。畏于生死、为自利益求于解脱以为极乐者，不如菩萨受阴身时欢喜快乐，为利他故。若自一已受逼迫苦者乃可入于涅槃，一切众生受逼迫苦，云何舍于众生入于涅槃？见自己苦者入于涅槃，悲者见一切众生苦皆住己心，云何舍于众生入于涅槃？若能为他作乐欢喜即是涅槃，若不如是即是生死。于众生有平等悲者，为他作乐欢喜即是涅槃，佛所赞说。若解脱如利益一人欢喜乐者为智者所爱，若与他重乐不计功者即是解脱。悲者为他作乐不望果报，若能如是即是解脱，若不如是即是生死。若为己求乐者即是苦也，舍于己乐为他求乐即是涅槃。世间众生以破苦故名为解脱，修悲者能破他苦即是胜解脱也。破他苦者二俱得乐，何有智者舍二解脱取一解脱？世间人言：「有智者得于解脱。」菩萨作是思惟：「我不信是语。何有智人舍救他乐，取于解脱自己得乐？能与他作乐、三有中乐胜解脱乐。」菩萨为众生受苦，胜于他人为己得解脱乐。","饶益他品第十八","世间众生为己乐故，于生死中身心疲劳；菩萨心得休息，悲心作饶益他生死中除对治法，更无有乐，菩萨除利益他更无有乐。菩萨得作利他欢喜乐，知利他者即是自利，舍自己利爱利他乐，知利己乐即是利他乐，知利他乐即是利己乐，知利他乐时即自己乐故。人有上中下：愚人者见他得乐心生苦恼；中人者己自苦时知他苦；上人者见他乐时心生快乐、见他苦时如自己苦。菩萨四摄法中与他同利。云何同利？他苦则苦、他乐则乐，是名同利。悲心平等无有他想，菩萨与众生同苦同乐，菩萨自己身特生苦恼。何以故？不能救众生苦故。不观过去、不观未来，随众生意作灭苦对治，菩萨自意亦如他意。世间众生与他利乐还望返报，菩萨与他利乐不望其报。菩萨虽悲心平等爱一切众生，然于怨憎中倍与利乐，于怨憎边与利乐时心中欢喜。如舍身命时欢喜者名为平等，若不如是名不平等。于怨憎中倍与利乐者，名称悲心所作。菩萨于一切众生等生悲心，然于恶行众生倍生怜愍。譬如大富长者唯有一子，爱念之心彻于骨髓；菩萨爱念一切众生亦复如是。如有恶子不欲父得胜己事者是名背恩，一切怨憎众生于菩萨所同一味恶，菩萨于怨憎人生同一味悲心。世间众生得报恩者生其欢喜，若菩萨于怨憎人所与其利乐心生欢喜倍过于是。世间众生若骂时，他不还报便大欢喜；菩萨得他骂时心大欢喜。有爱心者于三界中悉皆普遍，菩萨悲心亦普遍三界。菩萨悲地狱众生，不如悲爱著三界愚痴众生。众生乐于己乐为无量大苦之所系缚，菩萨为利他乐故为无量大苦之所系缚。一切众生皆同一事，皆欲离苦得乐，与他利乐为胜有为。利向己者亦是悲因亦是喜因，为利向他者见之生于悲喜，自为己利所以生悲，见其得乐所以欢喜。四无量心者内心欲修缘，四摄法者为众生利乐名为最胜。修四无量者能与世法及出世法，因世法出世法及四无量心都是同一境界。何以故？同一利益众生、同得一无上菩提果故。悲者能利他，智者能舍，不生希有心、不生高下心。","胜施他苦品第十九","菩萨见他苦时即是菩萨极苦，见他乐时即是菩萨大乐，以是故菩萨恒为利他。凡愚众生见他苦时自己为乐，见他苦不以为苦；贤人者自苦以乐乐他，不以己苦。凡愚众生为己少乐而大苦他；贤人者为与他少乐，自受大苦。恶行者修少乐因，得大乐时虽生欢喜，不及菩萨以少乐利他人时心大欢喜，倍过于是。菩萨见他受苦以身代之，身虽受苦不以为苦，心中快乐生大欢喜。菩萨悲心得自在乐，不为三有诸苦之所逼恼。菩萨饮悲甘露故不为诸苦所苦，不为苦所苦故能为他受苦。凡愚众生见他苦时心中生乐，见他乐时心中生苦；菩萨见他苦时则苦、乐时则乐。无悲心者见他苦时如月极冷，有悲心者见他受苦如夏盛日。不问愚智见他苦时，皆生厌离生忧恼因；有悲心者深生怜愍作决定心，一切众生苦即是我苦。菩萨作念：「若不能发大精进者，何由能坏此大苦？」菩萨与一切众生同利苦乐皆同，须勤劳得成菩提。菩萨作念：「我得菩提已舍与一切众生，还于生死之中。」从初发心还至菩提，复舍与众生，然不可得。菩萨为利他故，行四摄法终不疲厌，犹如大地持一切物终不疲厌。为己身者自受其乐尚生疲厌，菩萨为他作乐不生疲厌。菩萨为他作乐，见阿鼻苦如涅槃乐，于余苦边有何疲厌？若为一众生受乐、自受无量地狱，常作勇猛与他作乐不生疲厌。以何因缘为他作乐不生疲厌？菩萨观一切众生，不见他想都如自己。众生为结使所著，于一切处皆欲害他；为悲所持者，于一切苦无不欲受。菩萨为他受逼迫苦，如苦者乐解脱乐。菩萨乐代他受逼迫苦时即大悲心净，智慧观他受苦，悲心即在中住，悲心住处则苦不得住。虽复悲者为一切众生苦之所缠，如是为他利乐心生欢喜，胜解脱乐。菩萨见他受苦如自己苦，自己得乐欲与他人，自觉胜于涅槃。悲者常欲自受其苦、与他乐，悲之与苦不得一刹那顷而得共住。行恶者见他苦时欲得远避，见他得乐心不憙悦；菩萨见他苦时不欲远离，无爱者无一切苦业。何以故？除他人苦生大欢喜故。菩萨与他大乐不必欢喜，见他与人少乐心大欢喜。何以故？体性尔故。菩萨见他得乐自己亦乐，菩萨见人与他少乐，云何不生欢喜？","爱悲品第二十","若人不知身心常为极苦所缚，则不能知他心中苦。无悲者无恶不作，若见他衰祸心不调软，此人名为极恶行者，若有重恩者何时能念？临死之人虽有美药以为极苦，为极行恶；无福德者得慈悲甘药作极苦想。若人巨富多饶财宝，但自食噉不与他人，为人所呵；虽有智慧多闻，若无悲心亦为人之所讥呵。若见苦恼众生难得悲心者非功德器，犹如破器不任盛水；有悲心者见苦众生，虽不能救济，可不能叹言苦哉众生，见众生为贪欲瞋恚愚痴所病生老病死之苦，常为众苦之所恼逼。怪哉众生堕是大苦！世间众生身苦心苦，常为结业之所破坏。呜呼怪哉！世间众生逼迫之苦，何有菩萨而不生悲？身住于驶流，没生死无穷可畏大苦海。众生常为苦苦所苦、行苦所苦、坏苦所苦，若见一苦足生悲因，况复具足三苦？愚痴众生常为百千诸苦所苦，若见一苦应生悲心，况复百千诸苦？应当了知世间诸苦，于一一苦中未生悲心者应当生悲，已生悲心应当增长，况复无量？若闻世间种种无量诸苦，石尚应软，况有心者而不生悲？若闻世间悲呼之声，枯树犹应生华，况有心者而不生悲？世间苦一味，心柔软者易生悲心，有悲心者菩提之果便在掌中。","觉悟儜丈夫品第二十一",`悲心极丰富，　利他已生乐，
贫穷悲心人，　不能贪此乐。
婴愚爱自在，　悲心则背去，
悲心已背去，　众苦皆来集。`,"爱自在者，处生死中欲分苦与他共回流生死；悲心者，于世间众生分寂灭乐共之而去。有爱心者乐于三有，知爱过者则乐涅槃，作利益他者则乐悲心。爱自在者常乐世间，受身为己乐故；悲自在者常乐受身，为乐他故。爱自在者常乐己乐以为自缚，悲心者恒为欲与他乐而为自缚，爱自在者常为己乐无有疲厌，悲心者为与他乐而无疲厌。愚爱小者不爱自己亦不爱他，菩萨亦爱自己。愚痴众生常为我者，实是为他。","大丈夫品第二十二","菩萨悲心唯有一事之所逼迫，常为他事苦来逼迫，更无余事，是名成就悲聚。弃于涅槃如弃其苦，受于有身如取解脱，与世间利乐者名此为悲。知涅槃功德生死过患然不舍有为，如是一切尽是大悲功德。一切处离欲，以涅槃为体而不取涅槃，名勇健者。大悲因缘故，能入生死周旋往返，观诸有尽灭，知众生是苦，为救为依，心持大悲，厌恶己身求十力身，大悲之处得处悲处功德。如转轮圣王虽有千子，然爱相好具者；佛亦如是，于一切众生爱有悲心者。唯能作福无智无悲名为丈夫，有福有智名善丈夫，若修福修悲修智名大丈夫。应看悲者，有悲者应共语说，敬礼悲者具一切功德。","说悲品第二十三","世间人天阿修罗等，受身有种种苦。唯有菩萨彻髓悲者，知一切善法以悲为首。智人当知，如似一切诸字悉昙为首，一切善法皆入悲中。如似一舍众色皆入，若见虚空净即见大悲净，见虚空无边大悲亦无边。佛说：「若欲现前见我，当恭敬大悲；若欲见我，当观三界皆悉受苦。」苦无边故大悲亦无边，苦住故大悲亦住。大悲住在何处？住在一切众生贪欲、瞋恚、愚痴、生老病死种种苦聚，与诸眷属在中而住。有大悲心能知他苦，此名与佛共住。有三种施一切功德养身，犹如乳母，是名大悲。","施悲净品第二十四","犹如雪山生一切药，大悲雪山生三种施。一切功德除悲，更无有法能与世间作乐；施作悲体，能为世间作种种乐。无上果报为三施所成，悲是三施之因。众生祖母能生如来，一切众生无上最胜归依谁不恭敬？能生三施是名大悲。菩萨大悲功德极多在心中住，唯有一事而不远离无有染著，常作利益他事无有疲厌。世间出世间乐及利他乐，皆从悲生，是以我今恭敬于悲、能利益世间大悲者。我亦恭敬种种功德，实如所说有二功德最胜：能利益他及自净悲。悲能净于施，是以我今爱敬；施能庄严于悲，我亦爱敬；悲诸有同悲音者，亦复爱敬。悲能净心体、施能净业道，能净心体、能净业道，即能净涅槃道、能净无上菩提道。悲能净舍，无悲者垢污于舍。施能净悲、悲能净施，是名世间端正。悲能生信敬，犹如大地为众华庄严；大悲亦复如是。世间众生为烦恼日之所烧逼，得悲心者皆生凉乐，犹如夏热之时得清凉风皆得止息。","爱悲胜品第二十五","施缘取、取缘爱，有爱则有取、无爱则无取；有悲必有舍、无悲亦无舍。爱故取增长，舍故悲增长。爱恩者生爱，是过患怨则增长悲心。爱增长为自己乐则害他，悲增长能与他乐自己则苦；爱增长而害他者则非希有，悲心者舍己身命而与他人是为希有。爱著者名愚贱人，常在贫穷受诸苦恼；有悲功德者常处富贵。贪爱者可得断绝，有止足时得智慧则能断绝止足；得悲心者无有止足，常施他故。爱心者能招集一切诸苦成大苦聚，悲心者能生一切功德。若悲不舍不净业者，我所不欲；设悲不能救济，我亦不欲；若悲不乐求菩提，亦非我所欲。爱心者能生一切苦，悲心者能生一切乐。从悲起身口业者名为胜业，悲心者能为一切众生作无尽乐。","智悲解脱品第二十六","智、悲二事何者为胜？智者唯能自归依，悲者能使他人归依无上之道。有悲无智非智者所爱，有智无悲亦非智者所爱，能障无上道。智不与悲心相应，能障无上道智，菩萨以为无智。一念不乐生死，悲不欲解脱。解脱味如甘露，悲者以为无味，如美食无盐以为无味，解脱虽甘，若无悲心菩萨以为无味。若大悲与解脱别解脱皆应敬礼，以大悲是诸佛母故。解脱者名永无余，灭一切事；悲心如善呪，能呪死者还活。若受有相续不断身者是常过，若取解脱是断过，离二边故名之为佛救一切众生。若无佛者则无解脱，若无悲者亦无得佛。悲能生解脱，以是事故菩萨取悲。悲体一事能作二事：一能救众生；二能生佛种智。","发愿品第二十七","菩萨思惟：「一切众生共有无量种苦。我当发于悲心成一切种智，灭一切众生无量种共有之苦。」菩萨见一切众生沉没无量无边生死苦海，得平等悲心。婴愚无知，乐解脱者生放舍心。「世间大苦聚，生我胜悲心。」菩萨思惟，「我有悲心观苦众生未得菩提道，我云何使众生得解脱道？」菩萨思惟：「一切世间我最少福，我今不能救济众生。」菩萨思惟：「我于三界众生作大亲友，而众生常为身苦心苦逼恼，我今名为空恶活者。」菩萨思惟：「我生不能破世间苦、不能利益众生，我用受是身为？」菩萨思惟：「我是一切众生亲友，我当养育于怨家作大利益。」菩萨思惟：「一切众生能为我作端严业，不使一众生作不端严意。」菩萨作是思惟：「言利他者，求他人之相都不可得，都如自己。何者？为他即是利己。」菩萨思惟：「若有可愿处，使一切众生身心之苦，一时俱集我身常为受之，使众生得乐不以为苦。」菩萨思惟：「我菩提道中住一切所有诸苦，我皆能堪忍。所以者何？众生没溺生死苦海我不能度脱。」菩萨思惟：「虽有重结使，然菩提道难得。如是但有悲智二事为伴，心终不疲厌。」菩萨思惟：「善逝所行道，我今从中去；我今于世间，悲心施众生。当思惟，我如彼无异。」菩萨思惟：「我今为世间依救，当发弘誓愿，修大庄严智慧为善伴，我今佛慧牙将生。」菩萨思惟：「我欲灭众生苦，使一切众生得乐，欲作一切众生事，我常为悲心之所教诏。」菩萨思惟：「生死之苦闻尚疲厌，悲者能得堪忍世间苦故，为悲心尚向生死门。」菩萨思惟：「生死苦极可厌恶，欲入涅槃。」大悲语言：「苦恼众生未度，云何舍弃而去？」菩萨思惟：「有为苦具足，涅槃出世乐。我今知生死有为苦、涅槃无为乐，悲心常乐三种施。」菩萨思惟：「我甚畏诸有，以悲心救众生故乐处诸有。」悲心语菩萨言：「我使汝处生死，终不放汝。何以故？为报恩故。」菩萨思惟：「解脱乐，为度众生尚不欲食，悲心遮我使不得食，况生死不坚牢乐？」菩萨思惟：「一切乐中第一，佛说涅槃。是涅槃虽乐，我智不欲去。所以智不欲去者，悲和合故。」菩萨思惟：「我今敬尚涅槃。所以者何？涅槃中无生老病死故。涅槃虽乐，悲心所牵，为众生故而不得去。悲心是诸佛之母，是以不舍向于涅槃。若涅槃就我犹尚不证，况弃众生而向涅槃？」菩萨思惟：「我欲向涅槃，悲是佛母，就我与乳。云何舍去无上菩提？设当不与众生利乐，我亦不求，况复涅槃？」菩萨思惟：「不应向涅槃，舍无归依众生故。悲心故，使我不证涅槃。涅槃是尽生边，若无生者何能救拔众生？」菩萨思惟：「受生者有二种乐：一者救众生乐、二者解脱乐。我云何舍二种乐取一种乐？」菩萨思惟：「一切凡夫尽共有一切种智性，一切种智凡夫易得。以是故，我爱凡夫不爱解脱。」菩萨思惟：「随有苦众生处，悲心得生、悲得增长。以是故，我爱有中。」菩萨语悲心言：「汝使我得清净增长，使一切众生尽得清净、尽得增长。」菩萨语悲心言：「众生在苦，为百千众苦之所逼迫。今日使众生必得安乐，与我成办此事。」菩萨语悲心言：「众生为爱所缚，为死所摄。见世间无归无依，为救众生故受种种苦。」菩萨思惟：「我爱大丈夫，见有众生堕在苦中，舍涅槃乐，为安乐众生自勉励此事。」菩萨思惟：「向救众生得无生忍、决定智得授记别，得授记别者我今供养恭敬。」菩萨思惟：「佛得遍净眼，使我现前合掌请佛，愿授我记。」","等同发愿品第二十八","十方诸佛现在前者为救众生事，我今作发菩提愿：「一切众生所作事，我已堪任为作。诸佛大悲皆称我等善哉。我所有若智若福，使我一切无归依为作解脱。世尊使我常莫乐小智之心，世尊使我如世尊具足十力。若众生结使炽火烧心，使我以法水灭众生结使炽火、摧破魔怨，得贤智、得转法轮，坏一切众生衰恼。随有一切众生，我皆一时为转法轮，一切所作福皆用为是。以此福德使我得最胜法身，犹如虚空遍一切处，得二种身教化世间；以我此福与诸佛和合，无救众生使得解脱。种种烦恼异相作苦、能为苦因，我所有福以智慧力灭众生苦，使我以此福一切众生满虚空界为作一味乐，使我常满所愿。阴盖贼众能劫功德，世间畏死，使我以此福救藏一切众生。随世间几时而住，我善法亦住，以我善故，一切世间出世间悉皆离苦得乐，常一时和合一切众生。」菩萨思惟：「自今已去，常从乞者请受教令；从今以往，常于我身所深生体信，莫生他想，种种所欲，随其给使满足。」菩萨思惟：「使我从今乃至菩提，无有一身不见佛时。」菩萨思惟：「使我从今生死长远设我不见佛时，莫一刹那顷离于悲心。」菩萨思惟：「使我迫至成佛，见外众生所受诸苦极逼恼我身，我皆代受，使我身得彻髓悲心，使我身身得使佛智解脱。」菩萨思惟：「使我悲心犹如虚空。一切山河树木、飞鸟走兽皆依空住，一切众生一切时皆入我悲中。我依一切众生得立善根，以我此善回与一切众生得解脱果。一切道路、桥、船、方所皆是众生共有，使我一切诸善亦一切众生共有。」菩萨思惟：「地水火风一切众生共有，使我所修诸善亦一切众生共有。我因一切众生所得善根，回与一切众生得无碍智。」菩萨思惟：「我所作诸善，使一切众生得离魔界入于佛界，使我得智恒十波罗蜜佛智现前，使一切众生得安隐乐、得不动心。一切众生所有衰恼，使互相救济。」菩萨语福德言：「一切众生为无明所障，不知自苦他苦，汝当开解。菩萨布施行净水时，使一切众生除有爱结渴得无上道悲。我施水时，愿使一切众生免恩爱僮仆，恒得自在、得法财富。使我福如河、慈心无垢花、持戒以为底、施如驶流水，除众生渴苦。使我悲心恒如大河。」菩萨思惟：「我悲心如海、净戒如海潮、忍辱如波浪、智如海虫动、慈心如一味水。凡我所施者，使成慈心海，使施福得悲甘露，除众生生老病死。」","胜发愿品第二十九","「若我于一切众生起于悲心与利乐时，愿使大悲坚固，以悲灭众生苦。使一切众生苦皆来逼我。我今以此无畏施福，使一切众生皆得大悲。我今所有忍辱功德，于将来世刀兵劫时，以我悲心灭一切众生瞋。以施食功德饥馑劫时，使得饮食充足一切众生；以水施众生功德，使成就悲心，住一切众生心中；以衣施众生功德，使一切众生得惭愧心；以灯明施佛因缘功德，使我将来得于佛日灭一切暗；以施眼功德，使我将来世，愿一切众生速得佛眼；以我舍头功德，使一切众生向菩提心；以我药施因缘功德，使一切众生除生老病死；以我走使供给众生功德因缘，使一切众生得无上无漏成菩提道；以我华幢盖供养佛塔因缘功德，使一切众生得高胜福；以我旛供养舍利功德因缘，使一切众生除暗得明；以铃声供养因缘，使一切众生得梵音声；以香华璎珞供养因缘功德，使一切众生除诸结使垢烦恼臭秽；以供养三宝因缘功德，使一切众生常值三宝不曾空缺；以我于崄道中为诸商贾除崄道畏功德因缘，使一切众生出生死畏；以我度众生海难功德因缘，使一切众生度生死海；以我所有净善因缘功德，使一切众生摧破四魔得成正觉。我当得三菩提，我于众生虽道是语，为欲安慰众生故说是语，以此功德使一切众生得无上菩提，一切众生菩提即是我菩提。一切众生为痴所障，使得无上菩提，以此因缘功德，使一切众生于前成佛，我最后成。以我于生死中往返因缘功德，使一切众生皆得作佛；以我发善心功德因缘，使一切众生皆得佛智。若有见闻受持读诵者，皆作无上菩提之因。我欲满一切众生欲愿，我愿故未满，若我见苦众生悲吟之声，以此功德，使一切众生皆得作佛欢喜瞻覩。设我修诸善行不使一切众生作佛者，我尚不喜闻，况复履行？」菩萨语功德言：「汝若不能拥护众生作依止者，我亦不欲于汝及以果报。何以故？为众生修福不自为己故。若众生尽，我善如虚空，于三时中与众生乐，施以菩提心。」胜丈夫悲发愿，此名说悲心，亦名五种说，亦名救众生，总名大丈夫行。","（贤偈有五百，古书有八百。阿阇梨犊子部提波罗大菩萨生在南方，是所作竟。）"],source:"https://cbetaonline.dila.edu.tw/zh/T30n1577",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T30/T30n1577.xml",sourceLabel:"CBETA T30n1577",scope:"上下卷完整正文",originalTitle:"大丈夫論",juan:[1,2]},{id:"repentance",title:"八十八佛大忏悔文",subtitle:"古代礼忏佛名节选 · 集诸经礼忏仪",paragraphs:["南无普光佛。","南无普明佛。","南无普净佛。","南无多摩罗跋栴檀香佛。","南无栴檀光佛。","南无摩尼幢佛。","南无欢喜藏摩尼宝积佛。","南无一切世间乐见上大精进佛。","南无摩尼幢灯光佛。","南无慧炬照佛。","南无海德光明佛。","南无金刚牢强普散金光佛。","南无大强精进勇猛佛。","南无大悲光佛。","南无慈力王佛。","南无慈藏佛。","南无栴檀窟庄严胜佛。","南无贤善首佛。","南无善意佛。","南无广庄严王佛。","南无金刚华佛。","南无宝盖照空自在王佛。","南无虚空宝华光佛。","南无琉璃庄严王佛。","南无普现色身光佛。","南无不动光佛。","南无降伏诸魔王佛。","南无才光明佛。","南无智慧胜佛。","南无弥勒仙光佛。","南无世静光佛。","南无善寂月音妙尊智王佛。","南无龙种上尊王佛。","南无日月光佛。","南无日月珠光佛。","南无慧幡胜王佛。","南无师子吼自在力王佛。","南无妙音胜佛。","南无常光幢佛。","南无观世灯佛。","南无慧威灯王佛。","南无法胜王佛。","南无须弥光佛。","南无须曼那华光佛。","南无优钵罗华殊胜王佛。","南无大慧力王佛。","南无阿閦鞞欢喜光佛。","南无无量音声王佛。","南无才光佛。","南无金海光佛。","南无山海慧自在通王佛。","南无大通光佛。","南无一切法常满王佛。","南无释迦牟尼佛。","南无金刚不坏佛。","南无宝光佛。","南无龙尊王佛。","南无精进军佛。","南无精进喜佛。","南无宝积佛。","南无宝藏佛。","南无现无愚佛。","南无宝月佛。","南无无垢王佛。","南无离垢佛。","南无勇施佛。","南无清净佛。","南无清净施佛。","南无婆留那佛。","南无水天佛。","南无坚德佛。","南无栴檀功德佛。","南无无量掬光佛。","南无光德佛。","南无无忧德佛。","南无那罗延佛。","南无功德华佛。","南无莲华光游戏神通佛。","南无财功德佛。","南无德念佛。","南无善名称功德佛。","南无红炎幢王佛。","南无善游步功德佛。","南无鬪战胜佛。","南无善游步佛。","南无周匝庄严功德佛。","南无宝莲华游步佛。","南无宝莲华善住娑罗树王佛。"],source:"https://cbetaonline.dila.edu.tw/zh/T47n1982",complete:!1,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T47/T47n1982.xml",sourceLabel:"CBETA T47n1982",scope:"古代礼忏五十三佛名与三十五佛名节选，合计88佛名",originalTitle:"集諸經禮懺儀",juan:[1]},{id:"infinite-life",title:"无量寿经",subtitle:"佛说无量寿经 上下卷 · 曹魏 康僧铠译",paragraphs:["我闻如是：","一时佛住王舍城耆阇崛山中，与大比丘众万二千人俱，一切大圣神通已达，其名曰：尊者了本际、尊者正愿、尊者正语、尊者大号、尊者仁贤、尊者离垢、尊者名闻、尊者善实、尊者具足、尊者牛王、尊者优楼频䗍迦叶、尊者伽耶迦叶、尊者那提迦叶、尊者摩诃迦叶、尊者舍利弗、尊者大目揵连、尊者劫宾那、尊者大住、尊者大净志、尊者摩诃周那、尊者满愿子、尊者离障阂、尊者流灌、尊者坚伏、尊者面王、尊者果乘、尊者仁性、尊者喜乐、尊者善来、尊者罗云、尊者阿难，皆如斯等上首者也。","又与大乘众菩萨俱，普贤菩萨、妙德菩萨、慈氏菩萨等，此贤劫中一切菩萨。","又贤护等十六正士：善思议菩萨、信慧菩萨、空无菩萨、神通华菩萨、光英菩萨、慧上菩萨、智幢菩萨、寂根菩萨、愿慧菩萨、香象菩萨、宝英菩萨、中住菩萨、制行菩萨、解脱菩萨，皆遵普贤大士之德，具诸菩萨无量行愿，安住一切功德之法，游步十方，行权方便，入佛法藏，究竟彼岸，于无量世界现成等觉。","处兜率天弘宣正法，舍彼天宫降神母胎，从右脇生，现行七步。光明显曜，普照十方无量佛土，六种振动，举声自称：「吾当于世为无上尊，释梵奉侍，天、人归仰。」示现算计、文艺、射御，博综道术，贯练群籍，游于后园讲武试艺。现处宫中色味之间，见老、病、死，悟世非常，弃国财位，入山学道，服乘、白马、宝冠、璎珞，遣之令还。舍珍妙衣而著法服，剃除须发，端坐树下。勤苦六年，行如所应。现五浊刹随顺群生，示有尘垢沐浴金流。天按树枝得攀出池，灵禽翼从往诣道场，吉祥感征表章功祚。哀受施草，敷佛树下，加趺而坐，奋大光明使魔知之。魔率官属而来逼试，制以智力皆令降伏，得微妙法成最正觉。释梵祈劝请转法轮，以佛游步、佛吼而吼，扣法鼓、吹法螺、执法剑、建法幢、震法雷、曜法电、澍法雨、演法施，常以法音觉诸世间，光明普照无量佛土。一切世界六种震动，总摄魔界、动魔宫殿，众魔慑怖莫不归伏。掴裂邪网，消灭诸见，散诸尘劳，坏诸欲堑。严护法城，开阐法门；洗濯垢污，显明清白；光融佛法，宣流正化。入国分卫获诸丰饍，贮功德、示福田、欲宣法、现欣笑，以诸法药救疗三苦。显现道意无量功德，授菩萨记成等正觉，示现灭度拯济无极。消除诸漏，殖众德本，具足功德微妙难量。游诸佛国，普现道教，其所修行清净无秽。","譬如幻师现众异像，为男、为女无所不变，本学明了在意所为。此诸菩萨亦复如是，学一切法贯综缕练，所住安谛靡不感化，无数佛土皆悉普现，未曾慢恣、愍伤众生。如是之法一切具足，菩萨经典究畅要妙，名称普至导御十方，无量诸佛咸共护念。佛所住者皆已得住、大圣所立而皆已立，如来道化各能宣布，为诸菩萨而作大师。以甚深禅慧开导众人，通诸法性，达众生相，明了诸国，供养诸佛。化现其身犹如电光，善学无畏晓了幻法。坏裂魔网，解诸缠缚。超越声闻、缘觉之地，得空、无相、无愿三昧。善立方便，显示三乘。于此中下而现灭度，亦无所作、亦无所有，不起、不灭得平等法。具足成就无量总持百千三昧，诸根智慧广普寂定，深入菩萨法藏，得佛华严三昧。宣扬演说一切经典，住深定门，悉覩现在无量诸佛，一念之顷无不周遍。济诸剧难诸闲不闲，分别显示真实之际，得诸如来辩才之智。入众言音，开化一切，超过世间诸所有法。心常谛住度世之道，于一切万物随意自在。为众生类作不请之友，荷负群生为之重任。受持如来甚深法藏，护佛种性常使不绝。兴大悲、愍众生，演慈辩、授法眼、杜三趣、开善门，以不请之法施诸黎庶，犹如孝子爱敬父母。于诸众生视之若己，一切善本皆度彼岸，悉获诸佛无量功德，智慧圣明不可思议。","如是菩萨无量大士不可称计，一时来会。","尔时，世尊诸根悦豫，姿色清净，光颜巍巍。","尊者阿难承佛圣旨，即从座起，偏袒右肩，长跪合掌而白佛言：「今日世尊诸根悦豫，姿色清净，光颜巍巍，如明镜净影畅表里，威容显耀超绝无量，未曾瞻覩殊妙如今。唯然，大圣！我心念言：『今日世尊住奇特法、今日世雄住佛所住、今日世眼住导师行、今日世英住最胜道、今日天尊行如来德。去来现在佛佛相念，得无今佛念诸佛耶？何故威神光光乃尔？』」","于是世尊告阿难曰：「云何，阿难！诸天教汝来问佛耶？自以慧见问威颜乎？」","阿难白佛：「无有诸天来教我者，自以所见问斯义耳。」","佛言：「善哉，阿难！所问甚快。发深智慧真妙辩才，愍念众生问斯慧义。如来以无尽大悲矜哀三界，所以出兴于世，光阐道教，普令群萌获真法利。无量亿劫难值难见，犹灵瑞华时时乃出。今所问者多所饶益，开化一切诸天人民。","「阿难！当知如来正觉其智难量，多所导御，慧见无碍，无能遏绝。以一喰之力，能住寿命亿百千劫无数无量，复过于此。诸根悦豫不以毁损，姿色不变光颜无异。所以者何？如来定慧究畅无极，于一切法而得自在。","「阿难谛听，今为汝说。」","对曰：「唯然，愿乐欲闻。」","佛告阿难：「乃往过去久远无量不可思议无央数劫，锭光如来兴出于世，教化度脱无量众生，皆令得道乃取灭度。次有如来名曰光远、次名月光、次名栴檀香、次名善山王、次名须弥天冠、次名须弥等曜、次名月色、次名正念、次名离垢、次名无著、次名龙天、次名夜光、次名安明顶、次名不动地、次名琉璃妙华、次名琉璃金色、次名金藏、次名炎光、次名炎根、次名地种、次名月像、次名日音、次名解脱华、次名庄严光明、次名海觉神通、次名水光、次名大香、次名离尘垢、次名舍厌意、次名宝炎、次名妙顶、次名勇立、次名功德持慧、次名蔽日月光、次名日月琉璃光、次名无上琉璃光、次名最上首、次名菩提华、次名月明、次名日光、次名华色王、次名水月光、次名除痴冥、次名度盖行、次名净信、次名善宿、次名威神、次名法慧、次名鸾音、次名师子音、次名龙音、次名处世，如此诸佛皆悉已过。","「尔时，次有佛名世自在王如来、应供、等正觉、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。时有国王，闻佛说法心怀悦豫，寻发无上正真道意，弃国、捐王，行作沙门，号曰法藏，高才勇哲与世超异。诣世自在王如来所，稽首佛足，右绕三匝，长跪合掌以颂赞曰：",`「『光颜巍巍，　威神无极，　如是炎明，
无与等者。　日月摩尼，　珠光炎耀，
皆悉隐蔽，　犹如聚墨。　如来容颜，
超世无伦，　正觉大音，　响流十方。
戒闻精进，　三昧智慧，　威德无侣，
殊胜希有。　深谛善念，　诸佛法海，
穷深尽奥，　究其崖底。　无明、欲、怒，
世尊永无，　人雄师子，　神德无量。
功德广大，　智慧深妙，　光明威相，
震动大千。　愿我作佛，　齐圣法王，
过度生死，　靡不解脱。　布施、调意、
戒、忍、精进，　如是三昧，　智慧为上。
吾誓得佛，　普行此愿，　一切恐惧，
为作大安。　假令有佛，　百千亿万，
无量大圣，　数如恒沙，　供养一切，
斯等诸佛，　不如求道，　坚正不却。
譬如恒沙，　诸佛世界，　复不可计，
无数刹土，　光明悉照，　遍此诸国，
如是精进，　威神难量。　令我作佛，
国土第一，　其众奇妙，　道场超绝。
国如泥洹，　而无等双，　我当愍哀，
度脱一切。　十方来生，　心悦清净，
已到我国，　快乐安隐。　幸佛信明，
是我真证，　发愿于彼，　力精所欲。
十方世尊，　智慧无碍，　常令此尊，
知我心行。　假令身止，　诸苦毒中，
我行精进，　忍终不悔。』」`,"佛告阿难：「法藏比丘说此颂已而白佛言：『唯然，世尊！我发无上正觉之心，愿佛为我广宣经法，我当修行，摄取佛国清净庄严无量妙土，令我于世速成正觉，拔诸生死勤苦之本。』」","佛语阿难：「时世自在王佛告法藏比丘：『如所修行庄严佛土，汝自当知。』","「比丘白佛：『斯义弘深，非我境界。唯愿世尊广为敷演诸佛如来净土之行。我闻此已，当如说修行成满所愿。』","「尔时，世自在王佛知其高明志愿深广，即为法藏比丘而说经言：『譬如大海，一人斗量，经历劫数尚可穷底，得其妙宝。人有至心精进，求道不止，会当克果，何愿不得？』","「于是，世自在王佛即为广说二百一十亿诸佛刹土天人之善恶、国土之粗妙，应其心愿悉现与之。","「时彼比丘闻佛所说严净国土，皆悉覩见。超发无上殊胜之愿，其心寂静，志无所著，一切世间无能及者。具足五劫，思惟摄取庄严佛国清净之行。」","阿难白佛：「彼佛国土寿量几何？」","佛言：「其佛寿命四十二劫。","「时法藏比丘摄取二百一十亿诸佛妙土清净之行。如是修已，诣彼佛所，稽首礼足，绕佛三匝，合掌而住，白言：『世尊！我已摄取庄严佛土清净之行。』","「佛告比丘：『汝今可说，宜知是时。发起悦可一切大众。菩萨闻已，修行此法，缘致满足无量大愿。』","「比丘白佛：『唯垂听察，如我所愿，当具说之。","「『设我得佛，国有地狱、饿鬼、畜生者，不取正觉。","「『设我得佛，国中人天寿终之后复更三恶道者，不取正觉。","「『设我得佛，国中人天不悉真金色者，不取正觉。","「『设我得佛，国中人天形色不同有好丑者，不取正觉。","「『设我得佛，国中人天不悉识宿命，下至知百千亿那由他诸劫事者，不取正觉。","「『设我得佛，国中人天不得天眼，下至见百千亿那由他诸佛国者，不取正觉。","「『设我得佛，国中人天不得天耳，下至闻百千亿那由他诸佛所说不悉受持者，不取正觉。","「『设我得佛，国中人天不得见他心智，下至知百千亿那由他诸佛国中众生心念者，不取正觉。","「『设我得佛，国中人天不得神足于一念顷，下至不能超过百千亿那由他诸佛国者，不取正觉。","「『设我得佛，国中人天若起想念贪计身者，不取正觉。","「『设我得佛，国中人天不住定聚必至灭度者，不取正觉。","「『设我得佛，光明有能限量，下至不照百千亿那由他诸佛国者，不取正觉。","「『设我得佛，寿命有能限量，下至百千亿那由他劫者，不取正觉。","「『设我得佛，国中声闻有能计量，乃至三千大千世界众生缘觉于百千劫悉共计挍知其数者，不取正觉。","「『设我得佛，国中人天寿命无能限量——除其本愿修短自在——若不尔者，不取正觉。","「『设我得佛，国中人天乃至闻有不善名者，不取正觉。","「『设我得佛，十方世界无量诸佛不悉咨嗟称我名者，不取正觉。","「『设我得佛，十方众生至心信乐欲生我国，乃至十念，若不生者，不取正觉，唯除五逆、诽谤正法。","「『设我得佛，十方众生发菩提心修诸功德，至心发愿欲生我国，临寿终时，假令不与大众围绕现其人前者，不取正觉。","「『设我得佛，十方众生闻我名号、系念我国，殖诸德本、至心回向欲生我国，不果遂者，不取正觉。","「『设我得佛，国中人天不悉成满三十二大人相者，不取正觉。","「『设我得佛，他方佛土诸菩萨众来生我国，究竟必至一生补处——除其本愿自在所化，为众生故，被弘誓铠，积累德本度脱一切；游诸佛国修菩萨行，供养十方诸佛如来；开化恒沙无量众生，使立无上正真之道；超出常伦诸地之行，现前修习普贤之德——若不尔者，不取正觉。","「『设我得佛，国中菩萨承佛神力供养诸佛，一食之顷不能遍至无量无数亿那由他诸佛国者，不取正觉。","「『设我得佛，国中菩萨在诸佛前现其德本，诸所求欲供养之具若不如意者，不取正觉。","「『设我得佛，国中菩萨不能演说一切智者，不取正觉。","「『设我得佛，国中菩萨不得金刚那罗延身者，不取正觉。","「『设我得佛，国中人、天、一切万物严净光丽，形色殊特，穷微极妙，无能称量。其诸众生乃至逮得天眼，有能明了辨其名数者，不取正觉。","「『设我得佛，国中菩萨乃至少功德者，不能知见其道场树无量光色高四百万里者，不取正觉。","「『设我得佛，国中菩萨若受读经法，讽诵持说而不得辩才智慧者，不取正觉。","「『设我得佛，国中菩萨智慧辩才若可限量者，不取正觉。","「『设我得佛，国土清净，皆悉照见十方一切无量无数不可思议诸佛世界，犹如明镜覩其面像；若不尔者，不取正觉。","「『设我得佛，自地以上至于虚空，宫殿、楼观、池流、华树——国土所有一切万物——皆以无量杂宝百千种香而共合成，严饰奇妙超诸人天，其香普薰十方世界，菩萨闻者皆修佛行；若不尔者，不取正觉。","「『设我得佛，十方无量不可思议诸佛世界众生之类，蒙我光明触其体者，身心柔软超过人天；若不尔者，不取正觉。","「『设我得佛，十方无量不可思议诸佛世界众生之类，闻我名字不得菩萨无生法忍、诸深总持者，不取正觉。","「『设我得佛，十方无量不可思议诸佛世界，其有女人闻我名字，欢喜信乐，发菩提心，厌恶女身，寿终之后复为女像者，不取正觉。","「『设我得佛，十方无量不可思议诸佛世界，诸菩萨众闻我名字，寿终之后常修梵行至成佛道；若不尔者，不取正觉。","「『设我得佛，十方无量不可思议诸佛世界，诸天人民闻我名字，五体投地稽首作礼，欢喜信乐修菩萨行，诸天世人莫不致敬；若不尔者，不取正觉。","「『设我得佛，国中人天欲得衣服随念即至，如佛所赞应法妙服自然在身；若有裁缝、染治、浣濯者，不取正觉。","「『设我得佛，国中人天所受快乐不如漏尽比丘者，不取正觉。","「『设我得佛，国中菩萨随意欲见十方无量严净佛土，应时如愿，于宝树中皆悉照见，犹如明镜覩其面像；若不尔者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，至于得佛，诸根缺陋不具足者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，皆悉逮得清净解脱三昧，住是三昧一发意顷，供养无量不可思议诸佛世尊而不失定意；若不尔者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，寿终之后生尊贵家；若不尔者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，欢喜踊跃，修菩萨行，具足德本；若不尔者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，皆悉逮得普等三昧，住是三昧至于成佛，常见无量不可思议一切如来；若不尔者，不取正觉。","「『设我得佛，国中菩萨随其志愿，所欲闻法自然得闻；若不尔者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，不即得至不退转者，不取正觉。","「『设我得佛，他方国土诸菩萨众闻我名字，不即得至第一、第二、第三法忍，于诸佛法不能即得不退转者，不取正觉。』」","佛告阿难：「尔时，法藏比丘说此愿已，而说颂曰：",`「『我建超世愿，　必至无上道，
斯愿不满足，　誓不成等觉。
我于无量劫，　不为大施主，
普济诸贫苦，　誓不成等觉。
我至成佛道，　名声超十方，
究竟靡所闻，　誓不成等觉。
离欲深正念，　净慧修梵行，
志求无上道，　为诸天人师。
神力演大光，　普照无际土，
消除三垢冥，　明济众厄难。
开彼智慧眼，　灭此昏盲暗，
闭塞诸恶道，　通达善趣门。
功祚成满足，　威曜朗十方，
日月戢重晖，　天光隐不现。
为众开法藏，　广施功德宝，
常于大众中，　说法师子吼。
供养一切佛，　具足众德本，
愿慧悉成满，　得为三界雄。
如佛无量智，　通达靡不遍，
愿我功德力，　等此最胜尊。
斯愿若克果，　大千应感动，
虚空诸天人，　当雨珍妙华。』」`,"佛语阿难：「法藏比丘说此颂已，应时普地六种震动，天雨妙华以散其上，自然音乐空中赞言：『决定必成无上正觉。』于是法藏比丘具足修满如是大愿，诚谛不虚，超出世间深乐寂灭。","「阿难！法藏比丘于彼佛所诸天、魔、梵、龙神八部大众之中发斯弘誓，建此愿已，一向专志庄严妙土。所修佛国开廓广大，超胜独妙，建立常然，无衰、无变。于不可思议兆载永劫积殖菩萨无量德行，不生欲觉、瞋觉、害觉，不起欲想、瞋想、害想，不著色、声、香、味、触之法。忍力成就，不计众苦。少欲知足，无染恚痴，三昧常寂，智慧无碍。无有虚伪谄曲之心，和颜软语先意承问，勇猛精进志愿无惓，专求清白之法。以慧利群生，恭敬三宝，奉事师长；以大庄严具足众行，令诸众生功德成就。住空、无相、无愿之法，无作、无起，观法如化。远离麁言、自害、害彼、彼此俱害，修习善语，自利、利人、彼我兼利。弃国、捐王，绝去财色。自行六波罗蜜，教人令行。","「无央数劫积功累德，随其生处在意所欲，无量宝藏自然发应，教化安立无数众生。住于无上正真之道，或为长者、居士、豪姓、尊贵，或为刹利国君、转轮圣帝，或为六欲天主乃至梵王。常以四事供养恭敬一切诸佛，如是功德不可称说。口气香洁如优钵罗华，身诸毛孔出栴檀香，其香普熏无量世界；容色端正，相好殊妙，其手常出无尽之宝，衣服、饮食珍妙华香，诸盖幢幡庄严之具。如是等事超诸人天，于一切法而得自在。」","阿难白佛：「法藏菩萨为已成佛而取灭度、为未成佛？为今现在？」","佛告阿难：「法藏菩萨今已成佛，现在西方，去此十万亿刹，其佛世界名曰安乐。」","阿难又问：「其佛成道已来为经几时？」","佛言：「成佛已来凡历十劫。其佛国土自然七宝——金、银、琉璃、珊瑚、琥珀、车𤦲、玛瑙——合成为地，恢廓旷荡不可限极。悉相杂厕，转相入间，光赫焜耀，微妙奇丽，清净庄严超逾十方一切世界众宝中精，其宝犹如第六天宝。又其国土无须弥山及金刚围一切诸山，亦无大海、小海、溪渠、井谷。佛神力故，欲见则见。亦无地狱、饿鬼、畜生诸难之趣。亦无四时——春、秋、冬、夏——不寒、不热，常和调适。」","尔时，阿难白佛言：「世尊！若彼国土无须弥山，其四天王及忉利天依何而住？」","佛语阿难：「第三炎天乃至色究竟天皆依何住？」","阿难白佛：「行业果报不可思议。」","佛语阿难：「行业果报不可思议，诸佛世界亦不可思议。其诸众生功德善力住行业之地，故能尔耳。」","阿难白佛：「我不疑此法，但为将来众生欲除其疑惑，故问斯义。」","佛告阿难：「无量寿佛威神光明最尊第一，诸佛光明所不能及。或有佛光照百佛世界、或千佛世界，取要言之，乃照东方恒沙佛刹，南、西、北方四维，上、下亦复如是。或有佛光照于七尺，或照一由旬，二、三、四、五由旬，如是转倍乃至照一佛刹。是故，无量寿佛号无量光佛、无边光佛、无碍光佛、无对光佛、炎王光佛、清净光佛、欢喜光佛、智慧光佛、不断光佛、难思光佛、无称光佛、超日月光佛。","「其有众生遇斯光者，三垢消灭，身意柔软，欢喜踊跃，善心生焉。若在三涂勤苦之处，见此光明，皆得休息，无复苦恼；寿终之后皆蒙解脱。","「无量寿佛光明显赫照曜十方诸佛国土，莫不闻知。不但我今称其光明，一切诸佛、声闻、缘觉、诸菩萨众咸共叹誉，亦复如是。若有众生闻其光明威神功德，日夜称说至心不断，随意所愿得生其国，为诸菩萨、声闻大众所共叹誉称其功德；至其然后得佛道时，普为十方诸佛菩萨叹其光明亦如今也。」","佛言：「我说无量寿佛光明威神巍巍殊妙，昼夜一劫尚不能尽。」","佛语阿难：「无量寿佛寿命长久不可称计，汝宁知乎？假使十方世界无量众生皆得人身，悉令成就声闻、缘觉，都共集会禅思一心，竭其智力于百千万劫悉共推算，计其寿命长远劫数，不能穷尽知其限极。声闻、菩萨、天、人之众，寿命长短亦复如是，非算数譬喻所能知也。又声闻、菩萨其数难量不可称说，神智洞达威力自在，能于掌中持一切世界。」","佛语阿难：「彼佛初会，声闻众数不可称计，菩萨亦然。能如大目揵连百千万亿无量无数，于阿僧祇那由他劫乃至灭度悉共计挍，不能究了多少之数。譬如大海深广无量，假使有人析其一毛以为百分，以一分毛沾取一渧。于意云何？其所渧者于彼大海，何所为多？」","阿难白佛：「彼所渧水比于大海多少之量，非巧历算数、言辞譬类所能知也。」","佛语阿难：「如目连等于百千万亿那由他劫计彼初会声闻菩萨，所知数者犹如一渧，其所不知如大海水。","「又其国土，七宝诸树周满世界——金树、银树、琉璃树、颇梨树、珊瑚树、玛瑙树、车𤦲树——或有二宝、三宝乃至七宝转共合成。或有金树，银叶、华、果；或有银树，金叶、华、果；或琉璃树，颇梨为叶，华、果亦然；或水精树，琉璃为叶，华、果亦然；或珊瑚树，玛瑙为叶，华、果亦然；或玛瑙树，琉璃为叶，华、果亦然；或车𤦲树，众宝为叶，华、果亦然。或有宝树，紫金为本、白银为茎、琉璃为枝、水精为条、珊瑚为叶、玛瑙为华、车𤦲为实；或有宝树，白银为本、琉璃为茎、水精为枝、珊瑚为条、玛瑙为叶、车𤦲为华、紫金为实；或有宝树，琉璃为本、水精为茎、珊瑚为枝、玛瑙为条、车𤦲为叶、紫金为华、白银为实；或有宝树，水精为本、珊瑚为茎、玛瑙为枝、车𤦲为条、紫金为叶、白银为华、琉璃为实；或有宝树，珊瑚为本、玛瑙为茎、车𤦲为枝、紫金为条、白银为叶、琉璃为华、水精为实；或有宝树，玛瑙为本、车𤦲为茎、紫金为枝、白银为条、琉璃为叶、水精为华、珊瑚为实；或有宝树，车𤦲为本、紫金为茎、白银为枝、琉璃为条、水精为叶、珊瑚为华、玛瑙为实。行行相值、茎茎相望、枝枝相准、叶叶相向、华华相顺、实实相当，荣色光曜不可胜视。清风时发，出五音声，微妙宫商自然相和。","「又无量寿佛其道场树，高四百万里，其本周围五千由旬，枝叶四布二十万里。一切众宝自然合成，以月光摩尼持海轮宝——众宝之王——而庄严之。周匝条间垂宝璎珞，百千万色种种异变，无量光炎照曜无极。珍妙宝网罗覆其上，一切庄严随应而现。微风徐动出妙法音，普流十方一切佛国。其闻音者得深法忍，住不退转至成佛道，不遭苦患；目覩其色、耳闻其音、鼻知其香、舌甞其味、身触其光、心以法缘，一切皆得甚深法忍，住不退转至成佛道，六根清彻无诸恼患。","「阿难！若彼国人天见此树者，得三法忍：一者、音响忍，二者、柔顺忍，三者、无生法忍。此皆无量寿佛威神力故、本愿力故、满足愿故、明了愿故、坚固愿故、究竟愿故。」","佛告阿难：「世间帝王有百千音乐，自转轮圣王乃至第六天上，伎乐音声展转相胜千亿万倍；第六天上万种乐音，不如无量寿国诸七宝树一种音声千亿倍也。亦有自然万种伎乐，又其乐声无非法音，清畅哀亮，微妙和雅，十方世界音声之中最为第一。","「又，讲堂、精舍、宫殿、楼观皆七宝庄严，自然化成，复以真珠、明月摩尼众宝以为交露，覆盖其上。内、外、左、右有诸浴池，或十由旬，或二十、三十，乃至百千由旬，纵广深浅各皆一等，八功德水湛然盈满，清净香洁味如甘露。黄金池者底白银沙，白银池者底黄金沙，水精池者底琉璃沙，琉璃池者底水精沙，珊瑚池者底琥珀沙，琥珀池者底珊瑚沙，车𤦲池者底玛瑙沙，玛瑙池者底车𤦲沙，白玉池者底紫金沙，紫金池者底白玉沙，或二宝、三宝乃至七宝转共合成。其池岸上有栴檀树，华叶垂布，香气普熏。天优钵罗华、钵昙摩华、拘物头华、分陀利华，杂色光茂弥覆水上。","「彼诸菩萨及声闻众若入宝池，意欲令水没足，水即没足；欲令至膝，即至于膝；欲令至腰，水即至腰；欲令至颈，水即至颈；欲令灌身，自然灌身；欲令还复，水辄还复。调和冷煖自然随意，开神悦体荡除心垢，清明澄洁净若无形。宝沙映彻无深不照，微澜回流转相灌注，安详徐逝不迟不疾。波扬无量自然妙声，随其所应莫不闻者，或闻佛声，或闻法声，或闻僧声，或寂静声、空无我声、大慈悲声、波罗蜜声，或十力无畏不共法声、诸通慧声、无所作声、不起灭声、无生忍声，乃至甘露灌顶众妙法声。如是等声，称其所闻欢喜无量，随顺清净离欲寂灭真实之义、随顺三宝力无所畏不共之法、随顺通慧菩萨声闻所行之道。无有三涂苦难之名，但有自然快乐之音，是故其国名曰极乐。","「阿难！彼佛国土诸往生者，具足如是清净色身、诸妙音声、神通功德，所处宫殿、衣服、饮食、众妙华香庄严之具，犹第六天自然之物。若欲食时，七宝应器自然在前，金、银、琉璃、车𤦲、玛瑙、珊瑚、虎珀、明月真珠如是众钵随意而至，百味饮食自然盈满。虽有此食实无食者，但见色、闻香，意以为食，自然饱足，身心柔软，无所味著。事已化去，时至复现。","「彼佛国土清净安隐，微妙快乐，次于无为泥洹之道。其诸声闻、菩萨、人、天，智慧高明，神通洞达。咸同一类，形无异状，但因顺余方，故有人、天之名。颜貌端正，超世希有，容色微妙，非天、非人，皆受自然虚无之身、无极之体。」","佛告阿难：「譬如世间贫穷乞人在帝王边，形貌容状宁可类乎？」","阿难白佛：「假令此人在帝王边，羸陋丑恶无以为喻，百千万亿不可计倍。所以然者？贫穷乞人底极厮下，衣不蔽形，食趣支命，饥寒困苦，人理殆尽。皆坐前世不殖德本，积财不施、富有益悭，但欲唐得、贪求无厌，不信修善、犯恶山积。如是寿终，财宝消散，苦身积聚为之忧恼，于己无益，徒为他有。无善可怙，无德可恃，是故，死堕恶趣，受此长苦。罪毕得出生为下贱，愚鄙斯极示同人类。所以世间帝王人中独尊，皆由宿世积德所致，慈惠博施，仁爱兼济，履信修善，无所违诤。是以寿终，福应得升善道，上生天上享兹福乐。积善余庆今得为人，遇生王家自然尊贵，仪容端正众所敬事，妙衣珍膳随心服御。宿福所追，故能致此。」","佛告阿难：「汝言是也。计如帝王，虽人中尊贵，形色端正，比之转轮圣王，甚为鄙陋，犹彼乞人在帝王边。转轮圣王威相殊妙天下第一，比忉利天王，又复丑恶不得相喻万亿倍也。假令天帝比第六天王，百千亿倍不相类也。设第六天王比无量寿佛国菩萨、声闻，光颜容色不相及逮，百千万亿不可计倍。」","佛告阿难：「无量寿国其诸天人，衣服、饮食、华香、璎珞、诸盖幢幡、微妙音声，所居舍宅、宫殿、楼阁，称其形色、高下、大小，或一宝、二宝，乃至无量众宝，随意所欲，应念即至。又，以众宝妙衣遍布其地，一切人天践之而行。无量宝网弥覆佛土，皆以金缕、真珠、百千杂宝、奇妙珍异庄严绞饰，周匝四面垂以宝铃，光色晃曜尽极严丽。自然德风徐起微动，其风调和，不寒、不暑；温凉柔软，不迟、不疾；吹诸罗网及众宝树，演发无量微妙法音，流布万种温雅德香。其有闻者，尘劳垢习自然不起，风触其身皆得快乐，譬如比丘得灭尽三昧。","「又，风吹散华遍满佛土，随色次第而不杂乱，柔软光泽馨香芬烈，足履其上陷下四寸，随举足已还复如故。华用已讫地辄开裂，以次化没清净无遗，随其时节风吹散华，如是六反。","「又众宝莲华周满世界，一一宝华百千亿叶，其叶光明无量种色，青色青光，白色白光，玄、黄、朱、紫光色亦然，炜烨焕烂，明曜日月。一一华中出三十六百千亿光；一一光中出三十六百千亿佛，身色紫金，相好殊特；一一诸佛又放百千光明，普为十方说微妙法；如是诸佛各各安立无量众生于佛正道。」","佛告阿难：「其有众生生彼国者，皆悉住于正定之聚。所以者何？彼佛国中无诸邪聚及不定之聚，十方恒沙诸佛如来皆共赞叹无量寿佛威神功德不可思议。诸有众生闻其名号信心欢喜，乃至一念，至心回向愿生彼国，即得往生住不退转，唯除五逆、诽谤正法。」","佛告阿难：「十方世界诸天人民，其有至心愿生彼国，凡有三辈。其上辈者，舍家弃欲而作沙门，发菩提心，一向专念无量寿佛，修诸功德愿生彼国。此等众生临寿终时，无量寿佛与诸大众现其人前，即随彼佛往生其国，便于七宝华中自然化生，住不退转，智慧勇猛，神通自在。是故，阿难！其有众生欲于今世见无量寿佛，应发无上菩提之心，修行功德，愿生彼国。」","佛语阿难：「其中辈者，十方世界诸天人民，其有至心愿生彼国，虽不能行作沙门大修功德，当发无上菩提之心，一向专念无量寿佛。多少修善、奉持斋戒、起立塔像、饭食沙门、悬缯然灯、散华烧香，以此回向愿生彼国。其人临终，无量寿佛化现其身——光明相好，具如真佛——与诸大众现其人前，即随化佛往生其国，住不退转，功德智慧次如上辈者也。」","佛语阿难：「其下辈者，十方世界诸天人民，其有至心欲生彼国，假使不能作诸功德，当发无上菩提之心，一向专意乃至十念，念无量寿佛，愿生其国。若闻深法欢喜信乐，不生疑惑，乃至一念念于彼佛，以至诚心愿生其国。此人临终梦见彼佛，亦得往生，功德智慧次如中辈者也。」","佛告阿难：「无量寿佛威神无极，十方世界无量无边不可思议诸佛如来莫不称叹。于彼东方恒沙佛国，无量无数诸菩萨众，皆悉往诣无量寿佛所恭敬供养，及诸菩萨、声闻大众听受经法，宣布道化；南、西、北方、四维，上、下亦复如是。」","尔时，世尊而说颂曰：",`「东方诸佛国，　其数如恒沙，
彼土诸菩萨，　往觐无量觉；
南、西、北四维，　上、下亦复然。
彼土菩萨众，　往觐无量觉，
一切诸菩萨，　各赍天妙华，
宝香无价衣，　供养无量觉；
咸然奏天乐，　畅发和雅音，
歌叹最胜尊，　供养无量觉。
究达神通慧，　游入深法门，
具足功德藏，　妙智无等伦。
慧日照世间，　消除生死云，
恭敬绕三匝，　稽首无上尊。
见彼严净土，　微妙难思议，
因发无量心，　愿我国亦然。
应时无量尊，　动容发欣笑，
口出无数光，　遍照十方国。
回光围绕身，　三匝从顶入，
一切天、人众，　踊跃皆欢喜。
大士观世音，　整服稽首问，
白佛：『何缘笑？　唯然愿说意。』
梵声犹雷震，　八音畅妙响：
『当授菩萨记，　今说仁谛听。
十方来正士，　吾悉知彼愿，
志求严净土，　受决当作佛；
觉了一切法，　犹如梦幻响，
满足诸妙愿，　必成如是刹。
知法如电影，　究竟菩萨道，
具诸功德本，　受决当作佛；
通达诸法门，　一切空无我，
专求净佛土，　必成如是刹。』
诸佛告菩萨：　『令觐安养佛，
闻法乐受行，　疾得清净处。
至彼严净土，　便速得神通，
必于无量尊，　受记成等觉。』
其佛本愿力，　闻名欲往生，
皆悉到彼国，　自致不退转。
菩萨兴志愿，　愿己国无异，
普念度一切，　名显达十方。
奉事亿如来，　飞化遍诸刹，
恭敬欢喜去，　还到安养国。
若人无善本，　不得闻此经；
清净有戒者，　乃获闻正法。
曾更见世尊，　则能信此事，
谦敬闻奉行，　踊跃大欢喜。
憍慢弊懈怠，　难以信此法；
宿世见诸佛，　乐听如是教。
声闻或菩萨，　莫能究圣心，
譬如从生盲，　欲行开导人。
如来智慧海，　深广无崖底，
二乘非所测，　唯佛独明了。
假使一切人，　具足皆得道，
净慧如本空，　亿劫思佛智，
穷力极讲说，　尽寿犹不知。
佛慧无边际，　如是致清净，
寿命甚难得，　佛世亦难值。
人有信慧难，　若闻精进求，
闻法能不忘，　见敬得大庆，
则我善亲友，　是故当发意。
设满世界火，　必过要闻法，
会当成佛道，　广济生死流。」`,"佛告阿难：「彼国菩萨皆当究竟一生补处——除其本愿为众生故——以弘誓功德而自庄严，普欲度脱一切众生。阿难！彼佛国中诸声闻众身光一寻，菩萨光明照百由旬。有二菩萨最尊第一，威神光明普照三千大千世界。」","阿难白佛：「彼二菩萨其号云何？」","佛言：「一名观世音，二名大势至。是二菩萨于此国土修菩萨行，命终转化生彼佛国。阿难！其有众生生彼国者，皆悉具足三十二相，智慧成满，深入诸法，究畅要妙，神通无碍，诸根明利。其钝根者成就二忍，其利根者得阿僧祇无生法忍。又彼菩萨乃至成佛不更恶趣，神通自在常识宿命，除生他方五浊恶世，示现同彼如我国也。」","佛语阿难：「彼国菩萨承佛威神，一食之顷往诣十方无量世界，恭敬供养诸佛世尊，随心所念，华香、伎乐、缯盖、幢幡，无数无量供养之具自然化生，应念即至，珍妙殊特非世所有。转以奉散诸佛、菩萨、声闻大众，在虚空中化成华盖，光色晃耀，香气普熏。其华周圆四百里者，如是转倍，乃覆三千大千世界，随其前后以次化没。其诸菩萨佥然欣悦，于虚空中共奏天乐，以微妙音歌叹佛德，听受经法欢喜无量。供养佛已、未食之前，忽然轻举还其本国。」","佛语阿难：「无量寿佛为诸声闻、菩萨大众颁宣法时，都悉集会七宝讲堂，广宣道教，演畅妙法，莫不欢喜，心解得道。即时四方自然风起，普吹宝树出五音声，雨无量妙华随风周遍，自然供养如是不绝。一切诸天皆赍天上百千华香、万种伎乐供养其佛及诸菩萨、声闻大众，普散华香、奏诸音乐，前后来往更相开避。当斯之时，熙然快乐不可胜言。」","佛告阿难：「生彼佛国诸菩萨等，所可讲说常宣正法，随顺智慧无违无失。于其国土所有万物，无我所心、无染著心，去来进止情无所系，随意自在无所适莫，无彼、无我，无竞、无讼。于诸众生得大慈悲饶益之心、柔软调伏无忿恨心、离盖清净无厌怠心、等心、胜心、深心、定心、爱法乐法喜法之心、灭诸烦恼离恶趣心，究竟一切菩萨所行，具足成就无量功德，得深禅定诸通明慧，游志七觉修心佛法，肉眼清彻靡不分了、天眼通达无量无限、法眼观察究竟诸道、慧眼见真能度彼岸、佛眼具足觉了法性。以无碍智为人演说，等观三界空无所有，志求佛法具诸辩才，除灭众生烦恼之患。从如来生，解法如如，善知习灭，音声方便。不欣世语，乐在正论，修诸善本，志崇佛道。知一切法皆悉寂灭，生身烦恼二余俱尽。闻甚深法心不疑惧，常能修行其大悲者。深远微妙靡不覆载，究竟一乘至于彼岸。决断疑网，慧由心出，于佛教法该罗无外。智慧如大海、三昧如山王，慧光明净超逾日月，清白之法具足圆满。","「犹如雪山，照诸功德等一净故；犹如大地，净秽好恶无异心故；犹如净水，洗除尘劳诸垢染故；犹如火王，烧灭一切烦恼薪故；犹如大风，行诸世界无障阂故；犹如虚空，于一切有无所著故；犹如莲华，于诸世间无染污故；犹如大乘，运载群萌出生死故；犹如重云，震大法雷觉未觉故；犹如大雨，雨甘露法润众生故；如金刚山，众魔外道不能动故；如梵天王，于诸善法最上首故；如尼拘类树，普覆一切故；如优昙钵华，希有难遇故；如金翅鸟，威伏外道故；如众游禽，无所藏积故；犹如牛王，无能胜故；犹如象王，善调伏故；如师子王，无所畏故。","「旷若虚空，大慈等故；摧灭嫉心，不望胜故。专乐求法，心无厌足；常欲广说，志无疲倦。击法鼓、建法幢、曜慧日、除痴暗、修六和敬、常行法施，志勇精进，心不退弱。为世灯明、最胜福田，常为师导等无憎爱。唯乐正道无余欣戚，拔诸欲刺以安群生，功德殊胜莫不尊敬，灭三垢障游诸神通。因力、缘力、意力、愿力、方便之力、常力、善力、定力、慧力、多闻之力、施戒、忍辱、精进、禅定、智慧之力、正念止观诸通明力、如法调伏诸众生力，如是等力一切具足。身色相好，功德、辩才具足庄严，无与等者。恭敬供养无量诸佛，常为诸佛所共称叹。究竟菩萨诸波罗蜜，修空无相无愿三昧、不生不灭诸三昧门，远离声闻缘觉之地。","「阿难！彼诸菩萨成就如是无量功德，我但为汝略言之耳；若广说者，百千万劫不能穷尽。」","佛告弥勒菩萨、诸天、人等：「无量寿国声闻、菩萨功德智慧不可称说，又其国土微妙安乐清净若此，何不力为善，念道之自然，著于无上下，洞达无边际？宜各勤精进，努力自求之，必得超绝去，往生安养国。横截五恶趣，恶趣自然闭；升道无穷极，易往而无人。其国不逆违，自然之所牵，何不弃世事，勤行求道德，可获极长生，寿乐无有极？","「然世人薄俗，共诤不急之事。于此剧恶极苦之中，勤身营务以自给济。无尊、无卑，无贫、无富，少、长、男、女共忧钱财，有无同然，忧思适等。屏营愁苦，累念积虑，为心走使，无有安时——有田忧田、有宅忧宅，牛、马、六畜、奴婢、钱财、衣、食、什物，复共忧之——重思累息，忧念愁怖，横为非常、水、火、盗贼、怨家、债主焚漂劫夺，消散磨灭，忧毒忪忪，无有解时。结愤心中不离忧恼，心坚意固适无纵舍，或坐摧碎身亡命终，弃捐之去莫谁随者。","「尊贵、豪富亦有斯患，忧惧万端，勤苦若此，结众寒热与痛共俱。贫穷下劣困乏常无，无田亦忧欲有田、无宅亦忧欲有宅，无牛、马、六畜、奴婢、钱财、衣、食、什物亦忧欲有之。适有一复少一、有是少是，思有齐等；适欲具有便复糜散。如是忧苦当复求索，不能时得思想无益，身心俱劳，坐起不安，忧念相随，勤苦若此，亦结众寒热与痛共俱。或时坐之终身夭命，不肯为善、行道、进德，寿终身死当独远去，有所趣向善恶之道，莫能知者。","「世间人民，父子、兄弟、夫妇、家室、中外亲属，当相敬爱，无相憎嫉；有无相通，无得贪惜；言色常和，莫相违戾。或时心诤有所恚怒，今世恨意微相憎嫉，后世转剧至成大怨。所以者何？世间之事更相患害，虽不即时应急相破，然含毒畜怒结愤精神，自然克识不得相离，皆当对生更相报复。人在世间爱欲之中，独生、独死，独去、独来，当行至趣苦乐之地，身自当之无有代者。善恶变化、殃福异处，宿豫严待，当独趣入。远到他所莫能见者，善恶自然追行所生。窈窈冥冥别离久长，道路不同会见无期，甚难甚难复得相值。何不弃众事，各曼强健时，努力勤修善，精进愿度世，可得极长生？如何不求道，安所须待，欲何乐乎？","「如是，世人不信作善得善、为道得道，不信人死更生、惠施得福，善恶之事都不信之，谓之不然终无有是。但坐此故，且自见之，更相瞻视，先后同然。转相承受父余教令，先人祖父素不为善、不识道德，身愚神暗，心塞意闭。死生之趣、善恶之道，自不能见，无有语者；吉凶祸福，竞各作之，无一怪也。生死常道转相嗣立，或父哭子、或子哭父，兄弟、夫妇更相哭泣，颠倒上下无常根本，皆当过去不可常保。教语开导，信之者少，是以生死流转无有休止。","「如此之人，曚冥抵突，不信经法，心无远虑，各欲快意；痴惑于爱欲，不达于道德；迷没于瞋怒，贪狼于财色。坐之不得道，当更恶趣苦，生死无穷已，哀哉甚可伤。或时室家，父子、兄弟、夫妇，一死一生更相哀愍，恩爱、思慕、忧念结缚，心意痛著迭相顾恋，穷日卒岁无有解已。教语道德心不开明，思想恩好不离情欲。惛曚闭塞，愚惑所覆，不能深思熟计、心自端政、专精行道、决断世事，便旋至竟年寿终尽不能得道，无可奈何。","「总猥愦扰皆贪爱欲，惑道者众、悟之者寡，世间怱怱，无可聊赖。尊卑、上下、贫富、贵贱，勤苦怱务各怀杀毒，恶气窈冥为妄兴事，违逆天地不从人心，自然非恶先随与之。恣听所为待其罪极，其寿未尽便顿夺之。下入恶道，累世怼苦展转其中，数千亿劫无有出期。痛不可言，甚可哀愍。」","佛告弥勒菩萨、诸天人等：「我今语汝世间之事，人用是故，坐不得道。当熟思计远离众恶，择其善者勤而行之。爱欲荣华不可常保，皆当别离无可乐者。曼佛在世当勤精进，其有至愿生安乐国者，可得智慧明达、功德殊胜；勿得随心所欲，亏负经戒在人后也。傥有疑意不解经者，可具问佛，当为说之。」","弥勒菩萨长跪白言：「佛威神尊重，所说快善，听佛经者贯心思之。世人实尔如佛所言，今佛慈愍显示大道，耳目开明长得度脱，闻佛所说莫不欢喜。诸天、人民、蠕动之类，皆蒙慈恩解脱忧苦。佛语教诫甚深甚善，智慧明见八方、上下、去来今事，莫不究畅。今我众等所以蒙得度脱，皆佛前世求道之时谦苦所致。恩德普覆，福禄巍巍，光明彻照达空无极；开入泥洹，教授典揽威制消化，感动十方无穷无极。佛为法王尊超众圣，普为一切天人之师，随心所愿皆令得道。今得值佛，复闻无量寿声，靡不欢喜，心得开明。」","佛告弥勒：「汝言是也。若有慈敬于佛者，实为大善。天下久久乃复有佛，今我于此世作佛，演说经法，宣布道教，断诸疑网；拔爱欲之本，杜众恶之源。游步三界无所拘阂，典揽智慧众道之要，执持纲维昭然分明，开示五趣度未度者，决正生死泥洹之道。","「弥勒当知，汝从无数劫来修菩萨行，欲度众生，其已久远，从汝得道至于泥洹不可称数。汝及十方诸天、人民一切四众，永劫已来展转五道，忧畏勤苦不可具言，乃至今世生死不绝，与佛相值听受经法，又复得闻无量寿佛。快哉甚善，吾助尔喜。","「汝今亦可自厌生、死、老、病、痛苦、恶露、不净、无可乐者，宜自决断。端身正行，益作诸善；修己洁体，洗除心垢；言行忠信，表里相应；人能自度，转相拯济；精明求愿，积累善本。虽一世勤苦须臾之间，后生无量寿佛国快乐无极，长与道德合明，永拔生死根本，无复贪恚、愚痴、苦恼之患。欲寿一劫、百劫、千亿万劫，自在随意皆可得之，无为自然次于泥洹之道。汝等宜各精进求心所愿，无得疑惑中悔自为过咎，生彼边地七宝宫殿，五百岁中受诸厄也。」","弥勒白佛：「受佛重诲，专精修学，如教奉行，不敢有疑。」","佛告弥勒：「汝等能于此世端心正意，不作众恶，甚为至德，十方世界最无伦匹。所以者何？诸佛国土天人之类自然作善，不大为恶，易可开化。今我于此世间作佛，处于五恶、五痛、五烧之中，为最剧苦。教化群生令舍五恶、令去五痛、令离五烧；降化其意令持五善，获其福德度世长寿泥洹之道。」","佛言：「何等为五恶？何等五痛？何等五烧？何等消化五恶、令持五善，获其福德度世长寿泥洹之道？","「其一恶者，诸天、人民、蠕动之类。欲为众恶莫不皆然。强者伏弱转相克贼，残害杀戮迭相吞噬，不知修善恶逆无道，后受殃罚自然趣向。神明记识犯者不赦，故有贫穷、下贱、乞丐、孤独、聋盲、瘖哑、愚痴、憋恶，至有尫狂不逮之属。又有尊贵、豪富、高才、明达皆由宿世慈孝、修善积德所致。世有常道、王法、牢狱不肯畏慎，为恶入罪受其殃罚，求望解脱难得免出。世间有此目前现事，寿终后世尤深尤剧，入其幽冥转生受身。譬如王法痛苦极刑，故有自然三涂无量苦恼，转贸其身、改形易道，所受寿命或长或短，魂神精识自然趣之。当独值向相从共生，更相报复无有止已，殃恶未尽不得相离，展转其中无有出期，难得解脱痛不可言。天地之间自然有是，虽不即时卒暴应至，善恶之道会当归之。是为一大恶、一痛、一烧，勤苦如是。","「譬如大火焚烧人身，人能于中一心制意、端身正行，独作诸善、不为众恶者，身独度脱，获其福德度世上天泥洹之道，是为一大善也。」","佛言：「其二恶者，世间人民——父子、兄弟、室家、夫妇——都无义理，不顺法度。奢婬憍纵，各欲快意，任心自恣，更相欺惑。心口各异、言念无实、佞谄不忠、巧言谀媚、嫉贤谤善，陷入怨枉。主上不明任用臣下、臣下自在机伪多端，践度能行知其形势。在位不正为其所欺，妄损忠良不当天心。臣欺其君、子欺其父，兄弟、夫妇、中外知识更相欺诳，各怀贪欲、瞋恚、愚痴，欲自厚己、欲贪多有，尊卑、上下心俱同然。破家亡身不顾前后，亲属内外坐之灭族。或时室家、知识、乡党、市里、愚民、野人转共从事，更相剥害，忿成怨结。富有悭惜不肯施与，爱保贪重心劳身苦，如是至竟无所恃怙，独来独去无一随者。善恶、祸福追命所生，或在乐处、或入苦毒，然后乃悔，当复何及？世间人民心愚少智，见善憎谤不思慕及，但欲为恶妄作非法，常怀盗心悕望他利，消散磨尽而复求索。邪心不正，惧人有色，不豫思计，事至乃悔。今世现有王法牢狱，随罪趣向受其殃罚。因其前世不信道德、不修善本，今复为恶，天神克识别其名籍，寿终神逝下入恶道，故有自然三涂无量苦恼。展转其中，世世累劫无有出期，难得解脱痛不可言，是为二大恶、二痛、二烧，勤苦如是。","「譬如大火焚烧人身，人能于中一心制意、端身正行，独作诸善、不为众恶者，身独度脱，获其福德度世上天泥洹之道，是为二大善也。」","佛言：「其三恶者，世间人民相因寄生，共居天地之间，处年寿命无能几何。上有贤明长者、尊贵豪富，下有贫穷㒋贱、尫劣愚夫，中有不善之人常怀邪恶，但念婬妷，烦满胸中，爱欲交乱坐起不安，贪意守惜但欲唐得。眄睐细色邪态外逸，自妻厌憎私妄出入，费损家财事为非法，交结聚会兴师相伐，攻劫杀戮强夺不道。恶心在外不自修业，盗窃趣得欲击成事，恐势迫胁归给妻子，恣心快意极身作乐。或于亲属不避尊卑，家室中外患而苦之，亦复不畏王法禁令。如是之恶著于人鬼，日月照见、神明记识，故有自然三涂无量苦恼。展转其中，世世累劫无有出期，难得解脱痛不可言，是为三大恶、三痛、三烧，勤苦如是。","「譬如大火焚烧人身，人能于中一心制意、端身正行，独作诸善、不为众恶者，身独度脱，获其福德度世上天泥洹之道，是为三大善也。」","佛言：「其四恶者，世间人民不念修善，转相教令共为众恶。两舌、恶口、妄言、绮语、谗贼、鬪乱，憎嫉善人、败坏贤明，于傍快喜。不孝二亲、轻慢师长，朋友无信，难得诚实。尊贵自大谓己有道，横行威势侵易于人，不能自知，为恶无耻，自以强健欲人敬难，不畏天地、神明、日月，不肯作善，难可降化。自用偃蹇谓可常尔，无所忧惧，常怀憍慢。如是众恶，天神记识，赖其前世颇作福德，小善扶接营护助之；今世为恶福德尽灭，诸善神鬼各去离之，身独空立无所复依。寿命终尽诸恶所归，自然迫促共趣夺之。又其名籍记在神明，殃咎牵引当往趣向，罪报自然无从舍离。但得前行入于火镬，身心摧碎、精神痛苦，当斯之时悔复何及？天道自然，不得蹉跌，故有自然三涂无量苦恼。展转其中，世世累劫无有出期，难得解脱痛不可言，是为四大恶、四痛、四烧，勤苦如是。","「譬如大火焚烧人身，人能于中一心制意、端身正行，独作诸善、不为众恶，身独度脱，获其福德度世上天泥洹之道，是为四大善也。」","佛言：「其五恶者，世间人民徙倚懈惰，不肯作善、治身修业，家室眷属饥寒困苦。父母教诲瞋目怒应，言令不和违戾反逆譬如怨家，不如无子。取与无节，众共患厌，负恩违义，无有报偿之心。贫穷困乏不能复得，辜较纵夺放恣游散，串数唐得用自赈给。耽酒嗜美、饮食无度，肆心荡逸、鲁扈抵突，不识人情强欲抑制。见人有善憎嫉恶之，无义、无礼，无所顾录。自用职当不可谏晓，六亲眷属所资有无不能忧念。不惟父母之恩、不存师友之义，心常念恶、口常言恶、身常行恶，曾无一善。不信先圣诸佛经法、不信行道可得度世、不信死后神明更生、不信作善得善为恶得恶。欲杀真人，鬪乱众僧，欲害父母、兄弟、眷属，六亲憎恶愿令其死。","「如是世人心意俱然，愚痴曚昧而自以智慧，不知生所从来、死所趣向。不仁、不顺，逆恶天地，而于其中悕望侥幸，欲求长生，会当归死。慈心教诲令其念善，开示生死善恶之趣自然有是，而不信之；苦心与语无益其人，心中闭塞意不开解。大命将终悔惧交至，不豫修善临穷方悔，悔之于后将何及乎？天地之间五道分明，恢廓窈冥浩浩茫茫，善恶报应祸福相承，身自当之无谁代者。","「数之自然应其所行，殃咎追命无得纵舍。善人行善，从乐入乐、从明入明；恶人行恶，从苦入苦、从冥入冥。谁能知者？独佛知耳。教语开示，信用者少，生死不休，恶道不绝。如是，世人难可具尽，故有自然三涂无量苦恼。展转其中，世世累劫无有出期，难得解脱，痛不可言，是为五大恶、五痛、五烧，勤苦如是。","「譬如大火焚烧人身，人能于中一心制意、端身正念，言行相副、所作至诚，所语如语、心口不转，独作诸善、不为众恶者，身独度脱，获其福德度世上天泥洹之道，是为五大善也。」","佛告弥勒：「吾语汝等，是世五恶勤苦若此，五痛、五烧展转相生，但作众恶不修善本，皆悉自然入诸恶趣。或其今世先被殃病，求死不得、求生不得，罪恶所招示众见之。身死随行入三恶道，苦毒无量自相燋然。至其久后共作怨结，从小微起遂成大恶，皆由贪著财色、不能施慧，痴欲所迫、随心思想，烦恼结缚无有解已，厚己诤利无所省录。富贵荣华当时快意，不能忍辱不务修善，威势无几随以磨灭，身生劳苦久后大剧。天道施张自然𫄙举，纲纪罗网上下相应，焭焭忪忪当入其中。古今有是，痛哉可伤！」","佛语弥勒：「世间如是，佛皆哀之。以威神力摧灭众恶，悉令就善弃捐所思，奉持经戒、受行道法，无所违失，终得度世泥洹之道。」","佛言：「汝今诸天人民及后世人，得佛经语当熟思之，能于其中端心正行，主上为善、率化其下，转相勅令各自端守，尊圣敬善、仁慈博爱。佛语教诲无敢亏负，当求度世拔断生死众恶之本，永离三涂无量忧畏苦痛之道。汝等于是广殖德本，布恩施慧，勿犯道禁，忍辱、精进、一心、智慧转相教化。","「为德立善，正心正意，斋戒清净一日一夜，胜在无量寿国为善百岁。所以者何？彼佛国土无为自然，皆积众善，无毛发之恶，于此修善十日十夜，胜于他方诸佛国中为善千岁。所以者何？他方佛国为善者多、为恶者少，福德自然，无造恶之地。唯此间多恶无有自然，勤苦求欲转相欺殆，心劳形困饮苦食毒，如是怱务未甞宁息。吾哀汝等天人之类，苦心诲喻教令修善，随器开导授与经法，莫不承用，在意所愿皆令得道。佛所游履，国邑丘聚靡不蒙化，天下和顺，日月清明，风雨以时，灾厉不起，国丰民安，兵戈无用，崇德兴仁，务修礼让。」","佛言：「我哀愍汝等诸天人民，甚于父母念子。今吾于此世作佛，降化五恶、消除五痛、绝灭五烧，以善攻恶，拔生死之苦，令获五德，升无为之安。吾去世后经道渐灭，人民谄伪复为众恶，五烧、五痛还如前法，久后转剧不可悉说，我但为汝略言之耳。」","佛告弥勒：「汝等各善思之，转相教诫，如佛经法，无得犯也。」","于是，弥勒菩萨合掌白言：「佛所说甚善。世人实尔，如来普慈哀愍悉令度脱，受佛重诲不敢违失。」","佛告阿难：「汝起更整衣服，合掌恭敬，礼无量寿佛。十方国土诸佛如来，常共称扬赞叹彼佛，无著无阂。」","于是，阿难起整衣服，正身西向，恭敬合掌，五体投地礼无量寿佛。白言：「世尊！愿见彼佛安乐国土及诸菩萨声闻大众。」","说是语已，即时无量寿佛放大光明，普照一切诸佛世界，金刚围山、须弥山王、大小诸山，一切所有皆同一色。譬如劫水弥满世界，其中万物沉没不现，滉瀁浩汗唯见大水；彼佛光明亦复如是，声闻、菩萨一切光明皆悉隐蔽，唯见佛光明耀显赫。","尔时，阿难即见无量寿佛，威德巍巍如须弥山王，高出一切诸世界上，相好光明靡不照耀。此会四众一时悉见，彼见此土亦复如是。","尔时，佛告阿难及慈氏菩萨：「汝见彼国，从地已上至净居天，其中所有微妙严净自然之物，为悉见不？」","阿难对曰：「唯然，已见。」","「汝宁复闻无量寿佛大音宣布一切世界化众生不？」","阿难对曰：「唯然，已闻。」","「彼国人民乘百千由旬七宝宫殿无所障阂，遍至十方供养诸佛，汝复见不？」","对曰：「已见。」","「彼国人民有胎生者，汝复见不？」","对曰：「已见。」","「其胎生者所处宫殿，或百由旬或五百由旬，各于其中受诸快乐，如忉利天，亦皆自然。」","尔时，慈氏菩萨白佛言：「世尊！何因何缘彼国人民胎生化生？」","佛告慈氏：「若有众生以疑惑心修诸功德，愿生彼国，不了佛智、不思议智、不可称智、大乘广智、无等无伦最上胜智，于此诸智疑惑不信；然犹信罪福，修习善本，愿生其国。此诸众生生彼宫殿，寿五百岁，常不见佛、不闻经法、不见菩萨声闻圣众，是故于彼国土谓之胎生。若有众生明信佛智乃至胜智，作诸功德信心回向，此诸众生于七宝华中自然化生，加趺而坐，须臾之顷，身相光明，智慧功德如诸菩萨具足成就。","「复次，慈氏！他方诸大菩萨发心欲见无量寿佛，恭敬供养及诸菩萨声闻之众。彼菩萨等命终得生无量寿国，于七宝华中自然化生。弥勒当知，彼化生者智慧胜故。其胎生者皆无智慧，于五百岁中常不见佛、不闻经法、不见菩萨诸声闻众，无由供养于佛、不知菩萨法式、不得修习功德，当知此人宿世之时无有智慧，疑惑所致。」","佛告弥勒：「譬如转轮圣王别有宫室，七宝庄饰，张设床帐，悬诸缯幡。若有诸小王子得罪于王，辄内彼宫中，系以金锁，供给饮食、衣服、床蓐、华香、伎乐，如转轮王无所乏少。于意云何？此诸王子宁乐彼处不？」","对曰：「不也，但种种方便求诸大力欲自勉出。」","佛告弥勒：「此诸众生亦复如是。以疑惑佛智生彼宫殿，无有刑罚乃至一念恶事，但于五百岁中不见三宝，不得供养修诸善本。以此为苦，虽有余乐犹不乐彼处。若此众生识其本罪，深自悔责求离彼处，即得如意，往诣无量寿佛所恭敬供养，亦得遍至无量无数诸如来所修诸功德。弥勒当知，其有菩萨生疑惑者，为失大利。是故，应当明信诸佛无上智慧。」","弥勒菩萨白佛言：「世尊！于此世界有几所不退菩萨生彼佛国？」","佛告弥勒：「于此世界有六十七亿不退菩萨往生彼国。一一菩萨已曾供养无数诸佛，次如弥勒者也；诸小行菩萨及修习少功德者不可称计，皆当往生。」","佛告弥勒：「不但我刹诸菩萨等往生彼国，他方佛土亦复如是。其第一佛名曰远照，彼有百八十亿菩萨皆当往生。其第二佛名曰宝藏，彼有九十亿菩萨皆当往生。其第三佛名曰无量音，彼有二百二十亿菩萨皆当往生。其第四佛名曰甘露味，彼有二百五十亿菩萨皆当往生。其第五佛名曰龙胜，彼有十四亿菩萨皆当往生。其第六佛名曰胜力，彼有万四千菩萨皆当往生。其第七佛名曰师子，彼有五百亿菩萨皆当往生。其第八佛名曰离垢光，彼有八十亿菩萨皆当往生。其第九佛名曰德首，彼有六十亿菩萨皆当往生。其第十佛名曰妙德山，彼有六十亿菩萨皆当往生。其第十一佛名曰人王，彼有十亿菩萨皆当往生。其第十二佛名曰无上华，彼有无数不可称计诸菩萨众——皆不退转，智慧勇猛，已曾供养无量诸佛，于七日中即能摄取百千亿劫大士所修坚固之法——斯等菩萨皆当往生。其第十三佛名曰无畏，彼有七百九十亿大菩萨众、诸小菩萨及比丘等不可称计皆当往生。」","佛语弥勒：「不但此十四佛国中诸菩萨等当往生也，十方世界无量佛国其往生者亦复如是，甚多无数。我但说十方诸佛名号及菩萨、比丘生彼国者，昼夜一劫尚未能竟，我今为汝略说之耳。」","佛语弥勒：「其有得闻彼佛名号，欢喜踊跃，乃至一念，当知此人为得大利，则是具足无上功德。是故，弥勒！设有大火充满三千大千世界，要当过此。闻是经法，欢喜信乐，受持读诵，如说修行。所以者何？多有菩萨欲闻此经而不能得。若有众生闻此经者，于无上道终不退转，是故应当专心信受持诵说行。吾今为诸众生说此经法，令见无量寿佛及其国土一切所有，所当为者皆可求之，无得以我灭度之后复生疑惑。当来之世经道灭尽，我以慈悲哀愍特留此经止住百岁，其有众生值斯经者，随意所愿皆可得度。」","佛语弥勒：「如来兴世难值难见、诸佛经道难得难闻；菩萨胜法诸波罗蜜得闻亦难；遇善知识、闻法能行此亦为难；若闻斯经信乐受持，难中之难无过此难。是故我法，如是作、如是说、如是教，应当信顺，如法修行。」","尔时，世尊说此经法，无量众生皆发无上正觉之心，万二千那由他人得清净法眼，二十二亿诸天人民得阿那含，八十万比丘漏尽意解，四十亿菩萨得不退转，以弘誓功德而自庄严，于将来世当成正觉。尔时，三千大千世界六种震动，大光普照十方国土，百千音乐自然而作，无量妙华芬芬而降。","佛说经已，弥勒菩萨及十方来诸菩萨众，长老阿难、诸大声闻，一切大众，闻佛所说靡不欢喜。"],source:"https://cbetaonline.dila.edu.tw/zh/T12n0360",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T12/T12n0360.xml",sourceLabel:"CBETA T12n0360",scope:"全经正文",originalTitle:"佛說無量壽經",juan:[1,2]},{id:"cbeta-t12n0366",title:"佛说阿弥陀经",subtitle:"佛说阿弥陀经 · 姚秦 鸠摩罗什译",paragraphs:["如是我闻：","一时，佛在舍卫国祇树给孤独园，与大比丘僧千二百五十人俱，皆是大阿罗汉，众所知识。长老舍利弗、摩诃目干连、摩诃迦叶、摩诃迦栴延、摩诃拘𫄨罗、离婆多、周梨槃陀迦、难陀、阿难陀、罗睺罗、憍梵波提、宾头卢颇罗堕、迦留陀夷、摩诃劫宾那、薄俱罗、阿㝹楼驮，如是等诸大弟子，并诸菩萨摩诃萨——文殊师利法王子、阿逸多菩萨、干陀诃提菩萨、常精进菩萨——与如是等诸大菩萨，及释提桓因等无量诸天大众俱。","尔时，佛告长老舍利弗：","「从是西方过十万亿佛土，有世界名曰极乐。其土有佛，号阿弥陀，今现在说法。舍利弗！彼土何故名为极乐？其国众生无有众苦，但受诸乐，故名极乐。又舍利弗！极乐国土，七重栏楯、七重罗网、七重行树，皆是四宝周匝围绕，是故彼国名曰极乐。","「又舍利弗！极乐国土有七宝池，八功德水充满其中，池底纯以金沙布地。四边阶道，金、银、琉璃、颇梨合成；上有楼阁，亦以金、银、琉璃、颇梨、车𤦲、赤珠、马瑙而严饰之。池中莲花，大如车轮，青色青光，黄色黄光，赤色赤光，白色白光，微妙香洁。舍利弗！极乐国土成就如是功德庄严。","「又舍利弗！彼佛国土，常作天乐，黄金为地，昼夜六时，天雨曼陀罗华。其国众生，常以清旦，各以衣裓盛众妙华，供养他方十万亿佛；即以食时，还到本国，饭食经行。舍利弗！极乐国土成就如是功德庄严。","「复次舍利弗！彼国常有种种奇妙杂色之鸟——白鹄、孔雀、鹦鹉、舍利、迦陵频伽、共命之鸟。是诸众鸟，昼夜六时出和雅音，其音演畅五根、五力、七菩提分、八圣道分如是等法。其土众生闻是音已，皆悉念佛、念法、念僧。舍利弗！汝勿谓此鸟实是罪报所生。所以者何？彼佛国土无三恶趣。舍利弗！其佛国土尚无三恶道之名，何况有实？是诸众鸟，皆是阿弥陀佛欲令法音宣流，变化所作。舍利弗！彼佛国土微风吹动，诸宝行树及宝罗网出微妙音，譬如百千种乐同时俱作，闻是音者，皆自然生念佛、念法、念僧之心。舍利弗！其佛国土成就如是功德庄严。","「舍利弗！于汝意云何？彼佛何故号阿弥陀？舍利弗！彼佛光明无量，照十方国无所障碍，是故号为阿弥陀。又舍利弗！彼佛寿命及其人民，无量无边阿僧祇劫，故名阿弥陀。舍利弗！阿弥陀佛成佛已来，于今十劫。又舍利弗！彼佛有无量无边声闻弟子，皆阿罗汉，非是算数之所能知；诸菩萨，亦复如是。舍利弗！彼佛国土成就如是功德庄严。","「又舍利弗！极乐国土众生生者，皆是阿鞞跋致。其中多有一生补处，其数甚多，非是算数所能知之，但可以无量无边阿僧祇劫说。舍利弗！众生闻者，应当发愿，愿生彼国。所以者何？得与如是诸上善人俱会一处。","「舍利弗！不可以少善根福德因缘得生彼国。舍利弗！若有善男子、善女人，闻说阿弥陀佛，执持名号，若一日、若二日、若三日、若四日、若五日、若六日、若七日，一心不乱。其人临命终时，阿弥陀佛与诸圣众，现在其前。是人终时，心不颠倒，即得往生阿弥陀佛极乐国土。舍利弗！我见是利，故说此言。若有众生闻是说者，应当发愿生彼国土。","「舍利弗！如我今者，赞叹阿弥陀佛不可思议功德；东方亦有阿閦鞞佛、须弥相佛、大须弥佛、须弥光佛、妙音佛，如是等恒河沙数诸佛，各于其国出广长舌相，遍覆三千大千世界，说诚实言：『汝等众生，当信是称赞不可思议功德一切诸佛所护念经。』","「舍利弗！南方世界有日月灯佛、名闻光佛、大焰肩佛、须弥灯佛、无量精进佛，如是等恒河沙数诸佛，各于其国出广长舌相，遍覆三千大千世界，说诚实言：『汝等众生，当信是称赞不可思议功德一切诸佛所护念经。』","「舍利弗！西方世界有无量寿佛、无量相佛、无量幢佛、大光佛、大明佛、宝相佛、净光佛，如是等恒河沙数诸佛，各于其国出广长舌相，遍覆三千大千世界，说诚实言：『汝等众生，当信是称赞不可思议功德一切诸佛所护念经。』","「舍利弗！北方世界有焰肩佛、最胜音佛、难沮佛、日生佛、网明佛，如是等恒河沙数诸佛，各于其国出广长舌相，遍覆三千大千世界，说诚实言：『汝等众生，当信是称赞不可思议功德一切诸佛所护念经。』","「舍利弗！下方世界有师子佛、名闻佛、名光佛、达摩佛、法幢佛、持法佛，如是等恒河沙数诸佛，各于其国出广长舌相，遍覆三千大千世界，说诚实言：『汝等众生，当信是称赞不可思议功德一切诸佛所护念经。』","「舍利弗！上方世界有梵音佛、宿王佛、香上佛、香光佛、大焰肩佛、杂色宝华严身佛、娑罗树王佛、宝华德佛、见一切义佛、如须弥山佛，如是等恒河沙数诸佛，各于其国出广长舌相，遍覆三千大千世界，说诚实言：『汝等众生，当信是称赞不可思议功德一切诸佛所护念经。』","「舍利弗！于汝意云何？何故名为『一切诸佛所护念经』？舍利弗！若有善男子、善女人，闻是经受持者，及闻诸佛名者；是诸善男子、善女人，皆为一切诸佛共所护念，皆得不退转于阿耨多罗三藐三菩提。是故舍利弗！汝等皆当信受我语及诸佛所说。","「舍利弗！若有人已发愿、今发愿、当发愿，欲生阿弥陀佛国者；是诸人等，皆得不退转于阿耨多罗三藐三菩提，于彼国土若已生、若今生、若当生。是故舍利弗！诸善男子、善女人若有信者，应当发愿生彼国土。","「舍利弗！如我今者，称赞诸佛不可思议功德；彼诸佛等，亦称说我不可思议功德，而作是言：『释迦牟尼佛能为甚难希有之事，能于娑婆国土五浊恶世，劫浊、见浊、烦恼浊、众生浊、命浊中，得阿耨多罗三藐三菩提，为诸众生说是一切世间难信之法。』舍利弗！当知我于五浊恶世行此难事，得阿耨多罗三藐三菩提，为一切世间说此难信之法，是为甚难！」","佛说此经已，舍利弗及诸比丘，一切世间天、人、阿修罗等，闻佛所说，欢喜信受，作礼而去。"],source:"https://cbetaonline.dila.edu.tw/zh/T12n0366",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T12/T12n0366.xml",sourceLabel:"CBETA T12n0366",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說阿彌陀經",juan:[1]},{id:"cbeta-t12n0365",title:"佛说观无量寿佛经",subtitle:"佛说观无量寿佛经 · 宋 畺良耶舍译",paragraphs:["如是我闻：","一时，佛在王舍城耆阇崛山中，与大比丘众千二百五十人俱；菩萨三万二千，文殊师利法王子而为上首。尔时王舍大城有一太子，名阿阇世，随顺调达恶友之教，收执父王频婆娑罗，幽闭置于七重室内，制诸群臣，一不得往。国大夫人，名韦提希，恭敬大王，澡浴清净，以酥蜜和𪎊，用涂其身，诸璎珞中盛葡萄浆，密以上王。尔时大王，食𪎊饮浆，求水漱口；漱口毕已，合掌恭敬，向耆阇崛山，遥礼世尊，而作是言：「大目干连是吾亲友，愿兴慈悲，授我八戒。」时目干连如鹰隼飞，疾至王所；日日如是，授王八戒。世尊亦遣尊者富楼那，为王说法。如是时间经三七日，王食𪎊蜜得闻法故，颜色和悦。","时阿阇世问守门人：「父王今者犹存在耶？」时守门者白言：「大王！国大夫人身涂𪎊蜜，璎珞盛浆，持用上王；沙门目连及富楼那，从空而来，为王说法，不可禁制。」时阿阇世闻此语已，怒其母曰：「我母是贼，与贼为伴；沙门恶人，幻惑呪术，令此恶王多日不死。」即执利剑欲害其母。","时有一臣，名曰月光，聪明多智，及与耆婆，为王作礼。白言：「大王！臣闻毘陀论经说：『劫初已来，有诸恶王贪国位故，杀害其父一万八千。』未曾闻有无道害母。王今为此杀逆之事，污刹利种，臣不忍闻！是栴陀罗，我等不宜复住于此。」时二大臣说此语竟，以手按剑，却行而退。时阿阇世惊怖惶惧，告耆婆言：「汝不为我耶？」耆婆白言：「大王！慎莫害母。」王闻此语，忏悔求救，即便舍剑，止不害母，勅语内官：「闭置深宫，不令复出。」","时韦提希被幽闭已，愁忧憔悴；遥向耆阇崛山，为佛作礼，而作是言：「如来世尊在昔之时，恒遣阿难来慰问我；我今愁忧，世尊威重，无由得见；愿遣目连、尊者阿难，与我相见。」作是语已，悲泣雨泪，遥向佛礼。未举头顷，尔时世尊在耆阇崛山，知韦提希心之所念，即勅大目揵连及以阿难，从空而来。佛从耆阇崛山没，于王宫出。","时韦提希礼已举头，见世尊释迦牟尼佛，身紫金色坐百宝莲华。目连侍左，阿难在右，释梵护世诸天在虚空中，普雨天华，持用供养。时韦提希见佛世尊，自绝璎珞，举身投地，号泣向佛。白言：「世尊！我宿何罪，生此恶子？世尊复有何等因缘，与提婆达多共为眷属？唯愿世尊，为我广说无忧恼处，我当往生，不乐阎浮提浊恶世也。此浊恶处，地狱、饿鬼、畜生盈满，多不善聚。愿我未来不闻恶声，不见恶人。今向世尊五体投地，求哀忏悔。唯愿佛日教我观于清净业处。」","尔时世尊放眉间光，其光金色，遍照十方无量世界；还住佛顶，化为金台，如须弥山。十方诸佛净妙国土，皆于中现。或有国土七宝合成；复有国土纯是莲花；复有国土如自在天宫；复有国土如颇梨镜；十方国土皆于中现。有如是等无量诸佛国土严显可观，令韦提希见。","时韦提希白佛言：「世尊！是诸佛土，虽复清净，皆有光明；我今乐生极乐世界阿弥陀佛所。唯愿世尊，教我思惟，教我正受。」","尔时世尊即便微笑，有五色光，从佛口出，一一光照频婆娑罗王顶。尔时大王虽在幽闭，心眼无障，遥见世尊，头面作礼；自然增进，成阿那含。","尔时世尊告韦提希：「汝今知不？阿弥陀佛去此不远；汝当系念，谛观彼国净业成者。我今为汝广说众譬，亦令未来世一切凡夫欲修净业者，得生西方极乐国土。欲生彼国者，当修三福：一者、孝养父母，奉事师长，慈心不杀，修十善业。二者、受持三归，具足众戒，不犯威仪。三者、发菩提心，深信因果，读诵大乘，劝进行者。如此三事名为净业。」","佛告韦提希：「汝今知不？此三种业，乃是过去、未来、现在三世诸佛净业正因。」","佛告阿难及韦提希：「谛听，谛听！善思念之。如来今者，为未来世一切众生为烦恼贼之所害者，说清净业。善哉韦提希！快问此事。阿难！汝当受持，广为多众宣说佛语。如来今者，教韦提希及未来世一切众生观于西方极乐世界。以佛力故，当得见彼清净国土，如执明镜自见面像。见彼国土极妙乐事，心欢喜故，应时即得无生法忍。」","佛告韦提希：「汝是凡夫，心想羸劣，未得天眼，不能远观；诸佛如来有异方便，令汝得见。」","时韦提希白佛言：「世尊！如我今者，以佛力故见彼国土。若佛灭后，诸众生等，浊恶不善，五苦所逼，云何当见阿弥陀佛极乐世界？」","佛告韦提希：「汝及众生应当专心，系念一处，想于西方。云何作想？凡作想者，一切众生自非生盲，有目之徒，皆见日没。当起想念，正坐西向，谛观于日，令心坚住，专想不移。见日欲没，状如悬鼓。既见日已，闭目开目皆令明了。是为日想，名曰初观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「初观成已，次作水想。想见西方一切皆是大水，见水澄清，亦令明了，无分散意。既见水已，当起氷想。见氷映彻，作琉璃想。此想成已，见琉璃地，内外映彻。下有金刚七宝金幢，擎琉璃地。其幢八方，八楞具足，一一方面，百宝所成，一一宝珠，有千光明，一一光明，八万四千色，映琉璃地，如亿千日，不可具见。琉璃地上，以黄金绳，杂厕间错，以七宝界，分齐分明，一一宝中，有五百色光。其光如花，又似星月，悬处虚空，成光明台。楼阁千万，百宝合成，于台两边，各有百亿花幢，无量乐器，以为庄严。八种清风从光明出，鼓此乐器，演说苦、空、无常、无我之音，是为水想，名第二观。此想成时，一一观之，极令了了。闭目开目，不令散失，唯除食时，恒忆此事。作此观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「水想成已，名为粗见极乐国地。若得三昧，见彼国地，了了分明，不可具说。是为地想，名第三观。」","佛告阿难：「汝持佛语，为未来世一切大众欲脱苦者，说是观地法。若观是地者，除八十亿劫生死之罪。舍身他世，必生净国，心得无疑。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「地想成已，次观宝树。观宝树者，一一观之，作七重行树想。一一树高八千由旬，其诸宝树，七宝花叶无不具足。一一华叶，作异宝色。琉璃色中出金色光；颇梨色中出红色光；马脑色中出车𤦲光；车𤦲色中出绿真珠光；珊瑚琥珀一切众宝以为映饰。妙真珠网弥覆树上，一一树上有七重网，一一网间有五百亿妙华宫殿，如梵王宫。诸天童子自然在中，一一童子有五百亿释迦毘楞伽摩尼宝以为璎珞；其摩尼光照百由旬，犹如和合百亿日月，不可具名，众宝间错色中上者。此诸宝树，行行相当，叶叶相次，于众叶间生诸妙花，花上自然有七宝果。一一树叶，纵广正等二十五由旬；其叶千色有百种画，如天缨珞；有众妙华，作阎浮檀金色；如旋火轮，宛转叶间，踊生诸果，如帝释瓶；有大光明，化成幢幡无量宝盖。是宝盖中，映现三千大千世界一切佛事；十方佛国亦于中现。见此树已，亦当次第一一观之，观见树茎、枝叶、华果，皆令分明。是为树想，名第四观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「树想成已，次当想水。欲想水者，极乐国土有八池水。一一池水七宝所成；其宝柔软从如意珠王生，分为十四支；一一支作七宝色。黄金为渠，渠下皆以杂色金刚以为底沙。一一水中有六十亿七宝莲花，一一莲华团圆正等十二由旬。其摩尼水流注华间，寻树上下。其声微妙，演说苦、空、无常、无我、诸波罗蜜，复有赞叹诸佛相好者。从如意珠王踊出金色微妙光明，其光化为百宝色鸟，和鸣哀雅，常赞念佛、念法、念僧，是为八功德水想，名第五观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「众宝国土，一一界上有五百亿宝楼，其楼阁中有无量诸天，作天伎乐。又有乐器悬处虚空，如天宝幢不鼓自鸣。此众音中，皆说念佛、念法、念比丘僧。此想成已，名为粗见极乐世界宝树、宝地、宝池，是为总观想，名第六观。若见此者，除无量亿劫极重恶业，命终之后必生彼国。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「谛听，谛听！善思念之。吾当为汝分别解说除苦恼法，汝等忆持，广为大众分别解说。」说是语时，无量寿佛住立空中，观世音、大势至，是二大士侍立左右。光明炽盛不可具见，百千阎浮檀金色不可为比。","时韦提希见无量寿佛已，接足作礼，白佛言：「世尊！我今因佛力故，得见无量寿佛及二菩萨，未来众生，当云何观无量寿佛及二菩萨？」","佛告韦提希：「欲观彼佛者，当起想念，于七宝地上作莲花想，令其莲花一一叶作百宝色。有八万四千脉，犹如天画；一一脉有八万四千光，了了分明，皆令得见。华叶小者，纵广二百五十由旬；如是莲华有八万四千大叶，一一叶间，有百亿摩尼珠王以为映饰。一一摩尼珠放千光明，其光如盖，七宝合成，遍覆地上。释迦毘楞伽摩尼宝以为其台；此莲花台，八万金刚甄叔迦宝，梵摩尼宝，妙真珠网，以为交饰。于其台上，自然而有四柱宝幢，一一宝幢如百千万亿须弥山；幢上宝缦如夜摩天宫，复有五百亿微妙宝珠，以为映饰。一一宝珠有八万四千光，一一光作八万四千异种金色，一一金色遍其宝土，处处变化，各作异相；或为金刚台，或作真珠网，或作杂花云，于十方面随意变现，施作佛事，是为花座想，名第七观。」","佛告阿难：「如此妙花，是本法藏比丘愿力所成，若欲念彼佛者，当先作此妙花座想。作此想时不得杂观；皆应一一观之，一一叶，一一珠，一一光，一一台，一一幢，皆令分明，如于镜中自见面像。此想成者，灭除五百亿劫生死之罪，必定当生极乐世界。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「见此事已，次当想佛。所以者何？诸佛如来是法界身，遍入一切众生心想中；是故汝等心想佛时，是心即是三十二相、八十随形好。是心作佛，是心是佛。诸佛正遍知海，从心想生，是故应当一心系念，谛观彼佛、多陀阿伽度、阿罗呵、三藐三佛陀。想彼佛者，先当想像。闭目开目，见一宝像，如阎浮檀金色，坐彼华上。像既坐已，心眼得开，了了分明，见极乐国七宝庄严，宝地、宝池、宝树行列，诸天宝缦弥覆树上，众宝罗网满虚空中。见如此事，极令明了，如观掌中。见此事已，复当更作一大莲华在佛左边，如前莲华等无有异。复作一大莲华在佛右边，想一观世音菩萨像坐左华座，亦放金光如前无异。想一大势至菩萨像坐右华座。此想成时，佛菩萨像皆放妙光；其光金色，照诸宝树。一一树下亦有三莲华，诸莲华上各有一佛二菩萨像，遍满彼国。此想成时，行者当闻水流、光明及诸宝树、凫鴈、鸳鸯皆说妙法。出定、入定恒闻妙法。行者所闻，出定之时忆持不舍，令与修多罗合。若不合者，名为妄想，若与合者，名为麁想见极乐世界。是为想像，名第八观。作是观者，除无量亿劫生死之罪，于现身中得念佛三昧。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「此想成已，次当更观无量寿佛身相光明。阿难当知！无量寿佛身，如百千万亿夜摩天阎浮檀金色。佛身高六十万亿那由他恒河沙由旬；眉间白毫右旋宛转，如五须弥山。佛眼清净如四大海水，清白分明。身诸毛孔演出光明，如须弥山。彼佛圆光如百亿三千大千世界；于圆光中，有百万亿那由他恒河沙化佛；一一化佛，亦有众多无数化菩萨，以为侍者。无量寿佛有八万四千相；一一相中，各有八万四千随形好；一一好中复有八万四千光明；一一光明遍照十方世界，念佛众生摄取不舍。其光相好及与化佛，不可具说；但当忆想令心明见。见此事者，即见十方一切诸佛，以见诸佛故名念佛三昧。作是观者，名观一切佛身，以观佛身故亦见佛心。诸佛心者大慈悲是，以无缘慈摄诸众生。作此观者，舍身他世，生诸佛前，得无生忍。是故智者应当系心谛观无量寿佛。观无量寿佛者，从一相好入，但观眉间白毫，极令明了。见眉间白毫相者，八万四千相好自然当见。见无量寿佛者，即见十方无量诸佛；得见无量诸佛故，诸佛现前受记。是为遍观一切色想，名第九观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「见无量寿佛了了分明已，次亦应观观世音菩萨。此菩萨身长八十亿那由他恒河沙由旬，身紫金色，顶有肉髻，项有圆光，面各百千由旬。其圆光中有五百化佛，如释迦牟尼。一一化佛，有五百菩萨，无量诸天，以为侍者。举身光中五道众生，一切色相皆于中现。顶上毘楞伽摩尼妙宝，以为天冠。其天冠中有一立化佛，高二十五由旬。观世音菩萨面如阎浮檀金色；眉间毫相备七宝色，流出八万四千种光明；一一光明，有无量无数百千化佛；一一化佛，无数化菩萨以为侍者，变现自在满十方界。臂如红莲花色，有八十亿微妙光明，以为璎珞；其璎珞中，普现一切诸庄严事。手掌作五百亿杂莲华色；手十指端，一一指端有八万四千画，犹如印文。一一画有八万四千色；一一色有八万四千光，其光柔软普照一切，以此宝手接引众生。举足时，足下有千辐轮相，自然化成五百亿光明台。下足时，有金刚摩尼花，布散一切莫不弥满。其余身相，众好具足，如佛无异，唯顶上肉髻及无见顶相，不及世尊。是为观观世音菩萨真实色身相，名第十观。」","佛告阿难：「若欲观观世音菩萨当作是观。作是观者不遇诸祸，净除业障，除无数劫生死之罪。如此菩萨，但闻其名，获无量福，何况谛观！若有欲观观世音菩萨者，当先观顶上肉髻，次观天冠。其余众相亦次第观之，悉令明了，如观掌中。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「次观大势至菩萨。此菩萨身量大小亦如观世音，圆光面各二百二十五由旬，照二百五十由旬。举身光明照十方国，作紫金色。有缘众生皆悉得见。但见此菩萨一毛孔光，即见十方无量诸佛净妙光明，是故号此菩萨名无边光。以智慧光普照一切，令离三涂，得无上力，是故号此菩萨名大势至。此菩萨天冠有五百宝莲华；一一宝华有五百宝台。一一台中，十方诸佛净妙国土广长之相，皆于中现。顶上肉髻如钵头摩花。于肉髻上有一宝瓶，盛诸光明，普现佛事。余诸身相如观世音，等无有异。此菩萨行时，十方世界一切震动，当地动处各有五百亿宝花。一一宝花庄严高显，如极乐世界。此菩萨坐时，七宝国土一时动摇。从下方金光佛刹，乃至上方光明王佛刹，于其中间无量尘数分身无量寿佛，分身观世音、大势至，皆悉云集极乐国土，侧塞空中坐莲华座，演说妙法，度苦众生。作此观者，名为观见大势至菩萨；是为观大势至色身相。观此菩萨者名第十一观，除无数劫阿僧祇生死之罪；作是观者不处胞胎，常游诸佛净妙国土。此观成已，名为具足观观世音及大势至。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「见此事时当起想作心，自见生于西方极乐世界，于莲华中结跏趺坐，作莲华合想，作莲华开想。莲华开时，有五百色光来照身想；眼目开想，见佛菩萨满虚空中，水、鸟、树林及与诸佛，所出音声，皆演妙法，与十二部经合。若出定时忆持不失。见此事已，名见无量寿佛极乐世界。是为普观想，名第十二观。无量寿佛化身无数，与观世音及大势至，常来至此行人之所。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「若欲至心生西方者，先当观于一丈六像在池水上。如先所说，无量寿佛身量无边，非是凡夫心力所及。然彼如来宿愿力故，有忆想者必得成就。但想佛像得无量福，况复观佛具足身相！阿弥陀佛神通如意，于十方国变现自在。或现大身满虚空中；或现小身丈六八尺。所现之形皆真金色，圆光化佛及宝莲花，如上所说。观世音菩萨及大势至，于一切处身同众生，但观首相，知是观世音，知是大势至，此二菩萨助阿弥陀佛，普化一切。是为杂想观，名第十三观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「凡生西方有九品人。上品上生者，若有众生愿生彼国者，发三种心，即便往生。何等为三？一者、至诚心。二者、深心。三者、回向发愿心。具三心者必生彼国。复有三种众生，当得往生。何等为三？一者、慈心不杀，具诸戒行。二者、读诵大乘方等经典。三者、修行六念，回向发愿生彼佛国。具此功德，一日乃至七日，即得往生。生彼国时，此人精进勇猛故，阿弥陀如来与观世音及大势至，无数化佛，百千比丘，声闻大众，无量诸天，七宝宫殿，观世音菩萨执金刚台，与大势至菩萨至行者前。阿弥陀佛放大光明，照行者身，与诸菩萨授手迎接。观世音、大势至与无数菩萨，赞叹行者，劝进其心。行者见已，欢喜踊跃。自见其身乘金刚台，随从佛后，如弹指顷，往生彼国。生彼国已，见佛色身众相具足，见诸菩萨色相具足。光明宝林，演说妙法。闻已即悟无生法忍。经须臾间历事诸佛，遍十方界，于诸佛前次第受记。还至本国，得无量百千陀罗尼门，是名上品上生者。","「上品中生者，不必受持读诵方等经典。善解义趣，于第一义心不惊动，深信因果，不谤大乘；以此功德，回向愿求生极乐国。行此行者命欲终时，阿弥陀佛与观世音及大势至，无量大众，眷属围绕，持紫金台至行者前，赞言：『法子！汝行大乘，解第一义，是故我今来迎接汝。』与千化佛一时授手。行者自见坐紫金台，合掌叉手，赞叹诸佛，如一念顷，即生彼国七宝池中。此紫金台如大宝花，经宿即开。行者身作紫磨金色，足下亦有七宝莲华。佛及菩萨俱放光明，照行者身，目即开明。因前宿习，普闻众声，纯说甚深第一义谛。即下金台，礼佛合掌赞叹世尊。经于七日，应时即于阿耨多罗三藐三菩提，得不退转。应时即能飞至十方，历事诸佛，于诸佛所修诸三昧。经一小劫得无生法忍，现前受记，是名上品中生者。","「上品下生者，亦信因果，不谤大乘，但发无上道心，以此功德，回向愿求生极乐国。彼行者命欲终时，阿弥陀佛及观世音并大势至，与诸眷属持金莲华，化作五百化佛，来迎此人。五百化佛一时授手，赞言：『法子！汝今清净，发无上道心，我来迎汝。』见此事时，即自见身坐金莲花。坐已华合，随世尊后，即得往生七宝池中。一日一夜莲花乃开，七日之中乃得见佛。虽见佛身，于众相好心不明了，于三七日后乃了了见。闻众音声，皆演妙法。游历十方，供养诸佛。于诸佛前闻甚深法，经三小劫得百法明门，住欢喜地。是名上品下生者。是名上辈生想，名第十四观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「中品上生者，若有众生受持五戒，持八戒斋，修行诸戒，不造五逆，无众过恶；以此善根，回向愿求生于西方极乐世界。行者临命终时，阿弥陀佛与诸比丘，眷属围绕，放金色光至其人所，演说苦、空、无常、无我，赞叹出家得离众苦。行者见已，心大欢喜。自见己身坐莲花台，长跪合掌为佛作礼。未举头顷即得往生极乐世界，莲花寻开。当华敷时，闻众音声赞叹四谛，应时即得阿罗汉道，三明、六通、具八解脱；是名中品上生者。","「中品中生者，若有众生，若一日一夜持八戒斋，若一日一夜持沙弥戒，若一日一夜持具足戒，威仪无缺。以此功德，回向愿求生极乐国。戒香薰修，如此行者命欲终时，见阿弥陀佛与诸眷属放金色光，持七宝莲花至行者前，行者自闻空中有声，赞言：『善男子！如汝善人，随顺三世诸佛教故，我来迎汝。』行者自见坐莲花上，莲花即合，生于西方极乐世界。在宝池中，经于七日莲花乃敷。花既敷已，开目合掌，赞叹世尊。闻法欢喜，得须陀洹，经半劫已成阿罗汉；是名中品中生者。","「中品下生者，若有善男子、善女人，孝养父母，行世仁义，此人命欲终时，遇善知识为其广说阿弥陀佛国土乐事，亦说法藏比丘四十八大愿。闻此事已，寻即命终。譬如壮士屈伸臂顷，即生西方极乐世界。生经七日，遇观世音及大势至，闻法欢喜得须陀洹。过一小劫，成阿罗汉。是名中品下生者。是名中辈生想，名第十五观。作是观者，名为正观。若他观者，名为邪观。」","佛告阿难及韦提希：「下品上生者，或有众生作众恶业，虽不诽谤方等经典，如此愚人，多造恶法，无有惭愧，命欲终时遇善知识，为赞大乘十二部经首题名字。以闻如是诸经名故，除却千劫极重恶业。智者复教合掌叉手，称南无阿弥陀佛。称佛名故，除五十亿劫生死之罪。尔时彼佛，即遣化佛，化观世音，化大势至，至行者前，赞言：『善哉！善男子！汝称佛名故诸罪消灭，我来迎汝。』作是语已，行者即见化佛光明，遍满其室，见已欢喜，即便命终。乘宝莲花，随化佛后，生宝池中，经七七日莲花乃敷。当花敷时，大悲观世音菩萨，及大势至菩萨，放大光明，住其人前，为说甚深十二部经。闻已信解，发无上道心。经十小劫，具百法明门，得入初地；是名下品上生者；得闻佛名、法名及闻僧名，闻三宝名即得往生。」","佛告阿难及韦提希：「下品中生者，或有众生，毁犯五戒、八戒及具足戒，如此愚人，偷僧祇物，盗现前僧物，不净说法，无有惭愧，以诸恶法而自庄严。如此罪人，以恶业故应堕地狱。命欲终时，地狱众火一时俱至，遇善知识以大慈悲，即为赞说阿弥陀佛十力威德，广赞彼佛光明神力，亦赞戒、定、慧、解脱、解脱知见。此人闻已，除八十亿劫生死之罪。地狱猛火化为凉风，吹诸天华。华上皆有化佛菩萨，迎接此人。如一念顷，即得往生七宝池中莲花之内，经于六劫，莲花乃敷。当华敷时，观世音、大势至，以梵音声安慰彼人，为说大乘甚深经典。闻此法已，应时即发无上道心。是名下品中生者。」","佛告阿难及韦提希：「下品下生者，或有众生作不善业，五逆、十恶，具诸不善。如此愚人以恶业故，应堕恶道，经历多劫，受苦无穷。如此愚人临命终时，遇善知识，种种安慰，为说妙法，教令念佛，彼人苦逼不遑念佛。善友告言：『汝若不能念彼佛者，应称归命无量寿佛。』如是至心令声不绝，具足十念，称南无阿弥陀佛。称佛名故，于念念中，除八十亿劫生死之罪。命终之时见金莲花，犹如日轮，住其人前，如一念顷，即得往生极乐世界。于莲花中满十二大劫，莲花方开。当花敷时，观世音、大势至以大悲音声，即为其人广说实相，除灭罪法。闻已欢喜，应时即发菩提之心；是名下品下生者。是名下辈生想，名第十六观。」","尔时世尊说是语时，韦提希与五百侍女，闻佛所说，应时即见极乐世界广长之相，得见佛身及二菩萨。心生欢喜，叹未曾有，豁然大悟，得无生忍。五百侍女发阿耨多罗三藐三菩提心，愿生彼国。世尊悉记，皆当往生，生彼国已，获得诸佛现前三昧。无量诸天，发无上道心。","尔时阿难，即从座起，前白佛言：「世尊！当何名此经？此法之要，当云何受持？」佛告阿难：「此经名『观极乐国土无量寿佛观世音菩萨大势至菩萨』，亦名『净除业障生诸佛前』。汝当受持，无令忘失！行此三昧者，现身得见无量寿佛及二大士。若善男子及善女人，但闻佛名、二菩萨名，除无量劫生死之罪，何况忆念！若念佛者，当知此人即是人中芬陀利花，观世音菩萨、大势至菩萨为其胜友，当坐道场，生诸佛家。」","佛告阿难：「汝好持是语。持是语者，即是持无量寿佛名。」","佛说此语时，尊者目连、尊者阿难及韦提希等，闻佛所说，皆大欢喜。","尔时世尊，足步虚空，还耆阇崛山。尔时，阿难广为大众说如上事。无量人、天、龙、神、夜叉，闻佛所说，皆大欢喜，礼佛而退。"],source:"https://cbetaonline.dila.edu.tw/zh/T12n0365",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T12/T12n0365.xml",sourceLabel:"CBETA T12n0365",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說觀無量壽佛經",juan:[1]},{id:"cbeta-t13n0412",title:"地藏菩萨本愿经",subtitle:"地藏菩萨本愿经 · 唐 实叉难陀译",paragraphs:["忉利天宫神通品第一","如是我闻：","一时，佛在忉利天，为母说法。尔时，十方无量世界，不可说不可说一切诸佛，及大菩萨摩诃萨，皆来集会。赞叹释迦牟尼佛，能于五浊恶世，现不可思议大智慧神通之力，调伏刚彊众生，知苦乐法，各遣侍者，问讯世尊。是时，如来含笑，放百千万亿大光明云——所谓大圆满光明云、大慈悲光明云、大智慧光明云、大般若光明云、大三昧光明云、大吉祥光明云、大福德光明云、大功德光明云、大归依光明云、大赞叹光明云。放如是等不可说光明云已，又出种种微妙之音——所谓檀波罗蜜音、尸波罗蜜音、羼提波罗蜜音、毘离耶波罗蜜音、禅波罗蜜音、般若波罗蜜音、慈悲音、喜舍音、解脱音、无漏音、智慧音、大智慧音、师子吼音、大师子吼音、云雷音、大云雷音。","出如是等不可说不可说音已，娑婆世界及他方国土，有无量亿天龙鬼神，亦集到忉利天宫。所谓四天王天、忉利天、须焰摩天、兜率陀天、化乐天、他化自在天、梵众天、梵辅天、大梵天、少光天、无量光天、光音天、少净天、无量净天、遍净天、福生天、福爱天、广果天、无想天、无烦天、无热天、善见天、善现天、色究竟天、摩醯首罗天，乃至非想非非想处天，一切天众、龙众、鬼神等众，悉来集会。","复有他方国土，及娑婆世界海神、江神、河神、树神、山神、地神、川泽神、苗稼神、昼神、夜神、空神、天神、饮食神、草木神，如是等神，皆来集会。","复有他方国土，及娑婆世界诸大鬼王——所谓恶目鬼王、噉血鬼王、噉精气鬼王、噉胎卵鬼王、行病鬼王、摄毒鬼王、慈心鬼王、福利鬼王、大爱敬鬼王，如是等鬼王，皆来集会。","尔时，释迦牟尼佛告文殊师利法王子菩萨摩诃萨：「汝观是一切诸佛菩萨，及天龙鬼神，此世界，他世界，此国土，他国土，如是今来集会，到忉利天者，汝知数不？」","文殊师利白佛言：「世尊！若以我神力，千劫测度，不能得知。」","佛告文殊师利：「吾以佛眼观故，犹不尽数。此皆是地藏菩萨久远劫来，已度、当度、未度，已成就、当成就、未成就。」","文殊师利白佛言：「世尊！我已过去久修善根，证无碍智，闻佛所言，即当信受。小果声闻、天龙八部，及未来世诸众生等，虽闻如来诚实之语，必怀疑惑，设使顶受，未免兴谤。唯愿世尊，广说地藏菩萨摩诃萨因地作何行、立何愿，而能成就不思议事？」","佛告文殊师利：「譬如三千大千世界，所有草木丛林，稻麻竹苇，山石微尘，一物一数，作一恒河，一恒河沙，一沙一界。一界之内，一尘一劫，一劫之内，所积尘数，尽充为劫。地藏菩萨证十地果位已来，千倍多于上喻。何况地藏菩萨在声闻、辟支佛地。文殊师利！此菩萨威神誓愿，不可思议。若未来世，有善男子、善女人，闻是菩萨名字，或赞叹，或瞻礼，或称名，或供养，乃至彩画、刻镂、塑漆形像，是人当得百返生于三十三天，永不堕恶道。","「文殊师利！是地藏菩萨摩诃萨，于过去久远不可说不可说劫前，身为大长者子。时世有佛，号曰师子奋迅具足万行如来。时长者子，见佛相好，千福庄严，因问彼佛：『作何行愿，而得此相？』时师子奋迅具足万行如来告长者子：『欲证此身，当须久远度脱一切受苦众生。』","「文殊师利！时长者子，因发愿言：『我今尽未来际不可计劫，为是罪苦六道众生，广设方便，尽令解脱，而我自身，方成佛道。』以是于彼佛前，立斯大愿，于今百千万亿那由他不可说劫，尚为菩萨。","「又于过去，不可思议阿僧祇劫，时世有佛，号曰觉华定自在王如来。彼佛寿命，四百千万亿阿僧祇劫。像法之中，有一婆罗门女，宿福深厚，众所钦敬；行住坐卧，诸天卫护。其母信邪，常轻三宝。是时圣女，广说方便，劝诱其母，令生正见。而此女母，未全生信，不久命终，魂神堕在无间地狱。时婆罗门女，知母在世不信因果，计当随业，必生恶趣。遂卖家宅，广求香华，及诸供具，于先佛塔寺，大兴供养。见觉华定自在王如来，其形像在一寺中，塑画威容，端严毕备。时婆罗门女，瞻礼尊容，倍生敬仰。私自念言：『佛名大觉，具一切智，若在世时，我母死后，傥来问佛，必知处所。』时婆罗门女，垂泣良久，瞻恋如来。忽闻空中声曰：『泣者圣女！勿至悲哀，我今示汝母之去处。』婆罗门女合掌向空，而白空曰：『是何神德，宽我忧虑。我自失母已来，昼夜忆恋，无处可问知母生界。』时空中有声，再报女曰：『我是汝所瞻礼者，过去觉华定自在王如来。见汝忆母，倍于常情众生之分，故来告示。』婆罗门女闻此声已，举身自扑，支节皆损。左右扶侍，良久方稣，而白空曰：『愿佛慈愍，速说我母生界。我今身心，将死不久。』时觉华定自在王如来告圣女曰：『汝供养毕，但早返舍。端坐思惟吾之名号，即当知母所生去处。』","「时婆罗门女，寻礼佛已，即归其舍。以忆母故，端坐念觉华定自在王如来，经一日一夜。忽见自身，到一海边。其水涌沸，多诸恶兽，尽复铁身，飞走海上，东西驰逐。见诸男子女人，百千万数，出没海中，被诸恶兽争取食噉。又见夜叉，其形各异，或多手多眼，多足多头，口牙外出，利刃如剑，驱诸辠人，使近恶兽，复自搏攫，头足相就。其形万类，不敢久视。时婆罗门女，以念佛力故，自然无惧。","「有一鬼王，名曰无毒，稽首来迎，白圣女曰：『善哉！菩萨何缘来此？』时婆罗门女问鬼王曰：『此是何处？』无毒答曰：『此是大铁围山西面第一重海。』圣女问曰：『我闻铁围之内，地狱在中，是事实不？』无毒答曰：『实有地狱。』圣女问曰：『我今云何，得到狱所？』无毒答曰：『若非威神，即须业力，非此二事，终不能到。』圣女又问：『此水何缘，而乃涌沸？多诸罪人，及以恶兽？』无毒答曰：『此是阎浮提造恶众生新死之者，经四十九日后，无人继嗣为作功德，救拔苦难，生时又无善因，当据本业所感地狱，自然先渡此海。海东十万由旬，又有一海，其苦倍此。彼海之东，又有一海，其苦复倍。三业恶因之所招感，共号业海，其处是也。』圣女又问鬼王无毒曰：『地狱何在？』无毒答曰：『三海之内，是大地狱，其数百千，各各差别。所谓大者，具有十八。次有五百，苦毒无量。次有千百，亦无量苦。』圣女又问大鬼王曰：『我母死来未久，不知魂神当至何趣？』鬼王问圣女曰：『菩萨之母，在生习何行业？』圣女答曰：『我母邪见，讥毁三宝。设或暂信，旋又不敬。死虽日浅，未知生处。』无毒问曰：『菩萨之母，姓氏何等？』圣女答曰：『我父我母，俱婆罗门种。父号尸罗善现，母号悦帝利。』无毒合掌，启菩萨曰：『愿圣者却返本处，无至忧忆悲恋。悦帝利罪女，生天以来，经今三日。云承孝顺之子，为母设供、修福，布施觉华定自在王如来塔寺。非唯菩萨之母得脱地狱，应是无间罪人，此日悉得受乐，俱同生讫。』鬼王言毕，合掌而退。婆罗门女，寻如梦归。悟此事已，便于觉华定自在王如来塔像之前，立弘誓愿：『愿我尽未来劫，应有罪苦众生，广设方便，使令解脱。』」","佛告文殊师利：「时鬼王无毒者，当今财首菩萨是。婆罗门女者，即地藏菩萨是。」","分身集会品第二","尔时，百千万亿不可思、不可议、不可量、不可说、无量阿僧祇世界，所有地狱处，分身地藏菩萨，俱来集在忉利天宫。以如来神力故，各以方面，与诸得解脱从业道出者，亦各有千万亿那由他数，共持香华，来供养佛。彼诸同来等辈，皆因地藏菩萨教化，永不退转于阿耨多罗三藐三菩提。是诸众等，久远劫来，流浪生死，六道受苦，暂无休息。以地藏菩萨广大慈悲，深誓愿故，各获果证。既至忉利，心怀踊跃，瞻仰如来，目不暂舍。","尔时，世尊舒金色臂，摩百千万亿不可思、不可议、不可量、不可说、无量阿僧祇世界诸分身地藏菩萨摩诃萨顶，而作是言：「吾于五浊恶世，教化如是刚彊众生，令心调伏，舍邪归正。十有一二，尚恶习在。吾亦分身千百亿，广设方便。或有利根，闻即信受。或有善果，勤劝成就。或有暗钝，久化方归。或有业重，不生敬仰。如是等辈众生，各各差别，分身度脱。或现男子身，或现女人身，或现天龙身，或现神鬼身，或现山林川原、河池泉井，利及于人，悉皆度脱。或现天帝身，或现梵王身，或现转轮王身，或现居士身，或现国王身，或现宰辅身，或现官属身，或现比丘、比丘尼、优婆塞、优婆夷身，乃至声闻、罗汉、辟支佛、菩萨等身，而以化度。非但佛身，独现其前。汝观吾累劫勤苦，度脱如是等难化刚彊罪苦众生。其有未调伏者，随业报应。若堕恶趣，受大苦时，汝当忆念吾在忉利天宫，殷勤付嘱。令娑婆世界，至弥勒出世已来众生，悉使解脱，永离诸苦，遇佛授记。」","尔时，诸世界分身地藏菩萨，共复一形，涕泪哀恋，白其佛言：「我从久远劫来，蒙佛接引，使获不可思议神力，具大智慧。我所分身，遍满百千万亿恒河沙世界。每一世界，化百千万亿身。每一身，度百千万亿人，令归敬三宝，永离生死，至涅槃乐。但于佛法中，所为善事，一毛一渧，一沙一尘，或毫发许，我渐度脱，使获大利。唯愿世尊不以后世恶业众生为虑。」如是三白佛言：「唯愿世尊不以后世恶业众生为虑。」","尔时，佛赞地藏菩萨言：「善哉！善哉！吾助汝喜。汝能成就久远劫来，发弘誓愿，广度将毕，即证菩提。」","观众生业缘品第三","尔时，佛母摩耶夫人，恭敬合掌，问地藏菩萨言：「圣者！阎浮众生，造业差别，所受报应，其事云何？」","地藏答言：「千万世界，乃及国土，或有地狱，或无地狱，或有女人，或无女人，或有佛法，或无佛法，乃至声闻、辟支佛，亦复如是。非但地狱，罪报一等。」摩耶夫人重白菩萨：「且愿闻于阎浮罪报，所感恶趣。」地藏答言：「圣母！唯愿听受，我麁说之。」佛母白言：「愿圣者说。」","尔时，地藏菩萨白圣母言：「南阎浮提罪报，名号如是：若有众生，不孝父母，或至杀害，当堕无间地狱，千万亿劫，求出无期。若有众生，出佛身血，毁谤三宝，不敬尊经，亦当堕于无间地狱，千万亿劫，求出无期。若有众生，侵损常住，点污僧尼，或伽蓝内，恣行淫欲，或杀或害，如是等辈，当堕无间地狱，千万亿劫，求出无期。若有众生，伪作沙门，心非沙门，破用常住，欺诳白衣，违背戒律，种种造恶，如是等辈，当堕无间地狱，千万亿劫，求出无期。若有众生，偷窃常住财物谷米、饮食衣服，乃至一物不与取者，当堕无间地狱，千万亿劫，求出无期。」","地藏白言：「圣母！若有众生，作如是罪，当堕五无间地狱，求暂停苦，一念不得。」","摩耶夫人重白地藏菩萨言：「云何名为无间地狱？」","地藏白言：「圣母！诸有地狱，在大铁围山之内。其大地狱，有一十八所。次有五百，名号各别。次有千百，名字亦别。无间狱者，其狱城，周匝八万余里，其城纯铁，高一万里，城上火聚，少有空缺。其狱城中，诸狱相连，名号各别。","「独有一狱，名曰无间。其狱周匝万八千里，狱墙高一千里，悉是铁为，上火彻下，下火彻上，铁蛇铁狗，吐火驰逐，狱墙之上，东西而走。狱中有床，遍满万里。一人受罪，自见其身，遍卧满床。千万人受罪，亦各自见，身满床上。众业所感，获报如是。又诸罪人，备受众苦。千百夜叉，及以恶鬼，口牙如剑，眼如电光，手复铜爪，拖拽罪人。复有夜叉，执大铁戟，中罪人身，或中口鼻，或中腹背，抛空翻接，或置床上。复有铁鹰，啗罪人目。复有铁蛇，缴罪人颈。百肢节内，悉下长钉，拔舌耕犁，抽肠剉斩，洋铜灌口，热铁缠身。万死千生，业感如是。动经亿劫，求出无期。此界坏时，寄生他界。他界次坏，转寄他方。他方坏时，展转相寄。此界成后，还复而来。无间罪报，其事如是。","「又五事业感，故称无间。何等为五？一者，日夜受罪，以至劫数，无时间绝，故称无间。二者，一人亦满，多人亦满，故称无间。三者，罪器叉棒，鹰蛇狼犬，碓磨锯凿，剉斫镬汤，铁网铁绳，铁驴铁马，生革络首，热铁浇身，饥吞铁丸，渴饮铁汁。从年竟劫，数那由他，苦楚相连，更无间断，故称无间。四者，不问男子女人，羗胡夷狄，老幼贵贱，或龙或神，或天或鬼，罪行业感，悉同受之，故称无间。五者，若堕此狱，从初入时，至百千劫，一日一夜，万死万生。求一念间，暂住不得。除非业尽，方得受生。以此连绵，故称无间。」","地藏菩萨白圣母言：「无间地狱，麁说如是。若广说地狱罪器等名，及诸苦事，一劫之中，求说不尽。」","摩耶夫人闻已，愁忧合掌，顶礼而退。","阎浮众生业感品第四","尔时，地藏菩萨摩诃萨白佛言：「世尊！我承佛如来威神力故，遍百千万亿世界，分是身形，救拔一切业报众生。若非如来大慈力故，即不能作如是变化。我今又蒙佛付嘱，至阿逸多成佛已来，六道众生，遣令度脱。唯然，世尊，愿不有虑。」","尔时，佛告地藏菩萨：「一切众生，未解脱者，性识无定。恶习结业，善习结果，为善为恶，逐境而生。轮转五道，暂无休息，动经尘劫，迷惑障难。如鱼游网，将是长流，脱入暂出，又复遭网。以是等辈，吾当忧念。汝既毕是往愿，累劫重誓，广度罪辈，吾复何虑？」","说是语时，会中有一菩萨摩诃萨，名定自在王，白佛言：「世尊！地藏菩萨累劫已来，各发何愿？今蒙世尊，殷勤赞叹。唯愿世尊，略而说之。」","尔时，世尊告定自在王菩萨：「谛听！谛听！善思念之，吾当为汝，分别解说。乃往过去，无量阿僧祇那由他不可说劫，尔时有佛，号一切智成就如来——应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊，其佛寿命六万劫。未出家时，为小国王，与一隣国王为友，同行十善，饶益众生。其隣国内，所有人民，多造众恶。二王议计，广设方便。一王发愿，早成佛道，当度是辈，令使无余。一王发愿，若不先度罪苦，令是安乐，得至菩提，我终未愿成佛。」","佛告定自在王菩萨：「一王发愿早成佛者，即一切智成就如来是。一王发愿永度罪苦众生，未愿成佛者，即地藏菩萨是。复于过去，无量阿僧祇劫，有佛出世，名清净莲华目如来，其佛寿命四十劫。像法之中，有一罗汉，福度众生。因次教化，遇一女人，字曰光目，设食供养。罗汉问之：『欲愿何等？』光目答言：『我以母亡之日，资福救拔，未知我母生处何趣？』罗汉愍之，为入定观，见光目女母堕在恶趣，受极大苦。罗汉问光目言：『汝母在生，作何行业？今在恶趣，受极大苦。』光目答言：『我母所习，唯好食噉鱼鼈之属。所食鱼鼈多食其子，或炒或煮，恣情食噉。计其命数，千万复倍。尊者慈愍，如何哀救？』罗汉愍之，为作方便，劝光目言：『汝可志诚念清净莲华目如来，兼塑画形像，存亡获报。』","「光目闻已，即舍所爱，寻画佛像，而供养之。复恭敬心，悲泣瞻礼。忽于夜后，梦见佛身，金色晃耀，如须弥山，放大光明，而告光目：『汝母不久，当生汝家，才觉饥寒，即当言说。』","「其后家内，婢生一子，未满三日，而乃言说，稽首悲泣，告于光目：『生死业缘，果报自受。吾是汝母，久处暗冥，自别汝来，累堕大地狱。蒙汝福力，方得受生。为下贱人，又复短命，寿年十三，更落恶道。汝有何计，令吾脱免？』光目闻说，知母无疑，哽咽悲啼，而白婢子：『既是我母，合知本罪，作何行业，堕于恶道？』婢子答言：『以杀害毁骂二业受报。若非蒙福，救拔吾难，以是业故，未合解脱。』光目问言：『地狱罪报，其事云何？』婢子答言：『罪苦之事，不忍称说，百千岁中，卒白难竟。』","「光目闻已，啼泪号泣，而白空界：『愿我之母，永脱地狱。毕十三岁，更无重罪，及历恶道。十方诸佛，慈哀愍我，听我为母所发广大誓愿：若得我母永离三涂，及斯下贱，乃至女人之身，永劫不受者，愿我自今日后，对清净莲华目如来像前，却后百千万亿劫中，应有世界，所有地狱，及三恶道，诸罪苦众生，誓愿救拔，令离地狱恶趣、畜生、饿鬼等。如是罪报等人，尽成佛竟，我然后方成正觉。』","「发誓愿已，具闻清净莲华目如来而告之曰：『光目！汝大慈愍，善能为母发如是大愿。吾观汝母，十三岁毕，舍此报已，生为梵志，寿年百岁。过是报后，当生无忧国土，寿命不可计劫。后成佛果，广度人天，数如恒河沙。』」","佛告定自在王：「尔时罗汉福度光目者，即无尽意菩萨是。光目母者，即解脱菩萨是。光目女者，即地藏菩萨是。过去久远劫中，如是慈愍发恒河沙愿，广度众生。","「未来世中，若有男子女人，不行善者，行恶者，乃至不信因果者，邪婬妄语者，两舌恶口者，毁谤大乘者，如是诸业众生，必堕恶趣。若遇善知识，劝令一弹指间归依地藏菩萨，是诸众生，即得解脱三恶道报。若能志心归敬，及瞻礼赞叹，香华衣服，种种珍宝，或复饮食，如是奉事者，未来百千万亿劫中，常在诸天受胜妙乐。若天福尽，下生人间，犹百千劫，常为帝王，能忆宿命因果本末。定自在王，如是地藏菩萨，有如此不可思议大威神力，广利众生，汝等诸菩萨，当记是经，广宣流布。」","定自在王白佛言：「世尊！愿不有虑。我等千万亿菩萨摩诃萨，必能承佛威神，广演是经于阎浮提，利益众生。」","定自在王菩萨白世尊已，合掌恭敬，作礼而退。","尔时，四方天王，俱从座起，合掌恭敬，白佛言：「世尊！地藏菩萨于久远劫来，发如是大愿，云何至今，犹度未绝，更发广大誓言？唯愿世尊，为我等说。」","佛告四天王：「善哉！善哉！吾今为汝，及未来现在天人众等，广利益故，说地藏菩萨于娑婆世界，阎浮提内，生死道中，慈哀救拔，度脱一切罪苦众生方便之事。」","四天王言：「唯然，世尊！愿乐欲闻。」","佛告四天王：「地藏菩萨久远劫来，迄至于今，度脱众生，犹未毕愿。慈愍此世罪苦众生，复观未来无量劫中，因蔓不断，以是之故，又发重愿。如是菩萨，于娑婆世界，阎浮提中，百千万亿方便，而为教化。","「四天王！地藏菩萨若遇杀生者，说宿殃短命报。若遇窃盗者，说贫穷苦楚报。若遇邪婬者，说雀鸽鸳鸯报。若遇恶口者，说眷属鬪诤报。若遇毁谤者，说无舌疮口报。若遇瞋恚者，说丑陋癃残报。若遇悭悋者，说所求违愿报。若遇饮食无度者，说饥渴咽病报。若遇畋猎恣情者，说惊狂丧命报。若遇悖逆父母者，说天地灾杀报。若遇烧山林木者，说狂迷取死报。若遇前后父母恶毒者，说返生鞭挞现受报。若遇网捕生雏者，说骨肉分离报。若遇毁谤三宝者，说盲聋瘖痖报。若遇轻法慢教者，说永处恶道报。若遇破用常住者，说亿劫轮回地狱报。若遇污梵诬僧者，说永在畜生报。若遇汤火斩斫伤生者，说轮回递偿报。若遇破戒犯斋者，说禽兽饥饿报。若遇非理毁用者，说所求阙绝报。若遇吾我贡高者，说卑使下贱报。若遇两舌鬪乱者，说无舌百舌报。若遇邪见者，说边地受生报。","「如是等阎浮提众生，身口意业，恶习结果，百千报应，今麁略说。如是等阎浮提众生，业感差别，地藏菩萨百千方便，而教化之。是诸众生，先受如是等报，后堕地狱，动经劫数，无有出期。是故汝等，护人护国，无令是诸众业，迷惑众生。」","四天王闻已，涕泪悲叹，合掌而退。","地狱名号品第五","尔时，普贤菩萨摩诃萨白地藏菩萨言：「仁者！愿为天龙四众，及未来现在一切众生，说娑婆世界及阎浮提罪苦众生，所受报处地狱名号，及恶报等事，使未来世末法众生，知是果报。」","地藏答言：「仁者！我今承佛威神，及大士之力，略说地狱名号，及罪报恶报之事。仁者，阎浮提东方有山，号曰铁围，其山黑邃，无日月光。有大地狱，号极无间。又有地狱，名大阿鼻。复有地狱，名曰四角。复有地狱，名曰飞刀。复有地狱，名曰火箭。复有地狱，名曰夹山。复有地狱，名曰通枪。复有地狱，名曰铁车。复有地狱，名曰铁床。复有地狱，名曰铁牛。复有地狱，名曰铁衣。复有地狱，名曰千刃。复有地狱，名曰铁驴。复有地狱，名曰洋铜。复有地狱，名曰抱柱。复有地狱，名曰流火。复有地狱，名曰耕舌。复有地狱，名曰剉首。复有地狱，名曰烧脚。复有地狱，名曰啗眼。复有地狱，名曰铁丸。复有地狱，名曰诤论。复有地狱，名曰铁𫓧。复有地狱，名曰多瞋。」","地藏白言：「仁者！铁围之内，有如是等地狱，其数无限。更有叫唤地狱、拔舌地狱、粪尿地狱、铜锁地狱、火象地狱、火狗地狱、火马地狱、火牛地狱、火山地狱、火石地狱、火床地狱、火梁地狱、火鹰地狱、锯牙地狱、剥皮地狱、饮血地狱、烧手地狱、烧脚地狱、倒刺地狱、火屋地狱、铁屋地狱、火狼地狱。如是等地狱，其中各各复有诸小地狱，或一或二，或三或四，乃至百千。其中名号，各各不同。」","地藏菩萨告普贤菩萨言：「仁者！此者皆是南阎浮提行恶众生，业感如是。业力甚大，能敌须弥，能深巨海，能障圣道。是故众生莫轻小恶，以为无罪，死后有报，纤毫受之。父子至亲，岐路各别，纵然相逢，无肯代受。我今承佛威力，略说地狱罪报之事。唯愿仁者，暂听是言。」","普贤答言：「吾已久知三恶道报，望仁者说，令后世末法一切恶行众生，闻仁者说，使令归佛。」地藏白言：「仁者！地狱罪报，其事如是：或有地狱，取罪人舌，使牛耕之。或有地狱，取罪人心，夜叉食之。或有地狱，镬汤盛沸，煮罪人身。或有地狱，赤烧铜柱，使罪人抱。或有地狱，使诸火烧，趁及罪人。或有地狱，一向寒氷。或有地狱，无限粪尿。或有地狱，纯飞𨪏鏫。或有地狱，多攒火枪。或有地狱，唯撞胸背。或有地狱，但烧手足。或有地狱，盘缴铁蛇。或有地狱，驱逐铁狗。或有地狱，尽驾铁骡。仁者，如是等报，各各狱中，有百千种业道之器，无非是铜，是铁，是石，是火。此四种物，众业行感。若广说地狱罪报等事，一一狱中，更有百千种苦楚，何况多狱。我今承佛威神，及仁者问，略说如是。若广解说，穷劫不尽。」","如来赞叹品第六","尔时，世尊举身放大光明，遍照百千万亿恒河沙等诸佛世界，出大音声，普告诸佛世界一切诸菩萨摩诃萨，及天龙鬼神、人、非人等：「听吾今日称扬赞叹地藏菩萨摩诃萨，于十方世界，现大不可思议威神慈悲之力，救护一切罪苦之事。吾灭度后，汝等诸菩萨大士，及天龙鬼神等，广作方便，卫护是经，令一切众生，证涅槃乐。」","说是语已，会中有一菩萨，名曰普广，合掌恭敬，而白佛言：「今见世尊赞叹地藏菩萨，有如是不可思议大威神德。唯愿世尊为未来世末法众生，宣说地藏菩萨利益人天因果等事，使诸天龙八部，及未来世众生，顶受佛语。」","尔时，世尊告普广菩萨及四众等：「谛听！谛听！吾当为汝略说地藏菩萨利益人天福德之事。」","普广白言：「唯然，世尊！愿乐欲闻。」","佛告普广菩萨：「未来世中，若有善男子、善女人，闻是地藏菩萨摩诃萨名者，或合掌者、赞叹者、作礼者、恋慕者，是人超越三十劫罪。","「普广！若有善男子、善女人，或彩画形像，或土石胶漆，金、银、铜、铁，作此菩萨，一瞻一礼者，是人百返生于三十三天，永不堕于恶道。假如天福尽故，下生人间，犹为国王，不失大利。若有女人，厌女人身，尽心供养地藏菩萨画像，及土石胶漆铜铁等像，如是日日不退，常以华、香、饮食、衣服、缯彩、幢旛、钱、宝物等供养。是善女人，尽此一报女身，百千万劫，更不生有女人世界，何况复受？除非慈愿力故，要受女身，度脱众生。承斯供养地藏力故，及功德力，百千万劫，不受女身。","「复次，普广！若有女人，厌是丑陋、多疾病者，但于地藏像前，志心瞻礼，食顷之间，是人千万劫中，所受生身，相貌圆满。是丑陋女人，如不厌女身，即百千万亿生中，常为王女，乃及王妃、宰辅大姓、大长者女，端正受生，诸相圆满。由志心故，瞻礼地藏菩萨，获福如是。","「复次，普广！若有善男子、善女人，能对菩萨像前，作诸伎乐，及歌咏赞叹，香华供养，乃至劝于一人多人，如是等辈，现在世中，及未来世，常得百千鬼神日夜卫护，不令恶事辄闻其耳，何况亲受诸横？","「复次，普广！未来世中，若有恶人，及恶神恶鬼，见有善男子、善女人归敬供养赞叹瞻礼地藏菩萨形像，或妄生讥毁，谤无功德及利益事，或露齿笑，或背面非，或劝人共非，或一人非，或多人非，乃至一念生讥毁者，如是之人，贤劫千佛灭度，讥毁之报，尚在阿鼻地狱，受极重罪。过是劫已，方受饿鬼。又经千劫，复受畜生。又经千劫，方得人身。纵受人身，贫穷下贱，诸根不具，多被恶业，来结其心，不久之间，复堕恶道。是故，普广！讥毁他人供养，尚获此报，何况别生恶见毁灭？","「复次，普广！若未来世，有男子女人，久处床枕，求生求死，了不可得，或夜梦恶鬼，乃及家亲，或游险道，或多魇寐，共鬼神游，日月岁深，转复尫瘵，眠中叫苦，惨凄不乐者，此皆是业道论对，未定轻重，或难舍寿，或不得愈。男女俗眼，不辨是事。但当对诸佛菩萨像前，高声转读此经一遍。或取病人可爱之物，或衣服宝贝、庄园舍宅，对病人前，高声唱言：『我某甲等，为是病人，对经像前，舍诸等物，或供养经像，或造佛菩萨形像，或造塔寺，或然油灯，或施常住。』如是三白病人，遣令闻知。假令诸识分散，至气尽者，乃至一日、二日、三日、四日，至七日已来，但高声白，高声读经。是人命终之后，宿殃重罪，至于五无间罪，永得解脱。所受生处，常知宿命。何况善男子、善女人，自书此经，或教人书，或自塑画菩萨形像，乃至教人塑画，所受果报，必获大利。","「是故，普广！若见有人读诵是经，乃至一念赞叹是经，或恭敬者，汝须百千方便，劝是等人，勤心莫退，能得未来现在千万亿不可思议功德。","「复次，普广！若未来世诸众生等，或梦或寐，见诸鬼神乃及诸形，或悲或啼，或愁或叹，或恐或怖。此皆是一生十生，百生千生，过去父母、男女弟妹、夫妻眷属，在于恶趣，未得出离，无处希望福力救拔，当告宿世骨肉，使作方便，愿离恶道。普广！汝以神力，遣是眷属，令对诸佛菩萨像前，志心自读此经，或请人读。其数三遍，或七遍。如是恶道眷属，经声毕是遍数，当得解脱。乃至梦寐之中，永不复见。","「复次，普广！若未来世有诸下贱等人，或奴或婢，乃至诸不自由之人，觉知宿业，要忏悔者，志心瞻礼地藏菩萨形像，乃至一七日中，念菩萨名，可满万遍。如是等人，尽此报后，千万生中，常生尊贵，更不经三恶道苦。","「复次，普广！若未来世中，阎浮提内，刹利、婆罗门、长者、居士、一切人等，及异姓种族，有新产者，或男或女，七日之中，早与读诵此不思议经典，更为念菩萨名，可满万遍。是新生子，或男或女，宿有殃报，便得解脱，安乐易养，寿命增长。若是承福生者，转增安乐，及与寿命。","「复次，普广！若未来世众生，于月一日、八日、十四日、十五日、十八日、二十三、二十四、二十八、二十九日，乃至三十日，是诸日等，诸罪结集，定其轻重。南阎浮提众生，举止动念，无不是业，无不是罪，何况恣情杀害、窃盗、邪婬、妄语，百千罪状？能于是十斋日，对佛菩萨诸贤圣像前，读是经一遍，东西南北，百由旬内，无诸灾难。当此居家，若长若幼，现在未来百千岁中，永离恶趣。能于十斋日每转一遍，现世令此居家无诸横病，衣食丰溢。","「是故，普广！当知地藏菩萨有如是等不可说百千万亿大威神力利益之事。阎浮众生，于此大士有大因缘。是诸众生，闻菩萨名，见菩萨像，乃至闻是经，三字五字，或一偈一句者，现在殊妙安乐，未来之世，百千万生，常得端正，生尊贵家。」","尔时，普广菩萨闻佛如来称扬赞叹地藏菩萨已，胡跪合掌，复白佛言：「世尊！我久知是大士有如此不可思议神力，及大誓愿力。为未来众生，遣知利益，故问如来，唯然顶受。世尊！当何名此经？使我云何流布？」","佛告普广：「此经有三名：一名地藏本愿，亦名地藏本行，亦名地藏本誓力经。缘此菩萨，久远劫来，发大重愿，利益众生，是故汝等，依愿流布。」","普广闻已，合掌恭敬，作礼而退。","利益存亡品第七","尔时，地藏菩萨摩诃萨白佛言：「世尊！我观是阎浮众生，举心动念，无非是罪。脱获善利，多退初心；若遇恶缘，念念增益。是等辈人，如履泥涂，负于重石，渐困渐重，足步深邃。若得遇知识，替与减负，或全与负，是知识有大力故，复相扶助，劝令牢脚，若达平地，须省恶路，无再经历。","「世尊！习恶众生，从纤毫间，便至无量。是诸众生，有如此习，临命终时，父母眷属宜为设福，以资前路。或悬旛盖，及然油灯，或转读尊经，或供养佛像及诸圣像。乃至念佛菩萨及辟支佛名字，一名一号，历临终人耳根，或闻在本识。是诸众生所造恶业，计其感果，必堕恶趣，缘是眷属为临终人修此圣因，如是众罪，悉皆销灭。若能更为身死之后，七七日内，广造众善，能使是诸众生，永离恶趣，得生人天，受胜妙乐，现在眷属，利益无量。","「是故我今对佛世尊，及天龙八部、人、非人等，劝于阎浮提众生：临终之日，慎勿杀害，及造恶缘——拜祭鬼神，求诸魍魉。何以故？尔所杀害，乃至拜祭，无纤毫之力利益亡人，但结罪缘，转增深重。假使来世，或现在生，得获圣分，生人天中，缘是临终被诸眷属造是恶因，亦令是命终人，殃累对辩，晚生善处。何况临命终人，在生未曾有少善根，各据本业，自受恶趣，何忍眷属，更为增业？譬如有人，从远地来，绝粮三日，所负担物，彊过百斤。忽遇隣人，更附少物，以是之故，转复困重。世尊！我观阎浮众生，但能于诸佛教中，乃至善事，一毛一渧，一沙一尘，如是利益，悉皆自得。」","说是语时，会中有一长者，名曰大辩。是长者久证无生，化度十方，现长者身，合掌恭敬，问地藏菩萨言：「大士！是南阎浮提众生，命终之后，小大眷属，为修功德，乃至设斋，造众善因，是命终人，得大利益及解脱不？」","地藏答言：「长者！我今为未来现在一切众生，承佛威力，略说是事。长者，未来现在诸众生等，临命终日，得闻一佛名、一菩萨名、一辟支佛名，不问有罪无罪，悉得解脱。","「若有男子女人，在生不修善因，多造众罪，命终之后，眷属小大为造福利一切圣事，七分之中，而乃获一，六分功德，生者自利。以是之故，未来现在善男女等，闻健自修，分分己获。无常大鬼，不期而到，冥冥游神，未知罪福，七七日内，如痴如聋。或在诸司，辩论业果，审定之后，据业受生。未测之间，千万愁苦，何况堕于诸恶趣等？是命终人，未得受生，在七七日内，念念之间，望诸骨肉眷属，与造福力救拔。过是日后，随业受报，若是罪人，动经千百岁中，无解脱日。若是五无间罪，堕大地狱，千劫万劫，永受众苦。","「复次，长者！如是罪业众生，命终之后，眷属骨肉，为修营斋，资助业道。未斋食竟，及营斋之次，米泔菜叶，不弃于地。乃至诸食未献佛僧，勿得先食。如有违食及不精勤，是命终人，了不得力。如精勤护净，奉献佛僧，是命终人，七分获一。是故，长者！阎浮众生，若能为其父母，乃至眷属，命终之后，设斋供养，志心勤恳，如是之人，存亡获利。」","说是语时，忉利天宫有千万亿那由他阎浮鬼神，悉发无量菩提之心。大辩长者，作礼而退。","阎罗王众赞叹品第八","尔时，铁围山内，有无量鬼王，与阎罗天子，俱诣忉利，来到佛所。所谓恶毒鬼王、多恶鬼王、大诤鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、散殃鬼王、飞身鬼王、电光鬼王、狼牙鬼王、千眼鬼王、噉兽鬼王、负石鬼王、主耗鬼王、主祸鬼王、主食鬼王、主财鬼王、主畜鬼王、主禽鬼王、主兽鬼王、主魅鬼王、主产鬼王、主命鬼王、主疾鬼王、主险鬼王、三目鬼王、四目鬼王、五目鬼王、祁利失王、大祁利失王、祁利叉王、大祁利叉王、阿那咤王、大阿那咤王。如是等大鬼王，各各与百千诸小鬼王，尽居阎浮提，各有所执，各有所主。是诸鬼王，与阎罗天子，承佛威神，及地藏菩萨摩诃萨力，俱诣忉利，在一面立。","尔时，阎罗天子，胡跪合掌，白佛言：「世尊！我等今者与诸鬼王，承佛威神，及地藏菩萨摩诃萨力，方得诣此忉利大会，亦是我等获善利故。我今有小疑事，敢问世尊，唯愿世尊，慈悲宣说。」","佛告阎罗天子：「恣汝所问，吾为汝说。」","是时，阎罗天子瞻礼世尊，及回视地藏菩萨，而白佛言：「世尊！我观地藏菩萨，在六道中，百千方便，而度罪苦众生，不辞疲倦。是大菩萨，有如是不可思议神通之事。然诸众生，脱获罪报，未久之间，又堕恶道。世尊！是地藏菩萨既有如是不可思议神力，云何众生而不依止善道，永取解脱？唯愿世尊，为我解说。」","佛告阎罗天子：「南阎浮提众生，其性刚彊，难调难伏。是大菩萨，于百千劫，头头救拔如是众生，早令解脱。是罪报人，乃至堕大恶趣。菩萨以方便力，拔出根本业缘，而遣悟宿世之事。自是阎浮众生，结恶习重，旋出旋入。劳斯菩萨，久经劫数，而作度脱。","「譬如有人，迷失本家，误入险道。其险道中，多诸夜叉，及虎狼师子、蚖蛇蝮蝎。如是迷人，在险道中，须臾之间，即遭诸毒。有一知识，多解大术，善禁是毒，乃及夜叉诸恶毒等。忽逢迷人，欲进险道，而语之言：『咄哉！男子！为何事故，而入此路？有何异术，能制诸毒？』是迷路人，忽闻是语，方知险道，即便退步，求出此路。是善知识，提携接手，引出险道，免诸恶毒，至于好道，令得安乐，而语之言：『咄哉！迷人！自今已后，勿履是道。此路入者，卒难得出，复损性命。』是迷路人，亦生感重。临别之时，知识又言：『若见亲知及诸路人，若男若女，言于此路多诸毒恶，丧失性命。无令是众，自取其死。』","「是故地藏菩萨具大慈悲，救拔罪苦众生，欲生天人中，令受妙乐。是诸罪众，知业道苦，脱得出离，永不再历。如迷路人，误入险道，遇善知识，引接令出，永不复入。逢见他人，复劝莫入，自言：『因是迷故，得解脱竟，更不复入。』若再履践，犹尚迷误，不觉旧曾所落险道，或致失命，如堕恶趣。地藏菩萨方便力故，使令解脱，生人天中。旋又再入，若业结重，永处地狱，无解脱时。」","尔时，恶毒鬼王合掌恭敬，白佛言：「世尊！我等诸鬼王，其数无量，在阎浮提，或利益人，或损害人，各各不同。然是业报，使我眷属，游行世界，多恶少善。过人家庭，或城邑聚落，庄园房舍。或有男子女人，修毛发善事，乃至悬一旛一盖，少香少华，供养佛像及菩萨像，或转读尊经，烧香供养一句一偈。我等鬼王，敬礼是人，如过去、现在、未来诸佛。勅诸小鬼，各有大力，及土地分，便令卫护。不令恶事横事、恶病横病，乃至不如意事，近于此舍等处，何况入门？」佛赞鬼王：「善哉！善哉！汝等及与阎罗，能如是拥护善男女等，吾亦告梵王帝释，令卫护汝。」","说是语时，会中有一鬼王，名曰主命，白佛言：「世尊！我本业缘，主阎浮人命，生时死时，我皆主之。在我本愿，甚欲利益。自是众生，不会我意，致令生死，俱不得安。","「何以故？是阎浮提人，初生之时，不问男女，或欲生时，但作善事，增益舍宅。自令土地无量欢喜，拥护子母，得大安乐，利益眷属。或已生下，慎勿杀害，取诸鲜味，供给产母。及广聚眷属，饮酒食肉，歌乐弦管，能令子母，不得安乐。","「何以故？是产难时，有无数恶鬼，及魍魉精魅，欲食腥血。是我早令舍宅土地灵祇，荷护子母，使令安乐，而得利益。如是之人，见安乐故，便合设福，答诸土地。翻为杀害，集聚眷属，以是之故，犯殃自受，子母俱损。","「又阎浮提临命终人，不问善恶，我欲令是命终之人，不落恶道，何况自修善根，增我力故。是阎浮提行善之人，临命终时，亦有百千恶道鬼神，或变作父母，乃至诸眷属，引接亡人，令落恶道，何况本造恶者？","「世尊！如是阎浮提男子女人，临命终时，神识惛昧，不辩善恶，乃至眼耳，更无见闻。是诸眷属，当须设大供养，转读尊经，念佛菩萨名号。如是善缘，能令亡者，离诸恶道，诸魔鬼神，悉皆退散。世尊！一切众生临命终时，若得闻一佛名、一菩萨名，或大乘经典一句一偈，我观如是辈人，除五无间杀害之罪，小小恶业，合堕恶趣者，寻即解脱。」","佛告主命鬼王：「汝大慈故，能发如是大愿，于生死中，护诸众生。若未来世中，有男子女人，至生死时，汝莫退是愿，总令解脱，永得安乐。」","鬼王白佛言：「愿不有虑，我毕是形，念念拥护阎浮众生，生时死时，俱得安乐。但愿诸众生，于生死时，信受我语，无不解脱，获大利益。」","尔时，佛告地藏菩萨：「是大鬼王主命者，已曾经百千生，作大鬼王，于生死中，拥护众生。是大士，慈悲愿故，现大鬼身，实非鬼也。却后过一百七十劫，当得成佛，号曰无相如来。劫名安乐，世界名净住。其佛寿命，不可计劫。地藏！是大鬼王，其事如是，不可思议，所度天人，亦不可限量。」","称佛名号品第九","尔时，地藏菩萨摩诃萨白佛言：「世尊！我今为未来众生，演利益事，于生死中，得大利益。唯愿世尊，听我说之。」","佛告地藏菩萨：「汝今欲兴慈悲，救拔一切罪苦六道众生，演不思议事，今正是时，唯当速说。吾即涅槃，使汝早毕是愿，吾亦无忧现在未来一切众生。」","地藏菩萨白佛言：「世尊！过去无量阿僧祇劫，有佛出世，号无边身如来。若有男子女人，闻是佛名，暂生恭敬，即得超越四十劫生死重罪。何况塑画形像、供养赞叹？其人获福，无量无边。","「又于过去恒河沙劫，有佛出世，号宝性如来。若有男子女人，闻是佛名，一弹指顷，发心归依，是人于无上道，永不退转。又于过去，有佛出世，号波头摩胜如来。若有男子女人，闻是佛名，历于耳根，是人当得千返生于六欲天中，何况志心称念？","「又于过去不可说不可说阿僧祇劫，有佛出世，号师子吼如来。若有男子女人，闻是佛名，一念归依，是人得遇无量诸佛，摩顶授记。又于过去，有佛出世，号拘留孙佛。若有男子女人，闻是佛名，志心瞻礼，或复赞叹，是人于贤劫千佛会中，为大梵王，得授上记。","「又于过去，有佛出世，号毘婆尸。若有男子女人，闻是佛名，永不堕恶道，常生人天，受胜妙乐。","「又于过去无量无数恒河沙劫，有佛出世，号宝胜如来。若有男子女人，闻是佛名，毕竟不堕恶道，常在天上，受胜妙乐。","「又于过去，有佛出世，号宝相如来。若有男子女人，闻是佛名，生恭敬心，是人不久，得阿罗汉果。","「又于过去，无量阿僧祇劫，有佛出世，号袈裟幢如来。若有男子女人，闻是佛名者，超一百大劫生死之罪。","「又于过去，有佛出世，号大通山王如来。若有男子女人，闻是佛名者，是人得遇恒河沙佛，广为说法，必成菩提。又于过去，有净月佛、山王佛、智胜佛、净名王佛、智成就佛、无上佛、妙声佛、满月佛、月面佛，有如是等不可说佛。","「世尊！现在未来一切众生，若天若人，若男若女，但念得一佛名号，功德无量，何况多名？是众生等，生时死时，自得大利，终不堕恶道。若有临命终人，家中眷属，乃至一人，为是病人，高声念一佛名，是命终人，除五无间罪，余业报等，悉得销灭。是五无间罪，虽至极重，动经亿劫，了不得出，承斯临命终时，他人为其称念佛名，于是罪中亦渐销灭。何况众生，自称自念，获福无量，灭无量罪。」","校量布施功德缘品第十","尔时，地藏菩萨摩诃萨承佛威神，从座而起，胡跪合掌，白佛言：「世尊！我观业道众生，校量布施，有轻有重：有一生受福，有十生受福，有百生千生受大福利者。是事云何？唯愿世尊，为我说之。」","尔时，佛告地藏菩萨：「吾今于忉利天宫，一切众会，说阎浮提布施，校量功德轻重。汝当谛听，吾为汝说。」","地藏白佛言：「我疑是事，愿乐欲闻。」","佛告地藏菩萨：「南阎浮提，有诸国王、宰辅大臣、大长者、大刹利、大婆罗门等，若遇最下贫穷，乃至癃残瘖痖，聋痴无目，如是种种不完具者。是大国王等，欲布施时，若能具大慈悲，下心含笑，亲手遍布施，或使人施，软言慰喻。是国王等，所获福利，如布施百恒河沙佛功德之利。何以故？缘是国王等，于是最贫贱辈，及不完具者，发大慈心，是故福利，有如此报：百千生中，常得七宝具足，何况衣食受用？","「复次，地藏！若未来世，有诸国王，至婆罗门等，遇佛塔寺，或佛形像，乃至菩萨、声闻、辟支佛像，躬自营办，供养布施。是国王等，当得三劫为帝释身，受胜妙乐。若能以此布施福利，回向法界，是大国王等，于十劫中，常为大梵天王。","「复次，地藏！若未来世，有诸国王，至婆罗门等，遇先佛塔庙，或至经像，毁坏破落，乃能发心修补。是国王等，或自营办，或劝他人，乃至百千人等，布施结缘。是国王等，百千生中，常为转轮王身。如是他人同布施者，百千生中，常为小国王身。更能于塔庙前，发回向心，如是国王，乃及诸人，尽成佛道，以此果报，无量无边。","「复次，地藏！未来世中，有诸国王，及婆罗门等，见诸老病，及生产妇女，若一念间，具大慈心，布施医药、饮食、卧具，使令安乐。如是福利，最不思议：一百劫中，常为净居天主；二百劫中，常为六欲天主；毕竟成佛，永不堕恶道，乃至百千生中，耳不闻苦声。","「复次，地藏！若未来世中，有诸国王，及婆罗门等，能作如是布施，获福无量，更能回向，不问多少，毕竟成佛，何况释梵转轮之报？是故，地藏！普劝众生，当如是学。","「复次，地藏！未来世中，若善男子、善女人，于佛法中，种少善根，毛发沙尘等许，所受福利，不可为喻。复次，地藏！未来世中，若有善男子、善女人，遇佛形像、菩萨形像、辟支佛形像、转轮王形像，布施供养，得无量福，常在人天，受胜妙乐。若能回向法界，是人福利，不可为喻。","「复次，地藏！未来世中，若有善男子、善女人，遇大乘经典，或听闻一偈一句，发殷重心，赞叹恭敬，布施供养。是人获大果报，无量无边。若能回向法界，其福不可为喻。","「复次，地藏！若未来世中，有善男子、善女人，遇佛塔寺、大乘经典新者，布施供养，瞻礼赞叹，恭敬合掌；若遇故者或毁坏者，修补营理，或独发心，或劝多人同共发心。如是等辈，三十生中，常为诸小国王。檀越之人，常为轮王，还以善法，教化诸小国王。","「复次，地藏！未来世中，若有善男子、善女人，于佛法中，所种善根，或布施供养，或修补塔寺，或装理经典，乃至一毛一尘，一沙一渧。如是善事，但能回向法界，是人功德，百千生中，受上妙乐。如但回向自家眷属，或自身利益，如是之果，即三生受乐，舍一得万报。是故，地藏！布施因缘，其事如是。」","地神护法品第十一","尔时，坚牢地神白佛言：「世尊！我从昔来，瞻视顶礼无量菩萨摩诃萨，皆是大不可思议神通智慧，广度众生。是地藏菩萨摩诃萨，于诸菩萨，誓愿深重。世尊！是地藏菩萨，于阎浮提，有大因缘。如文殊、普贤、观音、弥勒，亦化百千身形，度于六道，其愿尚有毕竟。是地藏菩萨，教化六道一切众生，所发誓愿劫数，如千百亿恒河沙。","「世尊！我观未来及现在众生，于所住处，于南方清洁之地，以土石竹木，作其龛室。是中能塑画，乃至金银铜铁，作地藏形像，烧香供养，瞻礼赞叹。是人居处，即得十种利益。何等为十？一者，土地丰壤。二者，家宅永安。三者，先亡生天。四者，现存益寿。五者，所求遂意。六者，无水火灾。七者，虚耗辟除。八者，杜绝恶梦。九者，出入神护。十者，多遇圣因。","「世尊！未来世中，及现在众生，若能于所住处方面，作如是供养，得如是利益。」","复白佛言：「世尊！未来世中，若有善男子、善女人，于所住处，有此经典及菩萨像，是人更能转读经典，供养菩萨。我常日夜，以本神力，卫护是人，乃至水火盗贼，大横小横，一切恶事，悉皆销灭。」","佛告坚牢地神：「汝大神力，诸神少及。何以故？阎浮土地，悉蒙汝护。乃至草木沙石，稻麻竹苇，谷米宝贝，从地而有，皆因汝力。又常称扬地藏菩萨利益之事，汝之功德，及以神通，百千倍于常分地神。若未来世中，有善男子、善女人，供养菩萨，及转读是经，但依地藏本愿经一事修行者，汝以本神力，而拥护之。勿令一切灾害，及不如意事，辄闻于耳，何况令受？非但汝独护是人故，亦有释梵眷属、诸天眷属，拥护是人。何故得如是圣贤拥护？皆由瞻礼地藏形像，及转读是本愿经故。自然毕竟出离苦海，证涅槃乐。以是之故，得大拥护。」","见闻利益品第十二","尔时，世尊从顶门上，放百千万亿大毫相光——所谓白毫相光、大白毫相光、瑞毫相光、大瑞毫相光、玉毫相光、大玉毫相光、紫毫相光、大紫毫相光、青毫相光、大青毫相光、碧毫相光、大碧毫相光、红毫相光、大红毫相光、绿毫相光、大绿毫相光、金毫相光、大金毫相光、庆云毫相光、大庆云毫相光、千轮毫光、大千轮毫光、宝轮毫光、大宝轮毫光、日轮毫光、大日轮毫光、月轮毫光、大月轮毫光、宫殿毫光、大宫殿毫光、海云毫光、大海云毫光。于顶门上，放如是等毫相光已，出微妙音，告诸大众、天龙八部、人、非人等：「听吾今日于忉利天宫称扬赞叹地藏菩萨于人天中利益等事、不思议事、超圣因事、证十地事、毕竟不退阿耨多罗三藐三菩提事。」","说是语时，会中有一菩萨摩诃萨，名观世音，从座而起，胡跪合掌，白佛言：「世尊！是地藏菩萨摩诃萨，具大慈悲，怜愍罪苦众生，于千万亿世界，化千万亿身。所有功德，及不思议威神之力，我闻世尊与十方无量诸佛，异口同音，赞叹地藏菩萨云：正使过去现在未来诸佛，说其功德，犹不能尽。向者，又蒙世尊普告大众，欲称扬地藏利益等事。唯愿世尊，为现在未来一切众生，称扬地藏不思议事，令天龙八部，瞻礼获福。」","佛告观世音菩萨：「汝于娑婆世界，有大因缘。若天若龙、若男若女、若神若鬼，乃至六道罪苦众生，闻汝名者、见汝形者、恋慕汝者、赞叹汝者，是诸众生，于无上道，必不退转，常生人天，具受妙乐，因果将熟，遇佛授记。汝今具大慈悲，怜愍众生，及天龙八部，听吾宣说地藏菩萨不思议利益之事。汝当谛听，吾今说之。」","观世音言：「唯然，世尊！愿乐欲闻。」","佛告观世音菩萨：「未来现在诸世界中，有天人受天福尽，有五衰相现，或有堕于恶道之者。如是天人，若男若女，当现相时，或见地藏菩萨形像，或闻地藏菩萨名，一瞻一礼，是诸天人，转增天福，受大快乐，永不堕三恶道报。何况见闻菩萨，以诸香、华、衣服、饮食、宝贝、璎珞，布施供养，所获功德福利，无量无边。","「复次，观世音！若未来现在诸世界中，六道众生，临命终时，得闻地藏菩萨名，一声历耳根者，是诸众生，永不历三恶道苦。何况临命终时，父母眷属，将是命终人舍宅、财物、宝贝、衣服，塑画地藏形像。或使病人未终之时，眼耳见闻，知道眷属将舍宅宝贝等，为其自身，塑画地藏菩萨形像。是人若是业报合受重病者，承斯功德，寻即除愈，寿命增益。是人若是业报命尽，应有一切罪障业障，合堕恶趣者，承斯功德，命终之后，即生人天，受胜妙乐，一切罪障，悉皆销灭。","「复次，观世音菩萨！若未来世，有男子女人，或乳哺时，或三岁、五岁、十岁已下，亡失父母，乃及亡失兄弟姊妹。是人年既长大，思忆父母，及诸眷属，不知落在何趣？生何世界？生何天中？是人若能塑画地藏菩萨形像，乃至闻名，一瞻一礼，一日至七日，莫退初心，闻名见形，瞻礼供养。是人眷属，假因业故，堕恶趣者，计当劫数，承斯男女兄弟姊妹塑画地藏形像、瞻礼功德，寻即解脱，生人天中；受胜妙乐者，即承斯功德，转增圣因，受无量乐。是人更能三七日中，一心瞻礼地藏形像，念其名字，满于万遍。当得菩萨现无边身，具告是人眷属生界；或于梦中，菩萨现大神力，亲领是人于诸世界，见诸眷属。更能每日，念菩萨名千遍，至于千日。是人当得菩萨遣所在土地鬼神，终身卫护，现世衣食丰溢，无诸疾苦，乃至横事不入其门，何况及身？是人毕竟得菩萨摩顶授记。","「复次，观世音菩萨！若未来世，有善男子、善女人，欲发广大慈心，救度一切众生者，欲修无上菩提者，欲出离三界者。是诸人等，见地藏形像及闻名者，至心归依，或以香华衣服、宝贝饮食，供养瞻礼。是善男女等，所愿速成，永无障碍。","「复次，观世音！若未来世，有善男子、善女人，欲求现在未来百千万亿等愿、百千万亿等事，但当归依、瞻礼、供养、赞叹地藏菩萨形像，如是所愿所求，悉皆成就。复愿地藏菩萨，具大慈悲，永拥护我，是人于睡梦中，即得菩萨摩顶授记。","「复次，观世音菩萨！若未来世，善男子、善女人，于大乘经典，深生珍重，发不思议心，欲读欲诵。纵遇明师，教视令熟，旋得旋忘，动经年月，不能读诵。是善男子等，有宿业障，未得销除，故于大乘经典，无读诵性。如是之人，闻地藏菩萨名，见地藏菩萨像，具以本心恭敬陈白，更以香、华、衣服、饮食、一切玩具，供养菩萨。以净水一盏，经一日一夜，安菩萨前，然后合掌请服，回首向南，临入口时，至心郑重。服水既毕，慎五辛、酒肉、邪婬、妄语，及诸杀害，一七日，或三七日。是善男子、善女人，于睡梦中，具见地藏菩萨现无边身，于是人处授灌顶水。其人梦觉，即获聪明，应是经典，一历耳根，即当永记，更不忘失一句一偈。","「复次，观世音菩萨！若未来世，有诸人等：衣食不足，求者乖愿；或多病疾，或多凶衰；家宅不安，眷属分散；或诸横事，多来忤身；睡梦之间，多有惊怖。如是人等，闻地藏名，见地藏形，至心恭敬，念满万遍。是诸不如意事，渐渐消灭，即得安乐，衣食丰溢，乃至于睡梦中，悉皆安乐。","「复次，观世音菩萨！若未来世，有善男子、善女人，或因治生，或因公私，或因生死，或因急事，入山林中，过渡河海，乃及大水，或经险道。是人先当念地藏菩萨名万遍，所过土地，鬼神卫护，行住坐卧，永保安乐。乃至逢于虎狼师子、一切毒害，不能损之。」","佛告观世音菩萨：「是地藏菩萨，于阎浮提，有大因缘。若说于诸众生见闻利益等事，百千劫中，说不能尽。是故，观世音！汝以神力，流布是经，令娑婆世界众生，百千万劫，永受安乐。」","尔时，世尊而说偈言：",`「吾观地藏威神力，　恒河沙劫说难尽，
见闻瞻礼一念间，　利益人天无量事。
若男若女若龙神，　报尽应当堕恶道，
至心归依大士身，　寿命转增除罪障。
少失父母恩爱者，　未知魂神在何趣？
兄弟姊妹及诸亲，　生长以来皆不识。
或塑或画大士身，　悲恋瞻礼不暂舍，
三七日中念其名。　菩萨当现无边体，
示其眷属所生界，　纵堕恶趣寻出离。
若能不退是初心，　即获摩顶受圣记。
欲修无上菩提者，　乃至出离三界苦，
是人既发大悲心，　先当瞻礼大士像，
一切诸愿速成就，　永无业障能遮止。
有人发心念经典，　欲度群迷超彼岸，
虽立是愿不思议，　旋读旋忘多废失。
斯人有业障惑故，　于大乘经不能记。
供养地藏以香华，　衣服饮食诸玩具，
以净水安大士前，　一日一夜求服之，
发殷重心慎五辛，　酒肉邪淫及妄语，
三七日内勿杀害，　至心思念大士名。
即于梦中见无边，　觉来便得利根耳，
应是经教历耳闻，　千万生中永不忘。
以是大士不思议，　能使斯人获此慧。
贫穷众生及疾病，　家宅凶衰眷属离，
睡梦之中悉不安，　求者乖违无称遂。
至心瞻礼地藏像，　一切恶事皆消灭，
至于梦中尽得安，　衣食丰饶神鬼护。
欲入山林及渡海，　毒恶禽兽及恶人，
恶神恶鬼并恶风，　一切诸难诸苦恼。
但当瞻礼及供养，　地藏菩萨大士像，
如是山林大海中，　应是诸恶皆消灭。
观音至心听吾说，　地藏无尽不思议，
百千万劫说不周，　广宣大士如是力。
地藏名字人若闻，　乃至见像瞻礼者，
香华衣服饮食奉，　供养百千受妙乐，
若能以此回法界，　毕竟成佛超生死。
是故观音汝当知，　普告恒沙诸国土。」`,"嘱累人天品第十三","尔时，世尊举金色臂，又摩地藏菩萨摩诃萨顶，而作是言：「地藏！地藏！汝之神力，不可思议；汝之慈悲，不可思议；汝之智慧，不可思议；汝之辩才，不可思议。正使十方诸佛，赞叹宣说汝之不思议事，千万劫中，不能得尽。地藏！地藏！记吾今日在忉利天中，于百千万亿不可说不可说一切诸佛菩萨、天龙八部大会之中，再以人天诸众生等，未出三界，在火宅中者，付嘱于汝。无令是诸众生，堕恶趣中一日一夜，何况更落五无间及阿鼻地狱，动经千万亿劫，无有出期？","「地藏！是南阎浮提众生，志性无定，习恶者多，纵发善心，须臾即退，若遇恶缘，念念增长。以是之故，吾分是形，百千亿化度，随其根性而度脱之。地藏！吾今殷勤以天人众，付嘱于汝。未来之世，若有天人，及善男子、善女人，于佛法中，种少善根，一毛一尘，一沙一渧。汝以道力，拥护是人，渐修无上，勿令退失。复次，地藏！未来世中，若天若人，随业报应，落在恶趣。临堕趣中，或至门首，是诸众生，若能念得一佛名、一菩萨名、一句一偈大乘经典。是诸众生，汝以神力，方便救拔。于是人所，现无边身，为碎地狱，遣令生天，受胜妙乐。」","尔时，世尊而说偈言：",`「现在未来天人众，　吾今殷勤付嘱汝，
以大神通方便度，　勿令堕在诸恶趣。」`,"尔时，地藏菩萨摩诃萨胡跪合掌，白佛言：「世尊！唯愿世尊，不以为虑。未来世中，若有善男子、善女人，于佛法中，一念恭敬，我亦百千方便，度脱是人，于生死中，速得解脱。何况闻诸善事，念念修行？自然于无上道，永不退转。」","说是语时，会中有一菩萨，名虚空藏，白佛言：「世尊！我自至忉利，闻于如来赞叹地藏菩萨威神势力，不可思议。未来世中，若有善男子、善女人，乃及一切天龙，闻此经典，及地藏名字，或瞻礼形像，得几种福利？唯愿世尊，为未来现在一切众等，略而说之。」","佛告虚空藏菩萨：「谛听！谛听！吾当为汝分别说之。若未来世，有善男子、善女人，见地藏形像，及闻此经，乃至读诵，香华饮食、衣服珍宝，布施供养，赞叹瞻礼，得二十八种利益：一者天龙护念，二者善果日增，三者集圣上因，四者菩提不退，五者衣食丰足，六者疾疫不临，七者离水火灾，八者无盗贼厄，九者人见钦敬，十者神鬼助持，十一者女转男身，十二者为王臣女，十三者端正相好，十四者多生天上，十五者或为帝王，十六者宿智命通，十七者有求皆从，十八者眷属欢乐，十九者诸横销灭，二十者业道永除，二十一者去处尽通，二十二者夜梦安乐，二十三者先亡离苦，二十四者宿福受生，二十五者诸圣赞叹，二十六者聪明利根，二十七者饶慈愍心，二十八者毕竟成佛。","「复次，虚空藏菩萨！若现在未来，天龙鬼神，闻地藏名，礼地藏形，或闻地藏本愿事行，赞叹瞻礼，得七种利益：一者速超圣地，二者恶业销灭，三者诸佛护临，四者菩提不退，五者增长本力，六者宿命皆通，七者毕竟成佛。」","尔时，十方一切诸来不可说不可说诸佛如来，及大菩萨、天龙八部，闻释迦牟尼佛，称扬赞叹地藏菩萨，大威神力，不可思议，叹未曾有。是时忉利天，雨无量香华，天衣珠璎，供养释迦牟尼佛，及地藏菩萨已。一切众会，俱复瞻礼，合掌而退。"],source:"https://cbetaonline.dila.edu.tw/zh/T13n0412",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T13/T13n0412.xml",sourceLabel:"CBETA T13n0412",scope:"全2卷正文（不含序跋、目录、附录）",originalTitle:"地藏菩薩本願經",juan:[1,2]},{id:"cbeta-t17n0784",title:"四十二章经",subtitle:"四十二章经 · 后汉 迦叶摩腾共法兰译",paragraphs:["昔汉孝明皇帝夜梦见神人，身体有金色，项有日光，飞在殿前，意中欣然，甚悦之。明日问群臣：「此为何神也？」","有通人傅毅曰：「臣闻天竺有得道者，号曰佛，轻举能飞，殆将其神也。」","于是上悟，即遣使者张骞、羽林中郎将秦景博士弟子王遵等十二人，至大月支国写取佛经四十二章。在第十四石函中登起立塔寺，于是道法流布，处处修立佛寺。远人伏化愿为臣妾者，不可称数，国内清宁，含识之类蒙恩受赖于今不绝也。","佛言：「辞亲出家为道，名曰沙门，常行二百五十戒，为四真道行，进志清净，成阿罗汉。阿罗汉者，能飞行变化，住寿命，动天地；次为阿那含，阿那含者，寿终魂灵上十九天，于彼得阿罗汉；次为斯陀含，斯陀含者，一上一还，即得阿罗汉；次为须陀洹，须陀洹者，七死七生，便得阿罗汉；爱欲断者，譬如四支断，不复用之。」","佛言：「除须发，为沙门，受道法，去世资财，乞求取足，日中一食，树下一宿，慎不再矣！使人愚弊者，爱与欲也。」","佛言：「众生以十事为善，亦以十事为恶。身三、口四、意三。身三者：杀、盗、婬；口四者：两舌、恶骂、妄言、绮语；意三者：嫉、恚、痴，不信三尊，以邪为真。优婆塞行五事，不懈退，至十事，必得道也。」","佛言：「人有众过，而不自悔，顿止其心，罪来归身，犹水归海，自成深广矣；有恶知非，改过得善，罪日消灭，后会得道也。」","佛言：「人愚吾以为不善，吾以四等慈护济之；重以恶来者，吾重以善往，福德之气，常在此也；害气重殃，反在于彼。」","有人闻佛道守大仁慈，以恶来，以善往，故来骂。佛默然不答，愍之痴冥狂愚使然。骂止，问曰：「子以礼从人，其人不纳，实礼如之乎？」曰：「持归。」「今子骂我，我亦不纳，子自持归，祸子身矣！犹响应声，影之追形，终无免离，慎为恶也。」","佛言：「恶人害贤者，犹仰天而唾，唾不污天，还污己身；逆风坋人，尘不污彼，还坋于身。贤者不可毁，祸必灭己也。」","佛言：「夫人为道务博爱，博哀施德莫大施。守志奉道，其福甚大；覩人施道，助之欢喜，亦得福报。」","质曰：「彼福不当减乎？」","佛言：「犹若炬火，数千百人，各以炬来，取其火去，熟食、除冥；彼火如故，福亦如之。」","佛言：「饭凡人百不如饭一善人，饭善人千不如饭持五戒者一人，饭持五戒者万人不如饭一须陀洹，饭须陀洹百万不如饭一斯陀含，饭斯陀含千万不如饭一阿那含，饭阿那含一亿不如饭一阿罗汉，饭阿罗汉十亿不如饭辟支佛一人，饭辟支佛百亿不如以三尊之教度其一世二亲，教亲千亿不如饭一佛——学愿求佛，欲济众生也。饭善人福最深重，凡人事天地鬼神，不如孝其亲矣，二亲最神也。」","佛言：「天下有五难：贫穷布施难、豪贵学道难、制命不死难、得覩佛经难、生值佛世难。」","有沙门问佛：「以何缘得道？奈何知宿命？」","佛言：「道无形，知之无益，要当守志行；譬如磨镜，垢去明存，即自见形，断欲守空，即见道真，知宿命矣。」","佛言：「何者为善？唯行道善。何者最大？志与道合大。何者多力？忍辱最健，忍者无怨，必为人尊。何者最明？心垢除、恶行灭，内清净无瑕；未有天地，逮于今日，十方所有，未见之萌，得无不知、无不见、无不闻，得一切智，可谓明乎。」","佛言：「人怀爱欲不见道，譬如浊水，以五彩投其中，致力搅之，众人共临水上，无能覩其影者；爱欲交错，心中为浊，故不见道；水澄秽除，清净无垢，即自见形。猛火著釜下，中水踊跃，以布覆上，众生照临，亦无覩其影者；心中本有三毒涌沸在内，五盖覆外，终不见道；要心垢尽，乃知魂灵所从来，生死所趣向，诸佛国土、道德所在耳。」","佛言：「夫为道者，譬如持炬火入冥室中，其冥即灭而明犹在，学道见谛，愚痴都灭，得无不见。」","佛言：「吾何念念道？吾何行行道？吾何言言道？吾念谛道，不忽须臾也。」","佛言：「覩天地念非常，覩山川念非常，覩万物形体丰炽念非常；执心如此，得道疾矣。」","佛言：「一日行，常念道、行道，遂得信根，其福无量。」","佛言：「熟自念身中四大，名自有名都为无，吾我者寄生，生亦不久，其事如幻耳。」","佛言：「人随情欲求华名，譬如烧香，众人闻其香，然香以熏自烧；愚者贪流俗之名誉，不守道真，华名危己之祸，其悔在后时。」","佛言：「财色之于人，譬如小儿贪刀刃之蜜，甜不足一食之美，然有截舌之患也。」","佛言：「人系于妻子、宝宅之患，甚于牢狱、桎梏、锒铛。牢狱有原赦，妻子情欲虽有虎口之祸，己犹甘心投焉，其罪无赦。」","佛言：「爱欲莫甚于色，色之为欲，其大无外。赖有一矣，假其二，普天之民，无能为道者。」","佛言：「爱欲之于人，犹执炬火逆风而行。愚者不释炬，必有烧手之患。贪婬、恚怒、愚痴之毒，处在人身，不早以道除斯祸者，必有危殃，犹愚贪执炬，自烧其手也。」","天神献玉女于佛，欲以试佛意、观佛道。佛言：「革囊众秽，尔来何为？以可斯俗，难动六通。去！吾不用尔。」天神逾敬佛，因问道意；佛为解释，即得须陀洹。","佛言：「夫为道者，犹木在水，寻流而行，不左触岸，亦不右触岸；不为人所取，不为鬼神所遮，不为洄流所住，亦不腐败，吾保其入海矣。人为道，不为情欲所惑，不为众邪所诳，精进无疑，吾保其得道矣。」","佛告沙门：「慎无信汝意，意终不可信。慎无与色会，与色会即祸生。得阿罗汉道，乃可信汝意耳。」","佛告诸沙门：「慎无视女人，若见无视。慎无与言，若与言者，勅心正行，曰：『吾为沙门，处于浊世，当如莲花不为泥所污。老者以为母，长者以为姊，少者为妹，幼者子，敬之以礼。』意殊当谛惟观，自头至足自视内，彼身何有，唯盛恶露诸不净种，以释其意矣。」","佛言：「人为道去情欲，当如草见火，火来已却。道人见爱欲，必当远之。」","佛言：「人有患婬，情不止，踞斧刃上，以自除其阴。佛谓之曰：『若断阴不如断心，心为功曹，若止功曹，从者都息；邪心不止，断阴何益？斯须即死？』」佛言：「世俗倒见，如斯痴人。」","有婬童女与彼男誓，至期不来而自悔曰：「欲吾知尔本，意以思想生，吾不思想尔，即尔而不生。」佛行道闻之，谓沙门曰：「记之！此迦叶佛偈，流在俗间。」","佛言：「人从爱欲生忧，从忧生畏。无爱即无忧，不忧即无畏。」","佛言：「人为道，譬如一人与万人战，被钾、操兵、出门欲战，意怯胆弱乃自退走，或半道还，或格鬪而死，或得大胜还国高迁。夫人能牢持其心，精锐进行，不惑于流俗狂愚之言者，欲灭恶尽，必得道矣。」","有沙门夜诵经甚悲，意有悔疑，欲生思归。佛呼沙门问之：「汝处于家将何修为？」","对曰：「恒弹琴。」佛言：「弦缓何如？」曰：「不鸣矣。」「弦急何如？」曰：「声绝矣。」「急缓得中何如？」「诸音普悲。」佛告沙门：「学道犹然，执心调适，道可得矣。」","佛言：「夫人为道，犹所锻铁渐深，弃去垢，成器必好。学道以渐深，去心垢，精进就道。暴即身疲，身疲即意恼，意恼即行退，行退即修罪。」","佛言：「人为道亦苦，不为道亦苦。惟人自生至老，自老至病，自病至死，其苦无量。心恼积罪，生死不息，其苦难说。」","佛言：「夫人离三恶道得为人难；既得为人，去女即男难；既得为男，六情完具难；六情已具，生中国难；既处中国，值奉佛道难；既奉佛道，值有道之君难，生菩萨家难；既生菩萨家，以心信三尊、值佛世难。」","佛问诸沙门：「人命在几间？」对曰：「在数日间。」佛言：「子未能为道。」","复问一沙门：「人命在几间？」对曰：「在饭食间。」佛言：「子未能为道。」","复问一沙门：「人命在几间？」对曰：「呼吸之间。」佛言：「善哉！子可谓为道者矣。」","佛言：「弟子去，离吾数千里，意念吾戒必得道。在吾左侧，意在邪，终不得道。其实在行，近而不行，何益万分耶！」","佛言：「人为道，犹若食蜜，中边皆甜。吾经亦尔，其义皆快，行者得道矣。」","佛言：「人为道，能拔爱欲之根，譬如摘悬珠，一一摘之，会有尽时。恶尽，得道也。」","佛言：「诸沙门行道，当如牛负，行深泥中，疲极，不敢左右顾，趣欲离泥，以自苏息。沙门视情欲，甚于彼泥，直心念道可免众苦。」","佛言：「吾视诸侯之位如过客，视金玉之宝如砾石，视㲲素之好如弊帛。」"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0784",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0784.xml",sourceLabel:"CBETA T17n0784",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"四十二章經",juan:[1]},{id:"cbeta-t17n0779",title:"佛说八大人觉经",subtitle:"佛说八大人觉经 · 后汉 安世高译",paragraphs:["为佛弟子，常于昼夜，至心诵念，八大人觉：","第一觉悟：世间无常，国土危脆；四大苦空，五阴无我；生灭变异，虚伪无主；心是恶源，形为罪薮。如是观察，渐离生死。","第二觉知：多欲为苦，生死疲劳，从贪欲起；少欲无为，身心自在。","第三觉知：心无厌足，唯得多求，增长罪恶；菩萨不尔，常念知足，安贫守道，唯慧是业。","第四觉知：懈怠坠落；常行精进，破烦恼恶，摧伏四魔，出阴界狱。","第五觉悟：愚痴生死。菩萨常念，广学多闻，增长智慧，成就辩才，教化一切，悉以大乐。","第六觉知：贫苦多怨，横结恶缘。菩萨布施，等念冤亲，不念旧恶，不憎恶人。","第七觉悟：五欲过患。虽为俗人，不染世乐；常念三衣，瓦钵法器；志愿出家，守道清白；梵行高远，慈悲一切。","第八觉知：生死炽然，苦恼无量。发大乘心，普济一切；愿代众生，受无量苦；令诸众生，毕竟大乐。","如此八事，乃是诸佛菩萨大人之所觉悟。精进行道，慈悲修慧，乘法身船，至涅槃岸；复还生死，度脱众生。以前八事，开导一切，令诸众生，觉生死苦，舍离五欲，修心圣道。","若佛弟子，诵此八事，于念念中，灭无量罪；进趣菩提，速登正觉；永断生死，常住快乐。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0779",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0779.xml",sourceLabel:"CBETA T17n0779",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說八大人覺經",juan:[1]},{id:"cbeta-t15n0600",title:"十善业道经",subtitle:"十善业道经 · 唐 实叉难陀译",paragraphs:["如是我闻：","一时佛在娑竭罗龙宫，与八千大比丘众、三万二千菩萨摩诃萨俱。","尔时世尊告龙王言：「一切众生心想异故，造业亦异，由是故有诸趣轮转。龙王！汝见此会及大海中，形色种类各别不耶？如是一切，靡不由心造善不善身业、语业、意业所致。而心无色，不可见取，但是虚妄诸法集起，毕竟无主，无我、我所。虽各随业，所现不同，而实于中无有作者。故一切法皆不思议，自性如幻。智者知已，应修善业，以是所生蕴、处、界等，皆悉端正，见者无厌。","「龙王！汝观佛身，从百千亿福德所生，诸相庄严，光明显曜，蔽诸大众；设无量亿自在梵王，悉不复现。其有瞻仰如来身者，莫不目眩！汝又观此诸大菩萨，妙色严净，一切皆由修集善业福德而生。又诸天龙八部众等大威势者，亦因善业福德所生。今大海中所有众生，形色麁鄙，或大或小，皆由自心种种想念，作身、语、意诸不善业，是故随业各自受报。汝今当应如是修学，亦令众生了达因果，修习善业。汝当于此正见不动，勿复堕在断、常见中，于诸福田欢喜、敬养！是故，汝等亦得人天尊敬、供养。","「龙王！当知菩萨有一法，能断一切诸恶道苦。何等为一？谓于昼夜，常念、思惟、观察善法，令诸善法念念增长，不容毫分不善间杂。是即能令诸恶永断、善法圆满，常得亲近诸佛、菩萨及余圣众。言善法者，谓人天身、声闻菩提、独觉菩提、无上菩提，皆依此法以为根本而得成就，故名善法。此法即是十善业道。何等为十？谓能永离杀生、偷盗、邪行、妄语、两舌、恶口、绮语、贪欲、瞋恚、邪见。","「龙王！若离杀生，即得成就十离恼法。何等为十？一、于诸众生普施无畏；二、常于众生起大慈心；三、永断一切瞋恚习气；四、身常无病；五、寿命长远；六、恒为非人之所守护；七、常无恶梦，寝觉快乐；八、灭除怨结，众怨自解；九、无恶道怖；十、命终生天。是为十，若能回向阿耨多罗三藐三菩提者，后成佛时，得佛随心自在寿命。","「复次，龙王！若离偷盗，即得十种可保信法。何等为十？一者、资财盈积，王、贼、水、火，及非爱子，不能散灭；二、多人爱念；三、人不欺负；四、十方赞美；五、不忧损害；六、善名流布；七、处众无畏；八、财、命、色、力安乐，辩才具足无缺；九、常怀施意；十、命终生天。是为十，若能回向阿耨多罗三藐三菩提者，后成佛时，得证清净大菩提智。","「复次，龙王！若离邪行，即得四种智所赞法。何等为四？一、诸根调顺；二、永离諠掉；三、世所称叹；四、妻莫能侵。是为四，若能回向阿耨多罗三藐三菩提者，后成佛时，得佛丈夫隐密藏相。","「复次，龙王！若离妄语，即得八种天所赞法。何等为八？一、口常清净、优钵华香；二、为诸世间之所信伏；三、发言成证，人天敬爱；四、常以爱语安慰众生；五、得胜意乐，三业清净；六、言无误失，心常欢喜；七、发言尊重，人天奉行；八、智慧殊胜，无能制伏。是为八，若能回向阿耨多罗三藐三菩提者，后成佛时，即得如来真实语。","「复次，龙王！若离两舌，即得五种不可坏法。何等为五？一、得不坏身，无能害故；二、得不坏眷属，无能破故；三、得不坏信，顺本业故；四、得不坏法行，所修坚固故；五、得不坏善知识，不诳惑故。是为五，若能回向阿耨多罗三藐三菩提者，后成佛时，得正眷属，诸魔外道不能沮坏。","「复次，龙王！若离恶口，即得成就八种净业。何等为八？一、言不乖度；二、言皆利益；三、言必契理；四、言词美妙；五、言可承领；六、言则信用；七、言无可讥；八、言尽爱乐。是为八，若能回向阿耨多罗三藐三菩提者，后成佛时，具足如来梵音声相。","「复次，龙王！若离绮语，即得成就三种决定。何等为三？一、定为智人所爱；二、定能以智如实答问；三、定于人天威德最胜，无有虚妄。是为三，若能回向阿耨多罗三藐三菩提者，后成佛时，即得如来诸所授记，皆不唐捐。","「复次，龙王！若离贪欲，即得成就五种自在。何等为五？一、三业自在，诸根具足故；二、财物自在，一切怨贼不能夺故；三、福德自在，随心所欲，物皆备故；四、王位自在，珍奇妙物皆奉献故；五、所获之物，过本所求百倍殊胜，由于昔时不悭嫉故。是为五，若能回向阿耨多罗三藐三菩提者，后成佛时，三界特尊，皆共敬养。","「复次，龙王！若离瞋恚，即得八种喜悦心法。何等为八？一、无损恼心；二、无瞋恚心；三、无诤讼心；四、柔和质直心；五、得圣者慈心；六、常作利益安众生心；七、身相端严，众共尊敬；八、以和忍故，速生梵世。是为八，若能回向阿耨多罗三藐三菩提者，后成佛时，得无碍心，观者无厌。","「复次，龙王！若离邪见，即得成就十功德法。何等为十？一、得真善意乐、真善等侣；二、深信因果，宁殒身命，终不作恶；三、唯归依佛，非余天等；四、直心正见，永离一切吉凶疑网；五、常生人天，不更恶道；六、无量福慧，转转增胜；七、永离邪道，行于圣道；八、不起身见，舍诸恶业；九、住无碍见，十、不堕诸难。是为十，若能回向阿耨多罗三藐三菩提者，后成佛时，速证一切佛法，成就自在神通。」","尔时世尊复告龙王言：「若有菩萨依此善业，于修道时，能离杀害而行施故，常富财宝，无能侵夺；长寿无夭，不为一切怨贼损害。离不与取而行施故，常富财宝，无能侵夺；最胜无比，悉能备集诸佛法藏。离非梵行而行施故，常富财宝，无能侵夺；其家直顺，母及妻子无有能以欲心视者。离虚诳语而行施故，常富财宝，无能侵夺；离众毁谤，摄持正法，如其誓愿，所作必果。离离间语而行施故，常富财宝，无能侵夺；眷属和睦，同一志乐，恒无乖诤。离麁恶语而行施故，常富财宝，无能侵夺；一切众会，欢喜归依，言皆信受，无违拒者。离无义语而行施故，常富财宝，无能侵夺；言不虚设，人皆敬受，能善方便，断诸疑惑。离贪求心而行施故，常富财宝，无能侵夺；一切所有，悉以慧舍，信解坚固，具大威力。离忿怒心而行施故，常富财宝，无能侵夺；速自成就无碍心智，诸根严好，见皆敬爱。离邪倒心而行施故，常富财宝，无能侵夺；恒生正见敬信之家，见佛、闻法、供养众僧，常不忘失大菩提心。是为大士修菩萨道时，行十善业，以施庄严，所获大利如是。","「龙王！举要言之，行十善道，以戒庄严故，能生一切佛法义利，满足大愿；忍辱庄严故，得佛圆音，具众相好；精进庄严故，能破魔怨，入佛法藏；定庄严故，能生念、慧、惭、愧、轻安；慧庄严故，能断一切分别妄见；慈庄严故，于诸众生不起恼害；悲庄严故，愍诸众生，常不厌舍；喜庄严故，见修善者，心无嫌嫉；舍庄严故，于顺违境，无爱恚心；四摄庄严故，常勤摄化一切众生；念处庄严故，善能修习四念处观；正勤庄严故，悉能断除一切不善法，成一切善法；神足庄严故，恒令身心轻安、快乐；五根庄严故，深信坚固，精勤匪懈，常无迷忘，寂然调顺，断诸烦恼；力庄严故，众怨尽灭，无能坏者；觉支庄严故，常善觉悟一切诸法；正道庄严故，得正智慧常现在前；止庄严故，悉能涤除一切结使；观庄严故，能如实知诸法自性；方便庄严故，速得成满为、无为乐。","「龙王！当知此十善业，乃至能令十力、无畏、十八不共一切佛法皆得圆满。是故汝等应勤修学！龙王！譬如一切城邑、聚落，皆依大地而得安住；一切药草、卉木、丛林，亦皆依地而得生长。此十善道亦复如是，一切人、天依之而立，一切声闻、独觉菩提、诸菩萨行、一切佛法，咸共依此十善大地而得成就。」","佛说此经已，娑竭罗龙王及诸大众，一切世间天、人、阿修罗等，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T15n0600",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T15/T15n0600.xml",sourceLabel:"CBETA T15n0600",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"十善業道經",juan:[1]},{id:"cbeta-t12n0389",title:"佛垂般涅槃略说教诫经",subtitle:"佛垂般涅槃略说教诫经 · 姚秦 鸠摩罗什译",paragraphs:["释迦牟尼佛初转法轮，度阿若憍陈如，最后说法度须跋陀罗，所应度者皆已度讫，于娑罗双树间将入涅槃。是时中夜寂然无声，为诸弟子略说法要：「汝等比丘，于我灭后，当尊重珍敬波罗提木叉，如暗遇明、贫人得宝。当知此则是汝大师，若我住世无异此也。持净戒者，不得贩卖贸易、安置田宅、畜养人民奴婢畜生，一切种殖及诸财宝，皆当远离如避火坑。不得斩伐草木、垦土掘地，合和汤药、占相吉凶、仰观星宿推步盈虚、历数算计，皆所不应。节身时食清净自活，不得参预世事通致使命，呪术仙药、结好贵人亲厚媟嫚，皆不应作。当自端心正念求度，不得苞藏瑕疵、显异惑众。于四供养知量知足，趣得供事不应稸积。此则略说持戒之相。戒是正顺解脱之本，故名波罗提木叉。依因此戒，得生诸禅定及灭苦智慧。是故比丘，当持净戒勿令毁犯。若人能持净戒，是则能有善法；若无净戒，诸善功德皆不得生。是以当知，戒为第一安隐功德之所住处。","「汝等比丘，已能住戒当制五根，勿令放逸入于五欲，譬如牧牛之人执杖视之，不令纵逸犯人苗稼。若纵五根，非唯五欲将无崖畔不可制也，亦如恶马不以辔制，将当牵人坠于坑陷。如被劫害苦止一世，五根贼祸殃及累世，为害甚重，不可不慎。是故智者制而不随，持之如贼不令纵逸；假令纵之，皆亦不久见其磨灭。此五根者，心为其主。是故汝等当好制心，心之可畏甚于毒蛇、恶兽、怨贼，大火越逸，未足喻也。譬如有人，手执蜜器，动转轻躁，但观于蜜不见深坑，譬如狂象无钩、猿猴得树，腾跃跳踯，难可禁制，当急挫之无令放逸。纵此心者丧人善事，制之一处无事不办。是故比丘，当勤精进折伏其心。","「汝等比丘，受诸饮食当如服药，于好于恶勿生增减，趣得支身以除饥渴。如蜂采花，但取其味不损色香；比丘亦尔，受人供养取自除恼，无得多求坏其善心。譬如智者筹量牛力所堪多少，不令过分以竭其力。","「汝等比丘，昼则勤心修习善法，无令失时，初夜后夜亦勿有废，中夜诵经以自消息，无以睡眠因缘令一生空过无所得也。当念无常之火烧诸世间，早求自度勿睡眠也。诸烦恼贼常伺杀人，甚于怨家，安可睡眠不自惊寤？烦恼毒蛇睡在汝心，譬如黑蚖在汝室睡，当以持戒之钩早摒除之。睡蛇既出乃可安眠，不出而眠是无惭人也。惭耻之服，于诸庄严最为第一，惭如铁钩，能制人非法。是故比丘，常当惭耻，无得暂替；若离惭耻则失诸功德。有愧之人则有善法；若无愧者，与诸禽兽无相异也。","「汝等比丘，若有人来节节支解，当自摄心无令瞋恨，亦当护口勿出恶言；若纵恚心，则自妨道、失功德利。忍之为德，持戒苦行所不能及。能行忍者，乃可名为有力大人；若其不能欢喜忍受恶骂之毒如饮甘露者，不名入道智慧人也。所以者何？瞋恚之害能破诸善法、坏好名闻，今世后世人不憙见。当知瞋心甚于猛火，常当防护无令得入，劫功德贼无过瞋恚。白衣受欲非行道人，无法自制，瞋犹可恕；出家行道无欲之人，而怀瞋恚，甚不可也。譬如清冷云中霹雳起火，非所应也。","「汝等比丘，当自摩头，已舍饰好著坏色衣，执持应器以乞自活，自见如是，若起憍慢当疾灭之。谓长憍慢尚非世俗白衣所宜，何况出家入道之人为解脱故，自降其心而行乞耶？","「汝等比丘，谄曲之心与道相违，是故宜应质直其心。当知谄曲但为欺诳，入道之人则无是处。是故汝等宜应端心，以质直为本。","「汝等比丘，当知多欲之人多求利故，苦恼亦多；少欲之人无求无欲，则无此患。直尔少欲尚应修习，何况少欲能生诸善功德？少欲之人则无谄曲以求人意，亦复不为诸根所牵。行少欲者，心则坦然无所忧畏，触事有余常无不足，有少欲者则有涅槃。是名少欲。","「汝等比丘，若欲脱诸苦恼，当观知足，知足之法即是富乐安隐之处。知足之人，虽卧地上犹为安乐；不知足者，虽处天堂亦不称意。不知足者虽富而贫，知足之人虽贫而富。不知足者常为五欲所牵，为知足者之所怜愍。是名知足。","「汝等比丘，若求寂静无为安乐，当离愦閙、独处闲居，静处之人帝释诸天所共敬重。是故当舍己众他众，空闲独处思灭苦本。若乐众者则受众恼，譬如大树众鸟集之，则有枯折之患。世间缚著没于众苦，譬如老象溺泥不能自出。是名远离。","「汝等比丘，若勤精进则事无难者，是故汝等当勤精进，譬如小水常流则能穿石。若行者之心数数懈废，譬如钻火未热而息，虽欲得火，火难可得。是名精进。","「汝等比丘，求善知识、求善护助而不忘念；若不忘念者，诸烦恼贼则不能入。是故汝等常当摄念在心，若失念者则失诸功德。若念力坚强，虽入五欲贼中不为所害，譬如著铠入阵则无所畏。是名不忘念。","「汝等比丘，若摄心者心则在定，心在定故能知世间生灭法相。是故汝等常当精勤修集诸定，若得定者心则不乱，譬如惜水之家善治堤塘；行者亦尔，为智慧水故，善修禅定令不漏失。是名为定。","「汝等比丘，若有智慧则无贪著，常自省察不令有失，是则于我法中能得解脱；若不尔者，既非道人又非白衣，无所名也。实智慧者，则是度老病死海坚牢船也，亦是无明黑暗大明灯也，一切病苦之良药也，伐烦恼树者之利斧也。是故汝等当以闻、思、修慧而自增益；若人有智慧之照，虽无天眼而是明见人也。是为智慧。","「汝等比丘，若种种戏论其心则乱，虽复出家犹未得脱。是故比丘，当急舍离乱心戏论；若汝欲得寂灭乐者，唯当善灭戏论之患。是名不戏论。","「汝等比丘，于诸功德常当一心，舍诸放逸如离怨贼。大悲世尊所欲利益皆以究竟，汝等但当勤而行之。若在山间、若空泽中、若在树下、闲处静室，念所受法勿令忘失，常当自勉精进修之，无为空死后致忧悔。我如良医，知病说药，服与不服，非医咎也。又如善导，导人善道，闻之不行，非导过也。汝等若于苦等四谛有所疑者，可疾问之，无得怀疑不求决也。」","尔时世尊如是三唱，人无问者。所以者何？众无疑故。","尔时阿㝹楼驮观察众心而白佛言：「世尊！月可令热，日可令冷，佛说四谛不可令异。佛说苦谛真实是苦，不可令乐；集真是因，更无异因；苦若灭者即是因灭，因灭故果灭。灭苦之道实是真道，更无余道。世尊！是诸比丘于四谛中决定无疑。于此众中所作未办者，见佛灭度当有悲感，若有初入法者，闻佛所说即皆得度，譬如夜见电光即得见道；若所作已办、已度苦海者，但作是念：『世尊灭度，一何疾哉！』」","阿㝹楼驮虽说是语，众中皆悉了达四圣谛义。世尊欲令此诸大众皆得坚固，以大悲心复为众说：","「汝等比丘，勿怀忧恼。若我住世一劫会亦当灭，会而不离终不可得。自利利人法皆具足，若我久住更无所益。应可度者，若天上人间皆悉已度，其未度者，皆亦已作得度因缘。自今已后，我诸弟子展转行之，则是如来法身常在而不灭也。是故当知，世皆无常，会必有离，勿怀忧也。世相如是，当勤精进早求解脱，以智慧明灭诸痴暗。世实危脆无牢强者，我今得灭如除恶病。此是应舍罪恶之物，假名为身，没在生老病死大海，何有智者得除灭之，如杀怨贼而不欢喜？","「汝等比丘，常当一心勤求出道，一切世间动不动法，皆是败坏不安之相。汝等且止，勿得复语，时将欲过，我欲灭度，是我最后之所教诲。」"],source:"https://cbetaonline.dila.edu.tw/zh/T12n0389",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T12/T12n0389.xml",sourceLabel:"CBETA T12n0389",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛垂般涅槃略說教誡經",juan:[1]},{id:"cbeta-t02n0112",title:"佛说八正道经",subtitle:"佛说八正道经 · 后汉 安世高译",paragraphs:["闻如是：","一时，佛在舍卫国祇树给孤独园。佛告诸弟子：「听我说邪道亦说正道。何等为邪道？不谛见、不谛念、不谛语、不谛治、不谛求、不谛行、不谛意、不谛定。是为道八邪行。","「何等为道八正行？一者谛见。谛见为何等？信布施、信礼、信祠、信善恶行自然福、信父母、信天下道人、信求道、信谛行、信谛受。今世后世，自黠得证自成。便相告说是为谛见。","「第二谛念为何等？所意弃欲、弃家、不瞋恚怒、不相侵，是为谛念。","「第三谛语为何等？不两舌、不传语、不恶骂、不妄语，是为谛语。","「第四谛行为何等？不杀盗婬，是为谛行。","「第五谛受为何等？是闻有道弟子法求，不可非法，饭食、床卧、病瘦正法求，不可非法，是为谛受。","「第六谛治为何等？生死意共合行，所精进行，出力因缘行，乃精进不厌意持，是为谛治。","「第七谛意为何等？生死行合意念、向意念，不妄不共意求，是名为谛意。","「第八谛定为何等？生死意合，念止、相止、护已止、聚止。不可为、不作所有罪，不堕中庭。是名为谛定。","「比丘！所有道弟子，当受是八种行谛道，如说行可得道八行觉。谛见者信布施，后世得具福，信礼者见沙门道人作礼福，信祠者悬缯烧香散花然灯，信所行十善是为自然得福，信父母者信孝顺，信天下道人者喜受经，信求道者为行道。信谛行者断恶意，信谛受者不犯戒。今世后世，自黠为得黠，能教人得证，自成者能成人。能成他人，便相告说，是名为谛见知。如是便自脱亦脱他人。","「第二谛念所意起者为失意，欲弃家者为念道，不瞋恚怒者为忍辱，不相侵者当正意。","「第三谛语者，不恶骂不犯口四过，但说至诚道品谛要。","「第四谛行者，不杀盗婬而行诚信。","「第五谛不堕贪者，但求一衣一食为贱医。","「第六谛治者为向三十七品经。","「第七谛意者日增三十七品经，不离意。","「第八谛止者不忘因缘，止者常还意护，已止者一切无所犯，聚止者得福道。」","佛说如是。皆欢喜受。"],source:"https://cbetaonline.dila.edu.tw/zh/T02n0112",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T02/T02n0112.xml",sourceLabel:"CBETA T02n0112",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說八正道經",juan:[1]},{id:"cbeta-t01n0027",title:"七知经",subtitle:"七知经 · 吴 支谦译",paragraphs:["闻如是：","佛游于舍卫祇树给孤独园。佛告诸比丘：「比丘受教，从佛而听。」","佛告诸比丘：「有七法道弟子，现世安隐和悦多行，精进法观令习得尽。何谓七法？一知法，二知义，三知时，四知节，五自知，六知众，七知人。","「诸比丘！何谓知法？谓能解十二部经：一曰文，二曰歌，三曰说，四曰颂，五曰譬喻，六曰本起纪，七曰事解，八曰生传，九曰广博，十曰自然，十一曰行，十二曰章句，是为知法。不解十二部经，为不知法。","「何谓知义？彼彼所说经法，悉晓其义，是为知义。彼彼所说不晓不解，为不知义。","「何谓知时？知是时可惟寂灭想，是时不惟受行想，是时可惟慎护想，是为知时。不晓时宜所行，为不知时。","「何谓知节？能少饮食大小便便得消化，能节出入坐起行步，卧觉语默事从约省，是为知节。不自约省，为不知节。","「何谓自知？自知己身意老多少，所信所戒、所闻所施、所慧所解、所至所入，深浅厚薄事事自知，是为自知。不知己意所入多少，为不自知。","「何谓知众？能知彼众若君子众、若理家众，若梵志、若沙门众，若或有时至彼众，宜坐宜立、宜语宜默，知随时宜，是为知众。不知相彼众随时宜者，为不知众。","「何谓知人？如有两人，一人信道、一人不信道，信道者可称誉，不信者无称誉。信道有两辈：一人数诣道场乐沙门，一人不数诣道场智略沙门。数诣者可称誉，不数诣者无称誉。数诣道场有两辈：一人爱敬沙门，一人不爱敬沙门。爱敬者可称誉，不爱敬者无称誉。爱敬有两辈：一人亲习沙门，一人不亲习沙门。亲习者可称誉，不亲习者无称誉。亲习有两辈：一人好问经法，一人不好问经法。好问者可称誉，不好问者无称誉。好问有两辈：一人侧耳听，一人不侧耳听。侧耳听者可称誉，不侧耳听者无称誉。侧耳听有两辈：一人闻法受持，一人闻法不受持。闻法受持者可称誉，不受持者无称誉。受持有两辈：一人闻而思义，一人闻不思义。闻而思义者可称誉，闻而不思义者无称誉。闻法思义有两辈：一人如经义解，受法如法立，一人不如经义解，不受法不如法立。如经义解者可称誉，不如经义解者无称誉。如经义解有两辈：一人但自安己，不安他人、不多安人、不哀世间、不利天下，一人自能安己，亦安他人多安天下，愍伤世间利宁天人。诸比丘当别知，其自安己、能安他人、多安天下、愍伤世间利宁天下者，是人为最上最长最尊极尊。譬如牛乳成酪，酪为酥，酥为醍醐，醍醐最上。如是人者，为人中之人，乃为上行、尊行、极尊之行，为最胜为上愿无上也。诸比丘！能见两人，为智为高，能分别此人善、此人胜，是为知人。」","佛说是已，皆欢喜受。"],source:"https://cbetaonline.dila.edu.tw/zh/T01n0027",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T01/T01n0027.xml",sourceLabel:"CBETA T01n0027",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"七知經",juan:[1]},{id:"cbeta-t02n0109",title:"佛说转法轮经",subtitle:"佛说转法轮经 · 后汉 安世高译",paragraphs:["闻如是：","一时，佛在波罗㮈国鹿野树下坐，时有千比丘诸天神，皆大会侧塞空中，于是有自然法轮，飞来当佛前转。佛以手抚轮曰：「止！往者吾从无数劫来，为名色转受苦无量，今者痴爱之意已止，漏结之情已解，诸根已定生死已断，不复转于五道也。」轮即止。","于是，佛告诸比丘：「世间有二事堕边行，行道弟子舍家者，终身不当与从事。何等二？一为念在贪欲无清净志，二为猗著身爱不能精进。是故退边行，不得值佛道德具人。若此比丘不念贪欲著身爱行，可得受中，如来最正觉得眼得慧，从两边度自致泥洹。何谓受中？谓受八直之道，一曰正见，二曰正思，三曰正言，四曰正行，五曰正命，六曰正治，七曰正志，八曰正定。若诸比丘本末闻道，当已知甚苦为真谛，已一心受眼受禅思受慧见，觉所念令意解，当知甚苦习尽为真谛，已受眼观禅思慧见，觉所念令意解，如是尽真谛。何谓为苦？谓生老苦、病苦，忧、悲、恼苦，怨憎会苦，所爱别苦，求不得苦，要从五阴受盛为苦。何谓苦习？谓从爱故而令复有乐性，不离在在贪憙，欲爱、色爱、不色之爱，是习为苦。何谓苦尽？谓觉从爱复有所乐，婬念不受，不念无余无婬，舍之无复禅，如是为习尽。何谓苦习尽欲受道？谓受行八直道，正见、正思、正言、正行、正命、正治、正志、正定，是为苦习尽受道真谛也。","「又是，比丘！苦为真谛，苦由习为真谛，苦习尽为真谛，苦习尽欲受道为真谛，若本在昔未闻是法者，当受眼观禅行受慧见受觉念令意得解。若令在斯未闻是四谛法者，当受道眼、受禅思、受慧觉，令意行解。若诸在彼不得闻是四谛法者，亦当受眼、受禅、受慧、受觉，令意得解，是为四谛三转合十二事，知而未净者吾不与也。一切世间诸天人民，若梵、若魔、沙门、梵志，自知证已，受行戒、定、慧、解、度知见成，是为四极。是生后不复有，长离世间无复忧患。」佛说是时，贤者阿若拘邻等及八千姟天，皆远尘离垢诸法眼生。其千比丘漏尽意解，皆得阿罗汉，及上诸习法应当尽者一切皆转。众祐法轮声三转，诸天世间在法地者莫不遍闻，至于第一四天王、忉利天、焰天、兜术天、不骄乐天、化应声天，至诸梵界须臾遍闻。尔时，佛界三千日月万二千天地皆大震动，是为佛众祐，始于波罗㮈以无上法轮转未转者，照无数度诸天人从是得道。","佛说是已，皆大欢喜。"],source:"https://cbetaonline.dila.edu.tw/zh/T02n0109",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T02/T02n0109.xml",sourceLabel:"CBETA T02n0109",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說轉法輪經",juan:[1]},{id:"cbeta-t02n0116",title:"佛说戒德香经",subtitle:"佛说戒德香经 · 东晋 竺昙无兰译",paragraphs:["闻如是：","一时，佛游舍卫国祇树给孤独园。时，贤者阿难闲居独思：「世有三香，一曰根香，二曰枝香，三曰华香，是三品香唯随风香不能逆风，宁有雅香随风逆风者乎？」贤者阿难独处思惟此义所归，不知所趣，即从坐起往诣佛所，稽首佛足下，长跪叉手而白佛言：「我独处思惟，世有三香，一曰根香，二曰枝香，三曰华香，此三品香唯能随风不能逆风，宁有雅香随风逆风者乎？」","佛告阿难：「善哉！善哉！诚如汝问，有香真正随风逆风。」","阿难白佛：「愿闻其香。」","佛言：「若于郡国县邑村落，有善男子善女人，修行十善，身不杀、盗、淫，口不妄言、两舌、恶口、绮语，意不嫉妬、恚、痴，孝顺父母，奉事三尊，仁慈道德威仪礼节，东方无数沙门梵志歌颂其德，南西北方四维上下沙门梵志咸歌其德：『某郡国土县邑村落，有善男子善女人，奉行十善敬事三宝，孝顺仁慈道德恩义不失礼节。』是香名曰随风逆风靡不周照，十方宣德一切蒙赖。」","佛时颂曰：",`「虽有美香花，　不能逆风熏，
不息名栴檀，　众雨一切香。
志性能和雅，　尔乃逆风香，
正士名丈夫，　普熏于十方。
木蜜及栴檀，　青莲诸雨香，
一切此众香，　戒香最无上。
是等清净者，　所行无放逸，
不知魔径路，　不见所归趣。
此道至永安，　此道最无上，
所获断秽源，　降伏绝魔网。
用上佛道堂，　升无穷之慧，
以此宣经义，　除去一切弊。」`,"佛告阿难：「是香所布，不碍须弥山川天地，不碍四种地水火风，通达八极上下亦然，无穷之界咸歌其德。一身不杀生，世世长寿，其命无横。不盗窃者，世世富饶又不妄遗财宝常存，施为道根。不婬色者，人不犯妻，所在化生莲华之中。不妄言者，口气香好言辄信之。不两舌者，家常和合无有别离。不恶口者，其舌常好言辞辩通。不绮语者，人闻其言莫不咨受宣用为珍。不嫉妬者，世世所生众人所敬。不瞋恚者，世世端正人见欢喜。除愚痴者，所生智慧靡不咨请，舍于邪见常住正道，从行所得各自然生，故当弃邪从其真妙。」","佛说如是。时，诸比丘闻之欢喜，作礼而去。"],source:"https://cbetaonline.dila.edu.tw/zh/T02n0116",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T02/T02n0116.xml",sourceLabel:"CBETA T02n0116",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說戒德香經",juan:[1]},{id:"cbeta-t02n0124",title:"缘起经",subtitle:"缘起经 · 唐 玄奘译",paragraphs:["如是我闻：","一时，薄伽梵在室罗筏，住誓多林给孤独园，与无量无数声闻、菩萨、天人等俱。尔时，世尊告苾刍众：「吾当为汝宣说缘起初差别义，汝应谛听，极善思惟，吾今为汝分别解说。」","苾刍众言：「唯然愿说，我等乐闻。」","佛言：「云何名缘起初？谓依此有故彼有，此生故彼生，所谓无明缘行，行缘识，识缘名色，名色缘六处，六处缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死，起愁叹苦忧恼，是名为纯大苦蕴集，如是名为缘起初义。","「云何名为缘起差别？谓无明缘行者，云何无明？谓于前际无知，于后际无知，于前后际无知；于内无知，于外无知，于内外无知；于业无知，于异熟无知，于业异熟无知；于佛无知，于法无知，于僧无知；于苦无知，于集无知，于灭无知，于道无知；于因无知，于果无知，于因已生诸法无知；于善无知，于不善无知；于有罪无知，于无罪无知；于应修习无知，于不应修习无知；于下劣无知；于上妙无知；于黑无知，于白无知；于有异分无知，于缘已生或六触处，如实通达无知。如是于彼彼处如实无知，无见无现观，愚痴无明黑暗，是谓无明。云何为行？行有三种，谓身行、语行、意行，是名为行。","「行缘识者，云何为识？谓六识身，一者眼识，二者耳识，三者鼻识，四者舌识，五者身识，六者意识，是名为识。","「识缘名色者，云何为名？谓四无色蕴：一者受蕴，二者想蕴，三者行蕴，四者识蕴。云何为色？谓诸所有色，一切四大种，及四大种所造，此色前名总略为一，合名名色，是谓名色。","「名色缘六处者，云何六处？谓六内处：一眼内处，二耳内处，三鼻内处，四舌内处，五身内处，六意内处，是谓六处。","「六处缘触者，云何为触？谓六触身：一者眼触，二者耳触，三者鼻触，四者舌触，五者身触，六者意触，是名为触。","「触缘受者，云何为受？受有三种，谓乐受、苦受、不苦不乐受，是名为受。","「受缘爱者，云何为爱？爱有三种，谓欲爱、色爱、无色爱，是名为爱。","「爱缘取者，云何为取？谓四取：一者欲取，二者见取，三者戒禁取，四者我语取，是名为取。","「取缘有者，云何为有？有有三种，谓欲有、色有、无色有，是名为有。","「有缘生者，云何为生？谓彼彼有情，于彼彼有情类，诸生、等生、趣、起、出、现、蕴得界得、处得，诸蕴生起，命根出现，是名为生。","「生缘老死者，云何为老？谓发衰变，皮肤缓皱，衰熟损坏，身脊伛曲黑黡间身，喘息奔急，形貌偻前，凭据策杖，惛昧羸劣，损减衰退，诸根耄熟，功用破坏，诸行朽故，其形腐败，是名为老。云何为死？谓彼彼有情，从彼彼有情类，终尽坏没，舍寿舍煖，命根谢灭，弃舍诸蕴，死时运尽，是名为死。此死前老总略为一，合名老死，如是名为缘起差别义。","「苾刍！我已为汝等说所标缘起初差别义。」","时薄伽梵说是经已，声闻、菩萨、天人等众，闻佛所说皆大欢喜，得未曾有，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T02n0124",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T02/T02n0124.xml",sourceLabel:"CBETA T02n0124",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"緣起經",juan:[1]},{id:"cbeta-t04n0210",title:"法句经",subtitle:"法句经 · 法救撰　吴 维祇难等译",paragraphs:["无常品第一二十有一章","无常品者，寤欲昏乱，荣命难保，唯道是真。",`睡眠解寤，　宜欢喜思，　听我所说，
撰记佛言。　所行非常，　谓兴衰法，
夫生輙死，　此灭为乐。　譬如陶家，
埏埴作器，　一切要坏；　人命亦然。
如河驶流，　往而不返；　人命如是，
逝者不还。　譬人操杖，　行牧食牛；
老死犹然，　亦养命去。　千百非一，
族姓男女，　贮聚财产，　无不衰丧。
生者日夜，　命自攻削，　寿之消尽，
如𢄋䨍水。　常者皆尽，　高者亦堕，
合会有离，　生者有死。　众生相克，
以丧其命，　随行所堕，　自受殃福。
老见苦痛，　死则意去；　乐家缚狱，
贪世不断。　咄嗟老至，　色变作耄；
少时如意，　老见蹈藉。　虽寿百岁，
亦死过去；　为老所厌，　病条至际。
是日已过，　命则随减，　如少水鱼，
斯有何乐？　老则色衰，　所病自坏，
形败腐朽，　命终自然。　是身何用？
恒漏臭处，　为病所困，　有老死患。
嗜欲自恣，　非法是增，　不见闻变，
寿命无常。　非有子恃，　亦非父兄，
为死所迫，　无亲可怙。　昼夜慢惰，
老不止婬，　有财不施，　不受佛言。
有此四弊，　为自侵欺。`,`非空非海中，　非入山石间，
无有地方所，　脱之不受死。
是务是吾作，　当作令致是，
人为此𮜒扰，　履践老死忧。
知此能自净，　如是见生尽，
比丘厌魔兵，　从生死得度。`,"教学品法句经第二二十有九章","教学品者，导以所行，释己愚暗，得见道明。",`咄哉！何为寐？　螉螺蜯蠧类，
隐弊以不净，　迷惑计为身。
焉有被斫创，　心如婴疾痛，
遘于众厄难，　而反为用眠？
思而不放逸，　为仁学仁迹，
从是无有忧，　常念自灭意。
正见学务增，　是为世间明，
所生福千倍，　终不堕恶道。`,`莫学小道，　以信邪见，　莫习放荡，
令增欲意；　善修法行，　学诵莫犯，
行道无忧，　世世常安。　慜学摄身，
常慎思言，　是到不死，　行灭得安。
非务勿学，　是务宜行，　已知可念，
则漏得灭。　见法利身，　夫到善方，
知利健行，　是谓贤明。　起觉义者，
学灭以固，　着灭自恣，　损而不兴。
是向以强，　是学得中，　从是解义，
宜忆念行。　学先断母，　率君二臣，
废诸营从，　是上道人。　学无朋类，
不得善友，　宁独守善，　不与愚偕。
乐戒学行，　奚用伴为？　独善无忧，
如空野象。　戒闻俱善，　二者孰贤？
方戒称闻，　宜谛学行。　学先护戒，
开闭必固，　施而无受，　仂行勿卧。`,`若人寿百岁，　邪学志不善，
不如生一日，　精进受正法。
若人寿百岁，　奉火修异术，
不如须臾顷，　事戒者福称。
能行说之可，　不能勿空语，
虚伪无诚信，　智者所屏弃。
学当先求解，　观察别是非，
受谛应诲彼，　慧然不复惑。
被发学邪道，　草衣内贪浊，
曚曚不识真，　如聋听五音。
学能舍三恶，　以药消众毒，
健夫度生死，　如蛇脱故皮。`,`学而多闻、　持戒不失，　两世见誉，
所愿者得；　学而寡闻、　持戒不完，
两世受痛，　丧其本愿。　夫学有二：
常亲多闻、　安谛解义，　虽困不邪。
稊稗害禾，　多欲妨学，　耘除众恶，
成收必多。　虑而后言，　辞不强梁，
法说义说，　言而莫违。　善学无犯，
畏法晓忌，　见微知者，　诫无后患。
远舍罪福，　务成梵行，　终身自摄，
是名善学。`,"多闻品法句经第三十有九章","多闻品者，亦劝闻学，积闻成圣，自致正觉。",`多闻能持固，　奉法为垣墙，
精进难逾毁，　从是戒慧成；
多闻令志明，　已明智慧增，
智则博解义，　见义行法安；
多闻能除忧，　能以定为欢，
善说甘露法，　自致得泥洹。
闻为知法律，　解疑亦见正，
从闻舍非法，　行到不死处。
为能师现道，　解疑令学明，
亦兴清净本，　能奉持法藏。
能摄为解义，　解则义不穿，
受法猗法者，　从是疾得安。
若多少有闻，　自大以憍人，
是如盲执烛，　炤彼不自明。
夫求爵位财，　尊贵升天福，
辩慧世间悍，　斯闻为第一。
帝王聘礼闻，　天上天亦然，
闻为第一藏，　最富旅力强。
智者为闻屈，　好道者亦乐，
王者尽心事，　虽释梵亦然。
仙人常敬闻，　况贵巨富人？
是以慧为贵，　可礼无过是。
事日为明故，　事父为恩故，
事君以力故，　闻故事道人。
人为命事医，　欲胜依豪强，
法在智慧处，　福行世世明。
察友在为谋，　别伴在急时；
观妻在房乐，　欲知智在说。
闻为今世利，　妻子、昆弟、友，
亦致后世福，　积闻成圣智。
是能散忧恚，　亦除不祥衰，
欲得安隐吉，　当事多闻者。
斫创无过忧，　射箭无过愚，
是壮莫能拔，　唯从多闻除。
盲从是得眼，　暗者从得烛，
亦导世间人，　如目将无目。
是故可舍痴，　离慢豪富乐，
务学事闻者，　是名积聚德。`,"笃信品法句经第四十有八章","笃信品者，立道之根，果于因正见，行不回顾。",`信惭戒意财，　是法雅士誉，
斯道明智说，　如是升天世。
愚不修天行，　亦不誉布施，
信施助善者，　从是到彼安。
信者真人长，　念法所住安；
近者意得上，　智寿寿中贤。`,`信能得道，　法致灭度，　从闻得智，
所到有明；　信能度渊，　摄为船师，
精进除苦，　慧到彼岸。　士有信行，
为圣所誉，　乐无为者，　一切缚解。
信之与戒，　慧意能行，　健夫度恚，
从是脱渊。　信使戒诚，　亦受智慧，
在在能行、　处处见养。　比方世利，
慧信为明，　是财上宝，　家产非常。
欲见诸真，　乐听讲法，　能舍悭垢，
此之为信。　信能度河，　其福难夺，
能禁止盗，　野沙门乐。　无信不习，
好剥正言，　如拙取水，　掘泉扬泥。
贤夫习智，　乐仰清流，　如善取水，
思令不扰。　信不染他，　唯贤与人，
可好则学、　非好则远。　信为我舆，
莫知斯载，　如大象调，　自调最胜。
信财、戒财，　惭、愧亦财，　闻财、施财、
慧为七财。　从信守戒，　常净观法，
慧而利行，　奉敬不忘。　生有此财，
不问男女，　终以不贫，　贤者识真。`,"戒慎品法句经第五十有六章","诫慎品者，授与善道，禁制邪非，后无所悔也。",`人而常清，　奉律至终，　净修善行，
如是戒成。　慧人护戒，　福致三宝，
名闻得利，　后上天乐。　常见法处，
护戒为明，　得成真见，　辈中吉祥。
持戒者安，　令身无恼，　夜卧恬淡，
寤则常欢。　修戒、布施，　作福为福，
从是适彼，　常到安处。　何终为善？
何善安止？　何为人宝？　何盗不取？
戒终老安，　戒善安止，　慧为人宝，
福盗不取。　比丘立戒，　守摄诸根，
食知自节，　悟意令应。　以戒降心，
守意正定，　内学正观，　无忘正智。
明哲守戒，　内思正智，　行道如应，
自清除苦。　蠲除诸垢，　尽慢勿生，
终身求法，　勿暂离圣。　戒、定、慧解，
是当善惟，　都已离垢，　无祸除有。
着解则度，　余不复生，　越诸魔界，
如日清明。　狂惑自恣，　已常外避，
戒、定、慧行，　求满勿离。　持戒清净，
心不自恣，　正智已解，　不覩邪部。
是往吉处，　为无上道，　亦舍非道，
离诸魔界。`,"惟念品法句经第六十有二章","惟念品者，守微之始，内思安般，必解道纪。",`出息、入息念，　具满谛思惟，
从初竟通利，　安如佛所说。
是则炤世间，　如云解月现，
起止学思惟，　坐卧不废忘。
比丘立是念，　前利后则胜，
始得终必胜，　逝不覩生死。
若见身所住，　六更以为最，
比丘常一心，　便自知泥洹。
已有是诸念，　自身常建行，
若其不如是，　终不得意行。
是随本行者，　如是度爱劳，
若能悟意念，　知解一心乐。
应时等行法，　是度老死恼，
比丘悟意行，　当令应是念。
诸念生死弃，　为能作苦际，
常当听微妙，　自觉悟其意。
能觉者为贤，　终始无所会，
以觉意能应，　日夜务学行，
当解甘露要，　令诸漏得尽。
夫人得善利，　乃来自归佛，
是故当昼夜，　常念佛法众。
己知自觉意，　是为佛弟子，
常当昼夜念，　佛与法及僧。
念身、念非常、　念戒、布施德，
空、不愿、无相，　昼夜当念是。`,"慈仁品法句经第七十有八章","慈仁品者，是谓大人、圣人所履，德普无量。",`为仁不杀，　常能摄身，　是处不死，
所适无患；　不杀为仁，　慎言守心，
是处不死，　所适无患。　彼乱已整，
守以慈仁，　见怒能忍，　是为梵行；
至诚安徐，　口无麤言，　不瞋彼所，
是谓梵行；　垂拱无为，　不害众生，
无所娆恼，　是应梵行。　常以慈哀，
净如佛教，　知足、知止，　是度生死。
少欲好学，　不惑于利，　仁而不犯，
世上所称。　仁寿无犯，　不兴变快，
人为诤扰，　慧以默安。　普忧贤友，
哀加众生，　常行慈心，　所适者安。
仁儒不邪，　安止无忧，　上天卫之；
智者乐慈，　昼夜念慈，　心无尅伐，
不害众生。　是行无仇，　不慈则杀，
违戒言妄，　过不与他。　不观众生，
酒致失志，　为放逸行，　后堕恶道。
无诚不真，　履仁行慈，　博爱济众，
有十一誉：　福常随身、　卧安、觉安、
不见恶梦、　天护、人爱、　不毒、不兵、
水火不丧、　在所得利、　死升梵天，
是为十一。　若念慈心，　无量不废，
生死渐薄，　得利度世。　仁无乱志，
慈最可行，　愍伤众生，　此福无量。`,`假令尽寿命，　懃事天下人，
象马以祠天，　不如行一慈。`,"言语品法句经第八十有二章","言语品者，所以戒口，发说、谈论当用道理。",`恶言骂詈，　憍陵蔑人，　兴起是行，
疾怨滋生；　逊言顺辞，　尊敬于人，
弃结忍恶，　疾怨自灭。　夫士之生，
斧在口中，　所以斩身，　由其恶言。
诤为少利，　如掩失财，　从彼致诤，
令意向恶。`,`誉恶、恶所誉，　是二俱为恶，
好以口侩鬪，　是后皆无安。
无道堕恶道，　自增地狱苦，
远愚修忍意，　念谛则无犯。
从善得解脱，　为恶不得解，
善解者为贤，　是为脱恶恼。
解自挹损意，　不躁言得中，
义说如法说，　是言柔软甘。
是以言语者，　必使己无患，
亦不尅众人，　是为能善言。
言使投意可，　亦令得欢喜，
不使至恶意，　出言众悉可。
至诚甘露说，　如法而无过，
谛如义、如法，　是为近道立。
说如佛言者，　是吉得灭度，
为能作浩际，　是谓言中上。`,"双要品法句经第九二十有二章","双要品者，两两相明，善恶有对，举义不单。",`心为法本，　心尊心使，　中心念恶，
即言即行，　罪苦自追，　车轹于辙；
心为法本，　心尊心使，　中心念善，
即言即行，　福乐自追，　如影随形。
随乱意行，　拘愚入冥，　自大无法，
何解善言？　随正意行，　开解清明，
不为妬嫉，　敏达善言。　愠于怨者，
未甞无怨；　不愠自除，　是道可宗。
不好责彼，　务自省身，　如有知此，
永灭无患。　行见身净，　不摄诸根，
饮食不节，　慢堕怯弱，　为邪所制，
如风靡草；　观身不净，　能摄诸根，
食知节度，　常乐精进，　不为邪动，
如风大山。　不吐毒态，　欲心驰骋，
未能自调，　不应法衣；　能吐毒态，
戒意安静，　降心已调，　此应法衣。
以真为伪、　以伪为真，　是为邪计，
不得真利；　知真为真、　见伪知伪，
是为正计，　必得真利。　盖屋不密，
天雨则漏，　意不惟行，　淫泆为穿；
盖屋善密，　雨则不漏，　摄意惟行，
淫泆不生。　鄙夫染人，　如近臭物，
渐迷习非，　不觉成恶；　贤夫染人，
如近香熏，　进智习善，　行成洁芳。
造忧后忧，　行恶两忧，　彼忧惟惧，
见罪心懅；　造喜后喜，　行善两喜，
彼喜惟欢，　见福心安；　今悔后悔，
为恶两悔，　厥为自殃，　受罪热恼；
今欢后欢，　为善两欢，　厥为自祐，
受福悦豫。　巧言多求，　放荡无戒，
怀婬怒痴，　不惟止观，　聚如群牛，
非佛弟子；　时言少求，　行道如法，
除婬怒痴，　觉正意解，　见对不起，
是佛弟子。`,"放逸品法句经第十有二十章","放逸品者，引律戒情，防邪捡失，以道劝贤。",`戒为甘露道，　放逸为死径，
不贪则不死，　失道为自丧；
慧智守道胜，　终不为放逸，
不贪致欢喜，　从是得道乐。
常当惟念道，　自强守正行，
健者得度世，　吉祥无有上。
正念常兴起，　行净恶易灭，
自制以法寿，　不犯善名增。
发行不放逸，　约以自调心，
慧能作定明，　不返冥渊中。
愚人意难解，　贪乱好诤讼，
上智常重慎，　护斯为宝尊。
莫贪、莫好诤、　亦莫嗜欲乐，
思心不放逸，　可以获大安。
放逸如自禁，　能却之为贤，
已升智慧阁，　去危为即安。
明智观于愚，　譬如山与地，
居乱而身正，　彼为独觉悟，
是力过师子，　弃恶为大智。
睡眠重若山，　痴冥为所弊，
安卧不计苦，　是以常受胎。
不为时自恣，　能制漏得尽，
自恣魔得便，　如师子搏鹿。
能不自恣者，　是为戒比丘，
彼思正净者，　常当自护心。
比丘谨慎乐，　放逸多忧𠎝，
变诤小致大，　积恶入火焰。
守戒福致善，　犯戒有惧心，
能断三界漏，　此乃近泥洹。`,`若前放逸，　后能自禁，　是炤世间，
念定其宜；　过失为恶，　追覆以善，
是炤世间，　念善其宜；　少壮舍家，
盛修佛教，　是炤世间，　如月云消；
人前为恶，　后止不犯，　是炤世间，
如月云消。　生不施恼、　死而不戚，
是见道悍，　应中勿忧。　断浊黑法，
学惟清白，　度渊不反，　弃猗行止，
不复染乐，　欲断无忧。`,"心意品法句经第十一十有二章","心意品者，说意精神虽空无形，造作无竭。",`意使作㺃，　难护、难禁，　慧正其本，
其明乃大。　轻躁难持，　唯欲是从，
制意为善，　自调则宁。　意微难见，
随欲而行，　慧常自护，　能守即安。
独行远逝，　覆藏无形，　损意近道，
魔系乃解。　心无住息，　亦不知法，
迷于世事，　无有正智。　念无适止，
不绝无边，　福能遏恶，　觉者为贤。
佛说心法，　虽微非真，　当觉逸意，
莫随放心。　见法最安，　所愿得成，
慧护微意，　断苦因缘。　有身不久，
皆当归土，　形坏神去，　寄住何贪？
心豫造处，　往来无端，　念多邪僻，
自为招恶。　是意自造，　非父母为，
可勉向正，　为福勿回。　藏六如龟，
防意如城，　慧与魔战，　胜则无患。`,"华香品法句经第十二十有七章","华香品者，明学当行，因华见实，使伪反真。",`孰能择地，　舍鉴取天？　谁说法句，
如择善华？　学者择地，　舍鉴取天；
善说法句，　能采德华。　知世坏喻，
幻法忽有，　断魔华敷，　不覩生死；
见身如沫，　幻法自然，　断魔华敷，
不覩生死。　身病则萎，　若华零落；
死命来至，　如水湍骤。　贪欲无厌，
消散人念，　邪致之财，　为自侵欺。
如蜂集华，　不娆色香，　但取味去，
仁入聚然。　不务观彼，　作与不作，
常自省身，　知正不正。　如可意华，
色好无香，　工语如是，　不行无得；
如可意华，　色美且香，　工语有行，
必得其福。　多作宝花，　结步摇绮，
广积德者，　所生转好。　奇草芳花，
不逆风熏，　近道敷开，　德人逼香。
旃檀多香，　青莲芳花，　虽曰是真，
不如戒香。　华香气微，　不可谓真，
持戒之香，　到天殊胜。　戒具成就，
行无放逸，　定意度脱，　长离魔道。
如作田沟，　近于大道，　中生莲华，
香洁可意。　有生死然，　凡夫处边，
慧者乐出，　为佛弟子。`,"愚暗品法句经第十三二十有一章","愚暗品者，将以开曚，故陈其态，欲使闚明。",`不寐夜长、　疲惓道长、　愚生死长，
莫知正法。　痴意常冥，　逝如流川，
在一行彊，　独而无偶。　愚人着数，
忧戚久长，　与愚居苦，　于我犹怨。
有子、有财，　愚惟汲汲，　我且非我，
何忧子财？　暑当止此、　寒当止此，
愚多务虑，　莫知来变。　愚曚愚极，
自谓我智，　愚而胜智，　是谓极愚。
顽暗近智，　如瓢斟味，　虽久狎习，
犹不知法；　开达近智，　如舌甞味，
虽须臾习，　即解道要。　愚人施行，
为身招患，　快心作恶，　自致重殃。
行为不善，　退见悔悋，　致涕流面，
报由宿习；　行为德善，　进覩欢喜，
应来受福，　喜笑悦习。　过罪未熟，
愚以恬惔，　至其熟处，　自受大罪。
愚所望处，　不谓适苦，　临堕厄地，
乃知不善。　愚憃作恶，　不能自解，
殃追自焚，　罪成炽燃。　愚好美食，
月月滋甚，　于十六分，　未一思法。
愚生念虑，　至终无利，　自招刀杖，
报有印章。`,`观处知其愚，　不施而广求，
所堕无道智，　往往有恶行。
远道近欲者，　为食在学名，
贪猗家居故，　多取供异姓。
学莫堕二望，　莫作家沙门，
贪家违圣教，　为后自匮乏。
此行与愚同，　但令欲慢增，
利求之愿异，　求道意亦异。
是以有识者，　出为佛弟子，
弃爱舍世习，　终不堕生死。`,"明哲品法句经第十四十有七章","明哲品者，举智行者，修福进道，法为明镜。",`深观善恶，　心知畏忌，　畏而不犯，
终吉无忧。　故世有福，　念思绍行，
善致其愿，　福禄转胜。　信善作福，
积行不厌，　信知阴德，　久而必彰。
常避无义，　不亲愚人，　思从贤友，
押附上士。　喜法卧安，　心悦意清，
圣人演法，　慧常乐行。　仁人智者，
斋戒奉道，　如星中月，　照明世间。
弓工调角、　水人调船、　材匠调木、
智者调身。　譬如厚石，　风不能移，
智者意重，　毁誉不倾；　譬如深渊，
澄静清明，　慧人闻道，　心净欢然。`,`大人体无欲，　在所照然明，
虽或遭苦乐，　不高现其智。
大贤无世事，　不愿子财国，
常守戒慧道，　不贪邪富贵。
智人知动摇，　譬如沙中树，
朋友志未强，　随色染其素。`,`世皆没渊，　鲜尅度岸，　如或有人，
欲度必奔。　诚贪道者，　览受正教，
此近彼岸，　脱死为上。　断五阴法，
静思智慧，　不反入渊，　弃猗其明。
抑制情欲，　绝乐无为，　能自拯济，
使意为慧。　学取正智，　意惟正道，
一心受谛，　不起为乐，　漏尽习除，
是得度世。`,"罗汉品法句经第十五有十章","罗汉品者，言真人性脱欲、无着、心不渝变。",`去离忧患，　脱于一切，　缚结已解，
冷而无煖。　心净得念，　无所贪乐，
已度痴渊，　如鴈弃池。　量腹而食，
无所藏积，　心空无想，　度众行地。
如空中鸟，　远逝无碍，　世间习尽，
不复仰食。　虚心无患，　已到脱处，
譬如飞鸟，　暂下辄逝。　制根从止，
如马调御，　舍憍慢习，　为天所敬。
不怒如地、　不动如山，　真人无垢，
生死世绝。　心已休息，　言行亦止，
从正解脱，　寂然归灭。　弃欲无着，
缺三界障，　望意已绝，　是谓上人。
在聚若野，　平地高岸，　应真所过，
莫不蒙祐。　彼乐空闲，　众人不能，
快哉无望，　无所欲求。`,"述千品法句经第十六十有六章","述千品者，示学者经多而不要，不如约明。",`虽诵千言，　句义不正，　不如一要，
闻可灭意；　虽诵千言，　不义何益？
不如一义，　闻行可度；　虽多诵经，
不解何益？　解一法句，　行可得道。
千千为敌，　一夫胜之，　未若自胜，
为战中上。　自胜最贤，　故曰人雄，
护意调身，　自损至终。　虽曰尊天，
神魔梵释，　皆莫能胜，　自胜之人。
月千反祠，　终身不辍，　不如须臾，
一心念法，　一念道福，　胜彼终身；
虽终百岁，　奉事火祠，　不如须臾，
供养三尊，　一供养福，　胜彼百年。`,`祭神以求福，　从后观其报，
四分未望一，　不如礼贤者。
能善行礼节，　常敬长老者，
四福自然增，　色力寿而安。
若人寿百岁，　远正不持戒，
不如生一日，　守戒正意禅；
若人寿百岁，　邪伪无有智，
不如生一日，　一心学正智；
若人寿百岁，　懈怠不精进，
不如生一日，　勉力行精进；
若人寿百岁，　不知成败事，
不如生一日，　见微知所忌；
若人寿百岁，　不见甘露道，
不如生一日，　服行甘露味；
若人寿百岁，　不知大道义，
不如生一日，　学推佛法要。`,"恶行品法句经第十七二十有二章","恶行品者，感切恶人动有罪报，不行无患。",`见善不从，　反随恶心，　求福不正，
反乐邪婬。　凡人为恶，　不能自觉，
愚痴快意，　令后欝毒。　𣧑人行虐，
沈渐数数，　快欲为人，　罪报自然；
吉人行德，　相随积增，　甘心为之，
福应自然。　妖𦾨见福，　其恶未熟，
至其恶熟，　自受罪虐；　贞祥见祸，
其善未熟，　至其善熟，　必受其福。
击人得击、　行怨得怨、　骂人得骂、
施怒得怒。　世人无闻，　不知正法。
生此寿少，　何宜为恶？　莫轻小恶，
以为无殃，　水渧虽微，　渐盈大器，
凡罪充满，　从小积成；　莫轻小善，
以为无福，　水滴虽微，　渐盈大器，
凡福充满，　从纤纤积。　夫士为行，
好之与恶，　各自为身，　终不败亡。
好取之士，　自以为可，　没取彼者，
人亦没之。　恶不即时，　如搆牛乳，
罪在阴祠，　如灰覆火。　戏笑为恶，
以作身行，　号泣受报，　随行罪至。
作恶不覆，　如兵所截，　牵往乃知，
已堕恶行。　后受苦报，　如前所习。
如毒摩疮，　船入洄澓，　恶行流衍，
靡不伤尅。`,`加恶诬罔人，　清白犹不污，
愚殃反自及，　如尘逆风坌。
过失犯非恶，　能追悔为善，
是明照世间，　如日无云曀。
夫士所以行，　然后身自见，
为善则得善、　为恶则得恶。
有识堕胞胎、　恶者入地狱、
行善上升天、　无为得泥洹。
非空、非海中、　非隐山石间，
莫能于此处，　避免宿恶殃。
众生有苦恼，　不得免老死，
唯有仁智者，　不念人非恶。`,"刀杖品法句经第十八十有四章","刀杖品者，教习慈仁，无行刀杖贼害众生。",`一切皆惧死，　莫不畏杖痛，
恕己可为譬，　勿杀勿行杖。
能常安群生，　不加诸楚毒，
现世不逢害，　后世长安隐。`,`不当麤言，　言当畏报，　恶往祸来，
刀杖归躯；　出言以善，　如叩钟磬，
身无论议，　度世则易。　欧杖良善、
妄谗无罪，　其殃十倍，　灾迅无赦：
生受酷痛；　形体毁折；　自然恼病；
失意恍惚；　人所诬咎；　或县官厄；
财产耗尽；　亲戚离别；　舍宅所有，
灾火焚烧；　死入地狱。　如是为十。
虽倮剪发，　长服草衣，　沐浴踞石，
奈痴结何？　不伐杀烧，　亦不求胜，
人爱天下，　所适无怨。　世党有人，
能知惭愧，　是名诱进，　如策良马、
如策善马，　进道能远。　人有信戒，
定意精进，　受道慧成，　便灭众苦。`,`自严以修法，　灭损受净行，
杖不加群生，　是沙门道人。
无害于天下，　终身不遇害，
常慈于一切，　孰能与为怨？`,"老耗品法句经第十九十有四章","老耗品者，诲人懃仂，不与命竞，老悔何益？",`何喜？何笑？　命常炽然，　深弊幽冥，
如不求锭。　见身形范，　倚以为安，
多想致病，　岂知非真？　老则色衰，
病无光泽，　皮缓肌缩，　死命近促。
身死神徙，　如御弃车，　肉消骨散，
身何可怙？　身为如城，　骨干肉涂，
生至老死，　但藏恚慢。　老则形变，
喻如故车，　法能除苦，　宜以仂学。
人之无闻，　老若特牛，　但长肌肥，
无有福慧。　生死无聊，　往来艰难，
意猗贪身，　生苦无端。　慧以见苦，
是故弃身，　灭意断行，　爱尽无生。
不修梵行、　又不富财，　老如白鹭，
守伺空池。　既不守戒、　又不积财，
老羸气竭，　思故何逮？　老如秋叶，
何秽鉴录？　命疾脱至，　亦用后悔。`,`命欲日夜尽，　及时可懃力，
世间谛非常，　莫惑堕冥中。
当学燃意灯，　自练求智慧，
离垢勿染污，　执烛观道地。`,"爱身品法句经第二十十有三章","爱身品者，所以劝学，终有益己——灭罪、兴福。",`自爱身者，　慎护所守，　悕望欲解，
学正不寐。　为身第一，　常自勉学，
利乃诲人，　不惓则智。　学先自正，
然后正人，　调身入慧，　必迁为上。
身不能利，　安能利人？　心调体正，
何愿不至？　本我所造，　后我自受，
为恶自更，　如刚钻珠。　人不持戒，
滋蔓如藤，　逞情极欲，　恶行日增。
恶行危身，　愚以为易；　善最安身，
愚以为难。　如真人教，　以道法身，
愚者疾之，　见而为恶。　行恶得恶，
如种苦种，　恶自受罪、　善自受福，
亦各须熟，　彼不自代；　习善得善，
亦如种甜，　自利利人，　益而不费，
欲知利身，　戒闻为最。　如有自忧，
欲生天上，　敬乐闻法，　当念佛教。`,`凡用必豫虑，　勿以损所务，
如是意日修，　事务不失时。
夫治事之士，　能至终成利，
真见身应行，　如是得所欲。`,"世俗品法句经第二十一十有四章","世俗品者，说世幻梦，当舍浮华，勉修道用。",`如车行道，　舍平大途，　从邪径败，
生折轴忧。　离法如是，　从非法增，
愚守至死，　亦有折患。　顺行正道，
勿随邪业，　行住卧安，　世世无患。
万物如泡，　意如野马，　居世若幻，
奈何乐此？　若能断此，　伐其树根，
日夜如是，　必至于定。　一施如信，
如乐之人，　或从恼意，　以饭食众。
此辈日夜，　不得定意，　世俗无眼，
莫见道真。　如少见明，　当养善意，
如鴈将群，　避罗高翔。　明人导世，
度脱邪众。　世皆有死，　三界无安，
诸天虽乐，　福尽亦丧。　观诸世间，
无生不终，　欲离生死，　当行道真。
痴覆天下，　贪令不见，　邪疑却道，
苦愚从是。　一法脱过，　谓妄语人，
不免后世，　靡恶不更。`,`虽多积珍宝，　嵩高至于天，
如是满世间，　不如见道迹。
不善像如善，　爱如似无爱，
以苦为乐像，　狂夫为所厌。`,"述佛品法句经第二十二二十有一章","述佛品者，道佛神德，无不利度，明为世则。",`己胜不受恶，　一切胜世间，
叡智廓无彊，　开曚令入道。
决网无罣碍，　爱尽无所积，
佛意深无极，　未践迹令践。
勇健立一心，　出家日夜灭，
根断无欲意，　学正念清明。
见谛净无秽，　已度五道渊，
佛出照世间，　为除众忧苦。
得生人道难、　生寿亦难得；
世间有佛难，　佛法难得闻。
我既无归保，　亦独无伴侣，
积一行得佛，　自然通圣道。
船师能渡水，　精进为桥梁，
人以种姓系，　度者为健雄。
坏恶度为佛，　止地为梵志，
除馑为学法，　断种为弟子。
观行忍第一，　佛说泥洹最，
舍罪作沙门，　无娆害于彼。
不娆亦不恼，　如戒一切持，
少食舍身贪，　有行幽隐处。
意谛以有𭶑，　是能奉佛教。`,`诸恶莫作，　诸善奉行，　自净其意，
是诸佛教。　佛为尊贵，　断漏无婬，
诸释中雄，　一群从心。　快哉福报，
所愿皆成，　敏于上寂，　自致泥洹。
或多自归，　山川树神，　庙立图像，
祭祠求福；　自归如是，　非吉、非上，
彼不能来，　度我众苦。　如有自归，
佛法圣众，　道德四谛，　必见正慧。
生死极苦，　从谛得度，　度世八道，
斯除众苦。　自归三尊，　最吉、最上，
唯独有是，　度一切苦。　士如中正，
志道不悭，　利哉！斯人，　自归佛者。
明人难值，　亦不比有，　其所生处，
族亲蒙庆。　诸佛兴快，　说经道快，
众聚和快，　和则常安。`,"安宁品法句经第二十三十有四章","安宁品者，差次安危，去恶即善，快而不堕。",`我生已安，　不愠于怨，　众人有怨，
我行无怨；　我生已安，　不病于病，
众人有病，　我行无病；　我生已安，
不戚于忧，　众人有忧，　我行无忧。
我生已安，　清净无为，　以乐为食，
如光音天。　我生已安，　澹泊无事，
弥薪国火，　安能烧我？　胜则生怨、
负则自鄙，　去胜负心，　无争自安。
热无过婬、　毒无过怒、　苦无过身、
乐无过灭。　无乐、小乐、　小辩、小慧，
观求大者，　乃获大安。　我为世尊，
长解无忧，　正度三有，　独降众魔。
见圣人快，　得依附快，　得离愚人，
为善独快、　守正道快、　工说法快，
与世无诤；　戒具常快、　依贤居快，
如亲亲会，　近仁智者，　多闻高远。
寿命鲜少，　而弃世多，　学当取要，
令至老安。`,`诸欲得甘露，　弃欲灭谛快，
欲度生死苦，　当服甘露味。`,"好喜品法句经第二十四十有二章","好喜品者，禁人多喜，能不贪欲，则无忧患。",`违道则自顺、　顺道则自违，
舍义取所好，　是为顺爱欲。
不当趣所爱、　亦莫有不爱，
爱之不见忧、　不爱见亦忧；
是以莫造爱，　爱憎恶所由，
已除缚结者，　无爱无所憎。`,`爱喜生忧，　爱喜生畏；　无所爱喜，
何忧？何畏？　好乐生忧，　好乐生畏；
无所好乐，　何忧？何畏？　贪欲生忧，
贪欲生畏；　解无贪欲，　何忧？何畏？
贪法戒成，　至诚知惭，　行身近道，
为众所爱。　欲态不出，　思正乃语，
心无贪爱，　必截流渡。　譬人久行，
从远吉还，　亲厚普安，　归来喜欢。
好行福者，　从此到彼，　自受福祚，
如亲来喜。　起从圣教，　禁制不善，
近道见爱、　离道莫亲。　近与不近，
所住者异，　近道升天，　不近堕狱。`,"忿怒品法句经第二十五二十有六章","忿怒品者，见瞋恚害，宽弘慈柔，天祐人爱。",`忿怒不见法，　忿怒不知道，
能除忿怒者，　福喜常随身；
贪婬不见法，　愚痴意亦然，
除婬去痴者，　其福第一尊。`,`恚能自制，　如止奔车，　是为善御，
弃冥入明。　忍辱胜恚，　善胜不善，
胜者能施，　至诚胜欺。　不欺、不怒、
意不多求，　如是三事，　死则上天。
常自摄身，　慈心不杀，　是生天上，
到彼无忧。　意常觉寤，　明慕勤学，
漏尽意解，　可致泥洹。　人相谤毁，
自古至今，　既毁多言、　又毁讷忍、
亦毁中和，　世无不毁，　欲意非圣，
不能制中。　一毁、一誉，　但为利名，
明智所誉，　唯称是贤。　慧人守戒，
无所讥谤，　如罗汉净，　莫而诬谤。
诸人咨嗟，　梵释所称，　常守慎身，
以护瞋恚；　除身恶行，　进修德行，
常守慎言，　以护瞋恚；　除口恶言，
诵习法言，　常守慎心，　以护瞋恚。
除心恶念，　思惟念道，　节身慎言，
守摄其心。　舍恚行道，　忍辱最强；
舍恚离慢，　避诸爱会。　不著名色，
无为灭苦，　起而解怒，　婬生自禁。
舍不明健，　斯皆得安，　瞋断卧安，
恚灭婬忧。　怒为毒本，　软意梵志，
言善得誉，　断为无患。　同志相近，
详为作恶，　后别余恚，　火自烧恼。
不知惭愧，　无戒有怒，　为怒所牵，
不厌有务。　有力近兵，　无力近软，
夫忍为上，　宜常忍羸；　举众轻之，
有力者忍，　夫忍为上，　宜常忍羸。
自我与彼，　大畏有三，　如知彼作，
宜灭己中；　俱两行义，　我为彼教，
如知彼作，　宜灭己中。　苦智胜愚，
麤言恶说，　欲常胜者，　于言宜默。
夫为恶者，　怒有怒报，　怒不报怒，
胜彼鬪负。`,"尘垢品法句经第二十六十有九章","尘垢品者，分别清浊，学当洁白，无行污辱。",`生无善行，　死堕恶道，　住疾无间，
到无资用。　当求智慧，　以然意定，
去垢勿污，　可离苦形。　慧人以渐，
安徐稍进，　洗除心垢，　如工炼金；
恶生于心，　还自坏形，　如铁生垢，
反食其身。`,`不诵为言垢、　不勤为家垢、
不严为色垢、　放逸为事垢、
悭为惠施垢、　不善为行垢，
今世亦后世，　恶法为常垢。`,`垢中之垢，　莫甚于痴，　学当舍恶，
比丘无垢。　苟生无耻，　如鸟长喙，
强颜耐辱，　名曰秽生；　廉耻虽苦，
义取清白，　避辱不妄，　名曰洁生。
愚人好杀，　言无诚实，　不与而取，
好犯人妇，　逞心犯戒，　迷惑于酒，
斯人世世，　自掘身本。　人如觉是，
不当念恶，　愚近非法，　久自烧没。
若信布施，　欲扬名誉，　会人虚饰，
非入净定。　一切断欲，　截意根原，
昼夜守一，　必入定意。　著垢为尘，
从染尘漏，　不染、不行，　净而离愚。
见彼自侵，　常内自省，　行漏自欺，
漏尽无垢。`,`火莫热于婬，　捷莫疾于怒，
网莫密于痴，　爱流驶乎河。
虚空无辙迹，　沙门无外意，
众人尽乐恶，　唯佛净无秽；
虚空无辙迹，　沙门无外意，
世间皆无常，　佛无我所有。`,"奉持品法句经第二十七十有七章","奉持品者，解说道义，法贵德行，不用贪侈。",`好经道者，　不竞于利，　有利、无利，
无欲不惑，　常愍好学，　正心以行，
拥怀宝慧，　是谓为道。　所谓智者，
不必辩言；　无恐、无惧，　守善为智。
奉持法者，　不以多言；　虽素少闻，
身依法行，　守道不忘，　可谓奉法。
所谓老者，　不必年耆，　形熟发白，
憃愚而已；　谓怀谛法，　顺调慈仁，
明远清洁，　是为长老。　所谓端政，
非色如花，　悭嫉虚饰，　言行有违；
谓能舍恶，　根原已断，　慧而无恚，
是为端政。　所谓沙门，　非必除发，
妄语贪取，　有欲如凡；　谓能止恶，
恢廓弘道，　息心灭意，　是为沙门。
所谓比丘，　非时乞食，　邪行婬彼，
称名而已；　谓舍罪福，　净修梵行，
慧能破恶，　是为比丘。　所谓仁明，
非口不言，　用心不净，　外顺而已；
谓心无为，　内行清虚，　此彼寂灭，
是为仁明。　所谓有道，　非救一物；
普济天下，　无害为道。　戒众不言，
我行多诚。　得定意者，　要由闭损，
意解求安。　莫习凡人，　使结未尽，
莫能得脱。`,"道行品法句经第二十八二十有八章","道行品者，旨说大要度脱之道，此为极妙。",`八直最上道，　四谛为法迹，
不婬行之尊，　施灯必得眼。
是道无复畏，　见净乃度世，
此能坏魔兵，　力行灭邪苦。
我已开正道，　为大现异明，
已闻当自行，　行乃解邪缚。
生死非常苦，　能观见为慧，
欲离一切苦，　行道一切除；
生死非常空，　能观见为慧，
欲离一切苦，　但当勤行道。
起时当即起，　莫如愚覆渊，
与堕无瞻聚，　计罢不进道。
念应念则正，　念不应则邪，
慧而不起邪，　思正道乃成。
慎言守意念，　身不善不行，
如是三行除，　佛说是得道。
断树无伐本，　根在犹复生，
除根乃无树，　比丘得泥洹。`,`不能断树，　亲戚相恋，　贪意自缚，
如犊慕乳；　能断意本，　生死无彊，
是为近道，　疾得泥洹。　贪婬致老、
瞋恚致病、　愚痴致死，　除三得道。
释前解后，　脱中度彼，　一切念灭，
无复老死。　人营妻子，　不观病法，
死命卒至，　如水湍骤。　父子不救，
余亲何望？　命尽怙亲，　如盲守灯。
慧解是意，　可修经戒，　勤行度世，
一切除苦。　远离诸渊，　如风却云，
已灭思想，　是为知见。　智为世长，
惔乐无为，　知受正教，　生死得尽。
知众行空，　是为慧见，　罢厌世苦，
从是道除；　知众行苦，　是为慧见，
罢厌世苦，　从是道除；　众行非身，
是为慧见，　罢厌世苦，　从是道除。
吾语汝法，　爱箭为射，　宜以自勗，
受如来言。`,`吾为都以灭，　往来生死尽，
非一情以解，　所演为道眼。
驶流澍于海，　潘水漾疾满，
故为智者说，　可趣服甘露。
前未闻法轮，　转为哀众生，
于是奉事者，　礼之度三有。
三念可念善，　三亦难不善，
从念而有行，　灭之为正断。
三定为转念，　弃猗行无量，
得三三窟除，　解结可应念。
知以戒禁恶，　思惟慧乐念，
已知世成败，　息意一切解。`,"广衍品法句经第二十九十有四章","广衍品者，言凡善、恶，积小致大，证应章句。",`施安虽小，　其报弥大；　慧从小施，
受见景福。　施劳于人，　而欲望祐，
殃咎归身，　自遘广怨。　已为多事，
非事亦造，　伎乐放逸，　恶习日增。
精进惟行，　习是舍非，　修身自觉，
是为正习。　既自解慧，　又多学问，
渐进普广，　油酥投水；　自无慧意，
不好学问，　凝缩狭小，　酪酥投水。
近道名显，　如高山雪，　远道暗昧，
如夜发箭。　为佛弟子，　常寤自觉，
昼夜念佛，　惟法思众；　为佛弟子，
当寤自觉，　日暮思禅，　乐观一心。`,`人当有念意，　每食知自少，
则是痛欲薄，　节消而保寿。
学难、舍罪难，　居在家亦难，
会止同利难，　难难无过有。
比丘乞求难，　何可不自勉？
精进得自然，　后无欲于人。
有信则戒成，　从戒多致宝，
亦从得谐偶，　在所见供养。
一坐、一处卧，　一行无放恣，
守一以正身，　心乐居树间。`,"地狱品法句经第三十十有六章","地狱品者，道泥犁事，作恶受恶，罪牵不置。",`妄语地狱近，　作之言不作，
二罪后俱受，　是行自牵往。
法衣在其身，　为恶不自禁，
苟没恶行者，　终则堕地狱。
无戒受供养，　理岂不自损？
死噉烧铁丸，　然热剧火炭。
放逸有四事，　好犯他人妇，
卧险非福利，　毁三淫泆四。
不福利堕恶，　畏恶、畏乐寡，
王法重罚加，　身死入地狱。
譬如拔菅草，　执缓则伤手，
学戒不禁制，　狱录乃自贼。
人行为慢惰，　不能除众劳，
梵行有玷缺，　终不受大福。
常行所当行，　自持必令强，
远离诸外道，　莫习为尘垢。
为所不当为，　然后致欝毒，
行善常吉顺，　所适无悔恡。
其于众恶行，　欲作若已作，
是苦不可解，　罪近难得避。`,`妄证求败，　行已不正，　怨谮良人，
以抂治士。　罪缚斯人，　自投于坑，
如备边城，　中外牢固。　自守其心，
非法不生，　行缺致忧，　令堕地狱。
可羞不羞，　非羞反羞，　生为邪见，
死堕地狱；　可畏不畏，　非畏反畏，
信向邪见，　死堕地狱。　可避不避，
可就不就，　玩习邪见，　死堕地狱；
可近则近，　可远则远，　恒守正见，
死堕善道。`,"象喻品法句经第三十一十有八章","象喻品者，教人正身，为善得善，福报快焉。",`我如象鬪，　不恐中箭，　常以诚信，
度无戒人。　譬象调正，　可中王乘，
调为尊人，　乃受诚信。　虽为常调，
如彼新驰，　亦最善象，　不如自调。
彼不能适，　人所不至，　唯自调者，
能到调方。`,`如象名财守，　猛害难禁制，
系绊不与食，　而犹暴逸象。
没在恶行者，　恒以贪自系，
其象不知厌，　故数入胞胎。
本意为纯行，　及常行所安，
悉舍降伏结，　如钩制象调。
乐道不放逸，　能常自护心，
是为拔身苦，　如象出于塪。
若得贤能伴，　俱行行善悍，
能伏诸所闻，　至到不失意；
不得贤能伴，　俱行行恶悍，
广断王邑里，　宁独不为恶。
宁独行为善，　不与愚为侣，
独而不为恶，　如象惊自护。
生而有利安，　伴软和为安，
命尽为福安，　众恶不犯安。
人家有母乐，　有父斯亦乐，
世有沙门乐，　天下有道乐。
持戒终老安，　信正所正善，
智慧最安身，　不犯恶最安。`,`如马调软，　随意所如，　信戒精进，
定法要具。　明行成立，　忍和意定，
是断诸苦，　随意所如。　从是往定，
如马调御，　断恚无漏，　是受天乐。
不自放恣，　从是多寤，　羸马比良，
弃恶为贤。`,"爱欲品法句经第三十二三十有二章","爱欲品者，贱婬恩爱，世人为此，盛生灾害。",`心放在婬行，　欲爱增枝条，
分布生炽盛，　超跃贪果猴。
以为爱忍苦，　贪欲著世间，
忧患日夜长，　莚如蔓草生。
人为恩爱惑，　不能舍情欲，
如是忧爱多，　潺潺盈于池。
夫所以忧悲，　世间苦非一，
但为缘爱有，　离爱则无忧。
己意安弃忧，　无爱何有世？
不忧不染求，　不爱焉得安？
有忧以死时，　为致亲属多，
涉忧之长涂，　爱苦常堕危。`,`为道行者，　不与欲会，　先诛爱本，
无所植根，　勿如刈苇，　令心复生。`,`如树根深固，　虽截犹复生，
爱意不尽除，　辄当还受苦。
猨猴得离树，　得脱复趣树，
众人亦如是，　出狱复入狱。
贪意为常流，　习与憍慢并，
思想猗婬欲，　自覆无所见。
一切意流衍，　爱结如葛藤，
唯慧分别见，　能断意根原。
夫从爱润泽，　思想为滋蔓，
爱欲深无底，　老死是用增。
所生枝不绝，　但用食贪欲，
养怨益丘塜，　愚人常汲汲。
虽狱有钩鍱，　慧人不谓牢，
愚见妻子息，　染著爱甚牢。
慧说爱为狱，　深固难得出，
是故当断弃，　不视欲能安。
见色心迷惑，　不惟观无常，
愚以为美善，　安知其非真？
以婬乐自裹，　譬如蚕作茧，
智者能断弃，　不眄除众苦。
心念放逸者，　见婬以为净，
恩爱意盛增，　从是造狱牢。
觉意灭婬者，　常念欲不净，
从是出邪狱，　能断老死患。
以欲网自蔽，　以爱盖自覆，
自恣缚于狱，　如鱼入笱口，
为老死所伺，　若犊求母乳。
离欲灭爱迹，　出网无所弊，
尽道除狱缚，　一切此彼解，
已得度边行，　是为大智士。
勿亲远法人，　亦勿为爱染，
不断三世者，　会复堕边行。
若觉一切法，　能不著诸法，
一切爱意解，　是为通圣意。
众施经施胜、　众味道味胜、
众乐法乐胜，　爱尽胜众苦。
愚以贪自缚，　不求度彼岸，
贪为败处故，　害人亦自害。
爱欲意为田，　婬怒痴为种，
故施度世者，　得福无有量。
伴少而货多，　商人怵惕惧，
嗜欲贼害命，　故慧不贪欲。
心可则为欲，　何必独五欲？
违可绝五欲，　是乃为勇士。
无欲无有畏，　恬惔无忧患，
欲除使结解，　是为长出渊。
欲我知汝本，　意以思想生，
我不思想汝，　则汝而不有。`,`伐树忽休，　树生诸恶，　断树尽株，
比丘灭度。　夫不伐树，　少多余亲，
心系于此，　如犊求母。`,"利养品法句经第三十三有二十章","利养品者，励己防贪，见德思议，不为秽生。",`芭蕉以实死，　竹芦实亦然，
駏驉坐妊死，　士以贪自丧。
如是贪无利，　当知从痴生，
愚为此害贤，　首领分于地。`,`天雨七宝，　欲犹无厌，　乐少苦多，
觉者为贤。　虽有天欲，　慧舍无贪，
乐离恩爱，　为佛弟子。　远道顺邪，
贪养比丘，　止有悭意，　以供彼姓。
勿猗此养，　为家舍罪，　此非至意，
用用何益？　愚为愚计，　欲慢用增，
异哉失利，　泥洹不同。　谛知是者，
比丘佛子，　不乐利养，　闲居却意。
自得不恃，　不从他望，　望彼比丘，
不至正定。　夫欲安命，　息心自省，
不知计数，　衣服饮食；　夫欲安命，
息心自省，　取得知足，　守行一法；
夫欲安命，　息心自省，　如鼠藏穴，
潜隐习教。　约利约耳，　奉戒思惟，
为慧所称，　清吉勿怠。　如有三明，
解脱无漏，　寡智鲜识，　无所忆念。
其于食饮，　从人得利，　而有恶法，
从供养嫉。　多结怨利，　强服法衣，
但望饮食，　不奉佛教。　当知是过，
养为大畏，　寡取无忧，　比丘释心。`,`非食命不济，　孰能不揣食？
夫立食为先，　知是不宜嫉。`,`嫉先创己，　然后创人，　击人得击，
是不得除。　宁噉烧石、　吞饮洋铜，
不以无戒，　食人信施。`,"沙门品法句经第三十四三十有二章","沙门品者，训以法正，弟子受行，得道解净。",`端目、耳、鼻、口，　身意常守正，
比丘行如是，　可以免众苦。
手足莫妄犯，　节言顺所行，
常内乐定意，　守一行寂然。`,`学当守口，　宥言安徐，　法义为定，
言必柔软。　乐法欲法，　思惟安法，
比丘依法，　正而不费。　学无求利，
无爱他行，　比丘好他，　不得定意。
比丘少取，　以得无积，　天人所誉，
生净无秽。　比丘为慈，　爱敬佛教，
深入止观，　灭行乃安。　一切名色，
非有莫惑，　不近不忧，　乃为比丘。
比丘扈船，　中虚则轻，　除婬怒痴，
是为泥洹。　舍五断五，　思惟五根，
能分别五，　乃渡河渊。　禅无放逸，
莫为欲乱，　不吞洋铜，　自恼燋形。
无禅不智、　无智不禅，　道从禅智，
得至泥洹。　当学入空，　静居止意，
乐独屏处，　一心观法。　常制五阴，
伏意如水，　清净和悦，　为甘露味。
不受所有，　为慧比丘，　摄根知足，
戒律悉持。　生当行净，　求善师友，
智者成人，　度苦致喜。　如卫师华，
熟如自堕，　释婬怒痴，　生死自解。
止身、止言，　心守玄默，　比丘弃世，
是为受寂。　当自勅身，　内与心争，
护身念谛，　比丘惟安。　我自为我，
计无有我，　故当损我，　调乃为贤。
喜在佛教，　可以多喜，　至到寂寞，
行灭永安。　傥有少行，　应佛教戒，
此照世间，　如日无曀。`,`弃慢无余憍，　莲华水生净，
学能舍此彼，　知是胜于故。
割爱无恋慕，　不受如莲华，
比丘渡河流，　胜欲明于故。`,`截流自恃，　逝心却欲，　仁不割欲，
一意犹走。　为之！为之！　必强自制，
舍家而懈，　意犹复染。　行懈缓者，
劳意弗除？　非净梵行，　焉致大宝？
沙门何行？　如意不禁，　步步著粘，
但随思走。　袈裟披肩，　为恶不损，
恶恶行者，　斯堕恶道。　不调难诫，
如风枯树，　作自为身，　曷不精进？
息心非剔，　慢𫍙无戒，　舍贪思道，
乃应息心；　息心非剔，　放逸无信，
能灭众苦，　为上沙门。`,"梵志品法句经第三十五有四十章","梵志品者，言行清白，理学无秽，可称道士。",`截流而渡，　无欲如梵，　知行已尽，
是谓梵志；　以无二法，　清净渡渊，
诸欲结解，　是谓梵志；　适彼无彼，
彼彼已空，　舍离贪婬，　是谓梵志；
思惟无垢，　所行不漏，　上求不起，
是谓梵志。　日照于昼、　月照于夜、
甲兵照军、　禅照道人；　佛出天下，
照一切冥。`,`非剃为沙门，　称吉为梵志，
谓能舍众恶，　是则为道人；
出恶为梵志，　入正为沙门，
弃我众秽行，　是则为舍家。`,`若猗于爱，　心无所著，　已舍、已正，
是灭众苦。　身、口与意，　净无过失，
能舍三行，　是谓梵志。　若心晓了，
佛所说法，　观心自归，　净于为水。
非蔟结发，　名为梵志；　诚行法行，
清白则贤。　饰发无慧，　草衣何施？
内不离著，　外舍何益？　被服弊恶，
躬承法行，　闲居思惟，　是谓梵志；
佛不教彼，　赞己自称，　如谛不妄，
乃为梵志；　绝诸可欲，　不婬其志，
委弃欲数，　是谓梵志；　断生死河，
能忍起度，　自觉出堑，　是谓梵志；
见骂见击，　默受不怒，　有忍辱力，
是谓梵志；　若见侵欺，　但念守戒，
端身自调，　是谓梵志；　心弃恶法，
如蛇脱皮，　不为欲污，　是谓梵志；
觉生为苦，　从是灭意，　能下重担，
是谓梵志；　解微妙慧，　辩道不道，
体行上义，　是谓梵志；　弃捐家居，
无家之畏，　少求寡欲，　是谓梵志；
弃放活生，　无贼害心，　无所娆恼，
是谓梵志；　避争不争，　犯而不愠，
恶来善待，　是谓梵志；　去婬怒痴，
憍慢诸恶，　如蛇脱皮，　是谓梵志；
断绝世事，　口无麤言，　八道审谛，
是谓梵志；　所世恶法，　修短巨细，
无取、无舍，　是谓梵志；　今世行净、
后世无秽，　无习、无舍，　是谓梵志；
弃身无猗，　不诵异行，　行甘露灭，
是谓梵志；　于罪与福，　两行永除，
无忧、无尘，　是谓梵志；　心喜无垢，
如月盛满，　谤毁已除，　是谓梵志；
见痴往来，　堕堑受苦，　欲单渡岸，
不好他语，　唯灭不起，　是谓梵志；
已断恩爱，　离家无欲，　爱有已尽，
是谓梵志；　离人聚处，　不堕天聚，
诸聚不归，　是谓梵志；　弃乐无乐，
灭无煴燸，　健违诸世，　是谓梵志；
所生已讫，　死无所趣，　觉安无依，
是谓梵志；　已度五道，　莫知所堕，
习尽无余，　是谓梵志；　于前、于后，
乃中无有，　无操、无舍，　是谓梵志；
最雄、最勇，　能自解度，　觉意不动，
是谓梵志；　自知宿命，　本所更来，
得要生尽，　叡通道玄，　明如能默，
是谓梵志。`,"泥洹品法句经第三十六三十有六章","泥洹品者，叙道大归，恬惔寂灭，度生死畏。",`忍为最自守，　泥洹佛称上，
舍家不犯戒，　息心无所害。`,`无病最利、　知足最富、　厚为最友、
泥洹最快；　饥为大病、　行为最苦，
已谛知此，　泥洹最乐；　少往善道，
趣恶道多，　如谛知此，　泥洹最安。
从因生善、　从因堕恶，　由因泥洹，
所缘亦然。　麋鹿依野、　鸟依虚空，
法归其报，　真人归灭。　始无如不？
始不如无，　是为无得，　亦无有思。`,`心难见，习可覩，　觉欲者，乃具见。
无所乐，为苦际，　在爱欲，为增痛，
明不清，净能御，　无所近，为苦际。
见有见、闻有闻、　念有念、识有识，
覩无著，亦无识，　一切舍，为得际。
除身想，灭痛行，　识已尽，为苦竟，
猗则动，虚则净，　动非近，非有乐，
乐无近，为得寂，　寂已寂，已往来，
来往绝，无生死，　生死断，无此彼，
此彼断，为两灭，　灭无余，为苦除。`,`比丘有世生，　有有有作行，
有无生无有，　无作无所行。
夫唯无念者，　为能得自致，
无生无复有，　无作无行处。
生有作行者，　是为不得要，
若已解不生，　不有不作行。
则生有得要，　从生有已起，
作行致死生，　为开为法果。
从食因缘有，　从食致忧乐，
而此要灭者，　无复念行迹。
诸苦法已尽，　行灭湛然安，
比丘吾已知，　无复诸入地。
无有虚空入，　无诸入用入，
无想不想入，　无今世、后世，
亦无日月想，　无往、无所悬。
我已无往反，　不去而不来，
不没不复生，　是际为泥洹。
如是像无像，　苦乐为以解，
所见不复恐，　无言言无疑。
断有之射箭，　遘愚无所猗，
是为第一快，　此道寂无上。
受辱心如地，　行忍如门阈，
净如水无垢，　生尽无彼受。
利胜不足恃，　虽胜犹复苦，
当自求去胜，　已胜无所生。
毕故不造新，　厌胎无婬行，
种燋不复生，　意尽如火灭。
胞胎为秽海，　何为乐婬行？
虽上有善处，　皆莫如泥洹。
悉知一切断，　不复著世间，
都弃如灭度，　众道中斯胜。
佛以现谛法，　智勇能奉持，
行净无瑕秽，　自知度世安。
道务先远欲，　早服佛教戒，
灭恶极恶际，　易如鸟逝空。
若已解法句，　至心体道行，
是度生死岸，　苦尽而无患。
道法无亲疎，　正不问羸强，
要在无识想，　结解为清净。
上智餍腐身，　危脆非实真，
苦多而乐少，　九孔无一净。
慧以危贸安，　弃猗脱众难，
形腐销为沫，　慧见舍不贪。
观身为苦器，　生老病无痛，
弃垢行清净，　可以获大安。
依慧以却邪，　不受漏得尽，
行净致度世，　天人莫不礼。`,"生死品法句经第三十七十有八章","生死品者，说诸人魂，灵亡神在，随行转生。",`命如菓待熟，　常恐会零落。
已生皆有苦，　孰能致不死？
从初乐恩爱，　可婬入泡影，
受形命如电，　昼夜流难止。
是身为死物，　精神无形法，
假令死复生，　罪福不败亡。
终始非一世，　从痴爱久长，
自此受苦乐，　身死神不丧。
身四大为色，　识四阴曰名，
其情十八种，　所缘起十二。
神止凡九处，　生死不断灭，
世间愚不闻，　蔽暗无天眼。
自涂以三垢，　无目意妄见，
谓死如生时，　或谓死断灭。
识神造三界，　善不善五处，
阴行而默到，　所往如响应。
欲色不色有，　一切因宿行，
如种随本像，　自然报如意。
神以身为名，　如火随形字，
著烛为烛火，　随炭草粪薪。
心法起则起、　法灭而则灭，
兴衰如雨雹，　转转不自识。
识神走五道，　无一处不更，
舍身复受身，　如轮转著地。
如人一身居，　去其故室中，
神以形为庐，　形坏神不亡；
精神居形躯，　犹雀藏器中，
器破雀飞去，　身坏神逝生。
性痴净常想，　乐身想疑想，
嫌望非上要，　佛说是不明。
一本二展转，　三垢五弥广，
诸海十三事，　渊销越度欢。
三事断绝时，　知身无所直，
命气煴煖识，　舍身而转逝。
当其死卧地，　犹草无所知，
观其状如是，　但幻而愚贪。`,"道利品法句经第三十八十有九章","道利品者，君父师行，开示善道，率之以正。",`人知奉其上，　君父师道士，
信戒施闻慧，　终吉所生安。
宿命有福庆，　生世为人尊，
以道安天下，　奉法莫不从。
王为臣民长，　常以慈爱下，
身率以法戒，　示之以休咎。
处安不忘危，　虑明福转厚，
福德之反报，　不问尊以卑。
夫为世间将，　修正不阿抂，
心调胜诸恶，　如是为法王。
见正能施惠，　仁爱好利人，
既利以平均，　如是众附亲。
如牛厉渡水，　导正从亦正，
奉法心不邪，　如是众普安。
勿妄娆神象，　以招苦痛患，
恶意为自煞，　终不至善方。
戒德可恃怙，　福报常随己，
见法为人长，　终远三恶道。
戒慎除苦畏，　福德三界尊，
鬼龙邪毒害，　不犯持戒人。
无义不诚信，　欺妄好鬪诤，
当知远离此，　近愚兴罪多；
仁贤言诚信，　多闻戒行具，
当知亲附此，　近智诚善多。
善言不守戒，　志乱无善行，
虽身处潜隐，　是为非学法。
美说正为上，　法说为第二，
爱说可彼三，　诚说不欺四。
无便获利刃，　自以克其身，
愚学好妄说，　行牵受幸戾。
贪婬、瞋恚、痴，　是三非善本，
身以斯自害，　报由痴爱生。
有福为天人，　非法受恶形，
圣人明独见，　常善承佛令。
戒德后世业，　以作福追身，
天人称誉善，　心正无不安。
为恶不念止，　日缚不自悔，
命逝如川流，　是恐宜守戒。
今我上体首，　白生为被盗，
已有天使召，　时正宜出家。`,"吉祥品法句经第三十九十有九章","吉祥品者，修己之术，去恶就善，终厚景福。",`佛尊过诸天，　如来常现义，
有梵志道士，　来问何吉祥？
于是佛愍伤，　为说真有要，
已信乐正法，　是为最吉祥；
若不从天人，　希望求侥幸，
亦不祷祠神，　是为最吉祥；
友贤择善居，　常先为福德，
勅身从真正，　是为最吉祥；
去恶从就善，　避酒知自节，
不婬于女色，　是为最吉祥；
多闻如戒行，　法律精进学，
修已无所争，　是为最吉祥；
居孝事父母，　治家养妻子，
不为空之行，　是为最吉祥；
不慢不自大，　知足念反复，
以时诵习经，　是为最吉祥；
所闻常以忍，　乐欲见沙门，
每讲辄听受，　是为最吉祥；
持斋修梵行，　常欲见贤圣，
依附明智者，　是为最吉祥；
以信有道德，　正意向无疑，
欲脱三恶道，　是为最吉祥；
等心行布施，　奉诸得道者，
亦敬诸天人，　是为最吉祥；
常欲离贪欲，　愚痴瞋恚意，
能习诚道见，　是为最吉祥；
若以弃非务，　能勤修道用，
常事于可事，　是为最吉祥；
一切为天下，　建立大慈意，
修仁安众生，　是为最吉祥。
欲求吉祥福，　当信敬于佛；
欲求吉祥福，　当闻法句义；
欲求吉祥福，　当供养众僧。
戒具清净者，　是为最吉祥；
智者居世间，　常习吉祥行，
自致成慧见，　是为最吉祥。
梵志闻佛教，　心中大欢喜，
即前礼佛足，　归命佛法众。`],source:"https://cbetaonline.dila.edu.tw/zh/T04n0210",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T04/T04n0210.xml",sourceLabel:"CBETA T04n0210",scope:"全2卷正文（不含序跋、目录、附录）",originalTitle:"法句經",juan:[1,2]},{id:"cbeta-t14n0452",title:"佛说观弥勒菩萨上生兜率天经",subtitle:"佛说观弥勒菩萨上生兜率天经 · 宋 沮渠京声译",paragraphs:["如是我闻：","一时，佛在舍卫国祇树给孤独园。尔时世尊于初夜分，举身放光其光金色，绕祇陀园周遍七匝，照须达舍亦作金色，有金色光犹如段云——遍舍卫国处处皆雨金色莲花——其光明中，有无量百千诸大化佛，皆唱是言：「今于此中有千菩萨，最初成佛名拘留孙，最后成佛名曰楼至。」说是语已，尊者阿若憍陈如即从禅起，与其眷属二百五十人俱；尊者摩诃迦叶，与其眷属二百五十人俱；尊者大目犍连，与其眷属二百五十人俱；尊者舍利弗，与其眷属二百五十人俱；摩诃波阇波提比丘尼，与其眷属千比丘尼俱；须达长者与三千优婆塞俱；毘舍佉母与二千优婆夷俱；复有菩萨摩诃萨，名跋陀婆罗，与其眷属十六菩萨俱；文殊师利法王子，与其眷属五百菩萨俱；天、龙、夜叉、乾闼婆等一切大众，覩佛光明皆悉云集。","尔时，世尊出广长舌相放千光明，一一光明各有千色，一一色中有无量化佛。是诸化佛异口同音，皆说清净诸大菩萨甚深不可思议诸陀罗尼法，所谓阿难陀目佉陀罗尼、空慧陀罗尼、无碍性陀罗尼、大解脱无相陀罗尼。尔时世尊以一音声，说百亿陀罗尼门。说此陀罗尼已，尔时会中有一菩萨名曰弥勒，闻佛所说，应时即得百万亿陀罗尼门，即从座起整衣服，叉手合掌住立佛前。","尔时优波离亦从座起，头面作礼而白佛言：「世尊！世尊往昔于毘尼中及诸经藏说阿逸多次当作佛，此阿逸多具凡夫身，未断诸漏，此人命终当生何处？其人今者虽复出家，不修禅定不断烦恼，佛记此人成佛无疑，此人命终生何国土？」","佛告优波离：「谛听谛听，善思念之。如来、应、正遍知，今于此众说弥勒菩萨摩诃萨阿耨多罗三藐三菩提记。此人从今十二年后命终，必得往生兜率陀天上。尔时兜率陀天上，有五百万亿天子，一一天子皆修甚深檀波罗蜜，为供养一生补处菩萨故，以天福力造作宫殿，各各脱身栴檀摩尼宝冠，长跪合掌发是愿言：『我今持此无价宝珠及以天冠，为供养大心众生故，此人来世不久当成阿耨多罗三藐三菩提，我于彼佛庄严国界得受记者，令我宝冠化成供具。』如是诸天子等各各长跪，发弘誓愿亦复如是。","「时诸天子作是愿已，是诸宝冠化作五百万亿宝宫，一一宝宫有七重垣，一一垣七宝所成，一一宝出五百亿光明，一一光明中有五百亿莲华，一一莲华化作五百亿七宝行树，一一树叶有五百亿宝色，一一宝色有五百亿阎浮檀金光，一一阎浮檀金光中出五百亿诸天宝女，一一宝女住立树下，执百亿宝无数璎珞，出妙音乐，时乐音中演说不退转地法轮之行。其树生果如颇梨色，一切众色入颇梨色中，是诸光明右旋婉转流出众音，众音演说大慈大悲法。一一垣墙高六十二由旬、厚十四由旬，五百亿龙王围绕此垣，一一龙王雨五百亿七宝行树，庄严垣上。自然有风吹动此树，树相掁触，演说苦、空、无常、无我、诸波罗蜜。","「尔时此宫有一大神，名牢度跋提，即从座起遍礼十方佛，发弘誓愿：『若我福德应为弥勒菩萨造善法堂，令我额上自然出珠。』既发愿已，额上自然出五百亿宝珠，瑠璃颇梨一切众色无不具足，如紫绀摩尼表里暎彻。此摩尼光回旋空中，化为四十九重微妙宝宫，一一栏楯万亿梵摩尼宝所共合成。诸栏楯间自然化生九亿天子、五百亿天女，一一天子手中化生无量亿万七宝莲华，一一莲华上有无量亿光，其光明中具诸乐器。如是天乐不鼓自鸣，此声出时，诸女自然执众乐器，竞起歌舞；所咏歌音演说十善、四弘誓愿，诸天闻者皆发无上道心。","「时诸园中有八色瑠璃渠，一一渠有五百亿宝珠而用合成，一一渠中有八味水，八色具足。其水上涌游梁栋间，于四门外化生四花，水出华中如宝花流。一一华上有二十四天女，身色微妙如诸菩萨庄严身相，手中自然化五百亿宝器，一一器中，天诸甘露自然盈满，左肩荷佩无量璎珞，右肩复负无量乐器，如云住空从水而出，赞叹菩萨六波罗蜜；若有往生兜率天上，自然得此天女侍御。亦有七宝大师子座，高四由旬，阎浮檀金、无量众宝以为庄严，座四角头生四莲华，一一莲华百宝所成，一一宝出百亿光明。其光微妙，化为五百亿众宝杂花，庄严宝帐。","「时十方面百千梵王，各各持一梵天妙宝，以为宝铃悬宝帐上。时小梵王持天众宝，以为罗网弥复帐上。尔时百千无数天子天女眷属，各持宝华以布座上。是诸莲花自然皆出五百亿宝女，手执白拂侍立帐内。","「持宫四角有四宝柱，一一宝柱有百千楼阁，梵摩尼珠以为绞络。时诸阁间有百千天女，色妙无比手执乐器，其乐音中，演说苦、空、无常、无我、诸波罗蜜；如是天宫有百亿万无量宝色，一一诸女亦同宝色。","「尔时十方无量诸天命终，皆愿往生兜率天宫。","「时兜率天宫有五大神：","「第一大神名曰宝幢，身雨七宝散宫墙内，一一宝珠化成无量乐器，悬处空中不鼓自鸣，有无量音适众生意；第二大神名曰花德，身雨众花弥覆宫墙，化成花盖，一一花盖百千幢幡以为导引；第三大神名曰香音，身毛孔中雨出微妙海此岸旃檀香，其香如云，作百宝色绕宫七匝；第四大神名曰喜乐，雨如意珠，一一宝珠自然住在幢幡之上，显说无量归佛、归法、归比丘僧，及说五戒、无量善法、诸波罗蜜，饶益劝助菩提意者；第五大神名曰正音声，身诸毛孔流出众水，一一水上有五百亿花，一一华上有二十五玉女，一一玉女身诸毛孔出一切音，声胜天魔后所有音乐。」","佛告优波离：「此名兜率陀天十善报应胜妙福处。若我住世一小劫中，广说一生补处菩萨报应及十善果者不能穷尽，今为汝等畧而解说。」","佛告优波离：「若有比丘及一切大众，不厌生死乐生天者、爱敬无上菩提心者、欲为弥勒作弟子者，当作是观。作是观者，应持五戒八斋具足戒，身心精进不求断结，修十善法，一一思惟兜率陀天上上妙快乐，作是观者名为正观，若他观者名为邪观。」","尔时优波离即从座起，整衣服头面作礼，白佛言：「世尊！兜率陀天上乃有如是极妙乐事，今此大士何时于阎浮提没生于彼天？」","佛告优波离：「弥勒先于波罗捺国劫波利村波婆利大婆罗门家生，却后十二年，二月十五日还本生处，结加趺坐如入灭定。身紫金色，光明艳赫如百千日，上至兜率陀天。其身舍利如铸金像不动不摇，身圆光中有首楞严三昧般若波罗蜜字义炳然。时诸人天，寻即为起众宝妙塔供养舍利。时兜率陀天七宝台内摩尼殿上，师子床座忽然化生，于莲华上结加趺坐，身如阎浮檀金色，长十六由旬，三十二相、八十种好皆悉具足，顶上肉髻发绀瑠璃色，释迦毘楞伽摩尼、百千万亿甄叔迦宝以严天冠。其天宝冠有百万亿色，一一色中有无量百千化佛，诸化菩萨以为侍者；复有他方诸大菩萨，作十八变随意自在住天冠中。弥勒眉间有白毫相光，流出众光作百宝色，三十二相，一一相中有五百亿宝色，一一好亦有五百亿宝色，一一相好艶出八万四千光明云；与诸天子各坐花座，昼夜六时，常说不退转地法轮之行；经一时中成就五百亿天子，令不退转于阿耨多罗三藐三菩提。如是处兜率陀天，昼夜恒说此法，度诸天子。阎浮提岁数五十六亿万岁，尔乃下生于阎浮提，如《弥勒下生经》说。」","佛告优波离：「是名弥勒菩萨于阎浮提没生兜率陀天因缘。佛灭度后我诸弟子，若有精勤修诸功德、威仪不缺，扫塔涂地，以众名香、妙花供养，行众三昧深入正受，读诵经典，如是等人应当至心，虽不断结如得六通，应当系念念佛形像，称弥勒名。如是等辈，若一念顷受八戒斋，修诸净业发弘誓愿，命终之后，譬如壮士屈申臂顷，即得往生兜率陀天，于莲华上结加趺坐，百千天子作天伎乐，持天曼陀罗花、摩诃曼陀罗华，以散其上赞言：『善哉，善哉！善男子！汝于阎浮提广修福业来生此处。此处名兜率陀天，今此天主名曰弥勒，汝当归依。』应声即礼，礼已谛观眉间白毫相光，即得超越九十亿劫生死之罪。是时菩萨随其宿缘，为说妙法，令其坚固不退转于无上道心。如是等众生若净诸业、行六事法，必定无疑，当得生于兜率天上值遇弥勒，亦随弥勒下阎浮提，第一闻法，于未来世，值遇贤劫一切诸佛，于星宿劫，亦得值遇诸佛世尊，于诸佛前受菩提记。」","佛告优波离：「佛灭度后，比丘、比丘尼、优婆塞、优婆夷，天、龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽等是诸大众，若有得闻弥勒菩萨摩诃萨名者，闻已欢喜恭敬礼拜，此人命终如弹指顷即得往生，如前无异；但得闻是弥勒名者，命终亦不堕黑暗处、边地、邪见、诸恶律仪，恒生正见眷属成就，不谤三宝。」","佛告优波离：「若善男子、善女人，犯诸禁戒造众恶业，闻是菩萨大悲名字，五体投地诚心忏悔，是诸恶业速得清净。未来世中诸众生等，闻是菩萨大悲名称，造立形像，香花、衣服、缯盖、幢幡，礼拜系念，此人命欲终时，弥勒菩萨放眉间白毫大人相光，与诸天子雨曼陀罗花，来迎此人。此人须臾即得往生，值遇弥勒，头面礼敬，未举头顷便得闻法，即于无上道得不退转，于未来世得值恒河沙等诸佛如来。」","佛告优波离：「汝今谛听，是弥勒菩萨于未来世，当为众生作大归依处。若有归依弥勒菩萨者，当知是人于无上道得不退转。弥勒菩萨成多陀阿伽度、阿罗诃、三藐三佛陀时，如此行人，见佛光明即得授记。」","佛告优波离：「佛灭度后，四部弟子、天、龙、鬼神，若有欲生兜率陀天者，当作是观系念思惟，念兜率陀天，持佛禁戒，一日至七日，思念十善行十善道，以此功德回向愿生弥勒前者，当作是观。作是观者，若见一天人、见一莲花，若一念顷称弥勒名，此人除却千二百劫生死之罪；但闻弥勒名合掌恭敬，此人除却五十劫生死之罪；若有敬礼弥勒者，除却百亿劫生死之罪；设不生天，未来世中龙花菩提树下亦得值遇，发无上心。」","说是语时，无量大众即从坐起，顶礼佛足，礼弥勒足，绕佛及弥勒菩萨百千匝。未得道者各发誓愿：「我等天人八部，今于佛前发诚实誓愿，于未来世值遇弥勒，舍此身已皆得上生兜率陀天。」","世尊记曰：「汝等及未来世修福持戒，皆当往生弥勒菩萨前，为弥勒菩萨之所摄受。」","佛告优波离：「作是观者名为正观，若他观者名为邪观。」","尔时，尊者阿难即从座起，叉手长跪白佛言：「世尊！善哉世尊！快说弥勒所有功德，亦记未来世修福众生所得果报，我今随喜。唯然世尊！此法之要云何受持？当何名此经？」","佛告阿难：「汝持佛语慎勿忘失，为未来世开生天路、示菩提相，莫断佛种。此经名『弥勒菩萨般涅槃』，亦名『观弥勒菩萨生兜率陀天劝发菩提心』，如是受持。」佛说是语时，他方来会十万菩萨，得首楞严三昧；八万亿诸天发菩提心，皆愿随从弥勒下生。","佛说是语时，四部弟子、天龙八部，闻佛所说，皆大欢喜，礼佛而退。"],source:"https://cbetaonline.dila.edu.tw/zh/T14n0452",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T14/T14n0452.xml",sourceLabel:"CBETA T14n0452",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說觀彌勒菩薩上生兜率天經",juan:[1]},{id:"cbeta-t14n0475",title:"维摩诘所说经",subtitle:"维摩诘所说经 · 姚秦 鸠摩罗什译",paragraphs:["佛国品第一","如是我闻：","一时，佛在毘耶离庵罗树园，与大比丘众八千人俱，菩萨三万二千——众所知识，大智本行，皆悉成就；诸佛威神之所建立，为护法城，受持正法；能师子吼，名闻十方；众人不请，友而安之；绍隆三宝，能使不绝；降伏魔怨，制诸外道，悉已清净，永离盖缠；心常安住，无碍解脱；念、定、总持、辩才不断；布施、持戒、忍辱、精进、禅定、智慧及方便力，无不具足；逮无所得不起法忍；已能随顺，转不退轮；善解法相，知众生根；盖诸大众得无所畏、功德智慧，以修其心；相好严身，色像第一，舍诸世间所有饰好；名称高远，逾于须弥；深信坚固，犹若金刚；法宝普照，而雨甘露；于众言音，微妙第一；深入缘起，断诸邪见，有无二边，无复余习；演法无畏，犹师子吼，其所讲说，乃如雷震，无有量，已过量；集众法宝，如海导师，了达诸法深妙之义；善知众生往来所趣及心所行；近无等等佛自在慧、十力、无畏、十八不共；关闭一切诸恶趣门，而生五道以现其身；为大医王，善疗众病，应病与药，令得服行；无量功德皆成就，无量佛土皆严净；其见闻者，无不蒙益，诸有所作，亦不唐捐：如是一切功德，皆悉具足——","其名曰：等观菩萨、不等观菩萨、等不等观菩萨、定自在王菩萨、法自在王菩萨、法相菩萨、光相菩萨、光严菩萨、大严菩萨、宝积菩萨、辩积菩萨、宝手菩萨、宝印手菩萨、常举手菩萨、常下手菩萨、常惨菩萨、喜根菩萨、喜王菩萨、辩音菩萨、虚空藏菩萨、执宝炬菩萨、宝勇菩萨、宝见菩萨、帝网菩萨、明网菩萨、无缘观菩萨、慧积菩萨、宝胜菩萨、天王菩萨、坏魔菩萨、电德菩萨、自在王菩萨、功德相严菩萨、师子吼菩萨、雷音菩萨、山相击音菩萨、香象菩萨、白香象菩萨、常精进菩萨、不休息菩萨、妙生菩萨、华严菩萨、观世音菩萨、得大势菩萨、梵网菩萨、宝杖菩萨、无胜菩萨、严土菩萨、金髻菩萨、珠髻菩萨、弥勒菩萨、文殊师利法王子菩萨，如是等三万二千人。","复有万梵天王尸弃等，从余四天下来诣佛所而听法；复有万二千天帝，亦从余四天下来在会坐；并余大威力诸天、龙神、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽等，悉来会坐；诸比丘、比丘尼、优婆塞、优婆夷，俱来会坐。彼时佛与无量百千之众，恭敬围绕而为说法，譬如须弥山王显于大海，安处众宝师子之座，蔽于一切诸来大众。","尔时毘耶离城有长者子，名曰宝积，与五百长者子，俱持七宝盖来诣佛所，头面礼足，各以其盖共供养佛。佛之威神，令诸宝盖合成一盖，遍覆三千大千世界，而此世界广长之相悉于中现；又此三千大千世界诸须弥山、雪山、目真隣陀山、摩诃目真隣陀山、香山、宝山、金山、黑山、铁围山、大铁围山，大海江河，川流泉源及日月星辰、天宫、龙宫、诸尊神宫，悉现于宝盖中；又十方诸佛、诸佛说法，亦现于宝盖中。尔时一切大众，覩佛神力，叹未曾有！合掌礼佛，瞻仰尊颜，目不暂舍。于是长者子宝积即于佛前，以偈颂曰：",`「目净修广如青莲，　心净已度诸禅定，
久积净业称无量，　导众以寂故稽首。
既见大圣以神变，　普现十方无量土，
其中诸佛演说法，　于是一切悉见闻。
法王法力超群生，　常以法财施一切，
能善分别诸法相，　于第一义而不动，
已于诸法得自在，　是故稽首此法王。
说法不有亦不无，　以因缘故诸法生，
无我无造无受者，　善恶之业亦不亡。
始在佛树力降魔，　得甘露灭觉道成，
已无心意无受行，　而悉摧伏诸外道。
三转法轮于大千，　其轮本来常清净，
天人得道此为证，　三宝于是现世间。
以斯妙法济群生，　一受不退常寂然，
度老病死大医王，　当礼法海德无边。
毁誉不动如须弥，　于善不善等以慈，
心行平等如虚空，　孰闻人宝不敬承？
今奉世尊此微盖，　于中现我三千界，
诸天龙神所居宫，　乾闼婆等及夜叉。
悉见世间诸所有，　十力哀现是化变，
众覩希有皆叹佛，　今我稽首三界尊。
大圣法王众所归，　净心观佛靡不欣，
各见世尊在其前，　斯则神力不共法；
佛以一音演说法，　众生随类各得解，
皆谓世尊同其语，　斯则神力不共法；
佛以一音演说法，　众生各各随所解，
普得受行获其利，　斯则神力不共法；
佛以一音演说法，　或有恐畏或欢喜，
或生厌离或断疑，　斯则神力不共法。
稽首十力大精进，　稽首已得无所畏，
稽首住于不共法，　稽首一切大导师，
稽首能断众结缚，　稽首已到于彼岸，
稽首能度诸世间，　稽首永离生死道。
悉知众生来去相，　善于诸法得解脱，
不著世间如莲华，　常善入于空寂行，
达诸法相无罣碍，　稽首如空无所依。」`,"尔时长者子宝积说此偈已，白佛言：「世尊！是五百长者子，皆已发阿耨多罗三藐三菩提心，愿闻得佛国土清净，唯愿世尊说诸菩萨净土之行！」","佛言：「善哉！宝积！乃能为诸菩萨，问于如来净土之行。谛听，谛听！善思念之，当为汝说！」于是宝积及五百长者子受教而听。","佛言：「宝积！众生之类是菩萨佛土。所以者何？菩萨随所化众生而取佛土，随所调伏众生而取佛土，随诸众生应以何国入佛智慧而取佛土，随诸众生应以何国起菩萨根而取佛土。所以者何？菩萨取于净国，皆为饶益诸众生故。譬如有人，欲于空地造立宫室，随意无碍；若于虚空，终不能成！菩萨如是，为成就众生故，愿取佛国，愿取佛国者，非于空也。","「宝积！当知：直心是菩萨净土——菩萨成佛时，不谄众生来生其国；深心是菩萨净土——菩萨成佛时，具足功德众生来生其国；菩提心是菩萨净土——菩萨成佛时，大乘众生来生其国；布施是菩萨净土——菩萨成佛时，一切能舍众生来生其国；持戒是菩萨净土——菩萨成佛时，行十善道满愿众生来生其国；忍辱是菩萨净土——菩萨成佛时，三十二相庄严众生来生其国；精进是菩萨净土——菩萨成佛时，勤修一切功德众生来生其国；禅定是菩萨净土——菩萨成佛时，摄心不乱众生来生其国；智慧是菩萨净土——菩萨成佛时，正定众生来生其国；四无量心是菩萨净土——菩萨成佛时，成就慈、悲、喜、舍众生来生其国；四摄法是菩萨净土——菩萨成佛时，解脱所摄众生来生其国；方便是菩萨净土——菩萨成佛时，于一切法方便无碍众生来生其国；三十七道品是菩萨净土——菩萨成佛时，念处、正勤、神足、根、力、觉、道众生来生其国；回向心是菩萨净土——菩萨成佛时，得一切具足功德国土；说除八难是菩萨净土——菩萨成佛时，国土无有三恶、八难；自守戒行、不讥彼阙是菩萨净土——菩萨成佛时，国土无有犯禁之名；十善是菩萨净土——菩萨成佛时，命不中夭、大富、梵行、所言诚谛、常以软语、眷属不离善和诤讼、言必饶益、不嫉、不恚、正见众生来生其国。","「如是，宝积！菩萨随其直心，则能发行；随其发行，则得深心；随其深心，则意调伏；随意调伏，则如说行；随如说行，则能回向；随其回向，则有方便；随其方便，则成就众生；随成就众生，则佛土净；随佛土净，则说法净；随说法净，则智慧净；随智慧净，则其心净；随其心净，则一切功德净。是故，宝积！若菩萨欲得净土，当净其心；随其心净，则佛土净。」","尔时舍利弗承佛威神作是念：「若菩萨心净，则佛土净者，我世尊本为菩萨时，意岂不净，而是佛土不净若此？」","佛知其念，即告之言：「于意云何？日月岂不净耶，而盲者不见？」","对曰：「不也，世尊！是盲者过，非日月咎。」","「舍利弗！众生罪故，不见如来佛土严净，非如来咎；舍利弗！我此土净，而汝不见。」","尔时螺髻梵王语舍利弗：「勿作是意，谓此佛土以为不净。所以者何？我见释迦牟尼佛土清净，譬如自在天宫。」","舍利弗言：「我见此土丘陵坑坎、荆蕀沙砾、土石诸山、秽恶充满。」","螺髻梵王言：「仁者心有高下，不依佛慧，故见此土为不净耳！舍利弗！菩萨于一切众生悉皆平等，深心清净，依佛智慧，则能见此佛土清净。」","于是佛以足指按地，即时三千大千世界，若干百千珍宝严饰，譬如宝庄严佛无量功德宝庄严土，一切大众叹未曾有，而皆自见坐宝莲华。佛告舍利弗：「汝且观是佛土严净？」","舍利弗言：「唯然，世尊！本所不见，本所不闻，今佛国土严净悉现。」","佛语舍利弗：「我佛国土常净若此，为欲度斯下劣人故，示是众恶不净土耳！譬如诸天，共宝器食，随其福德，饭色有异。如是，舍利弗！若人心净，便见此土功德庄严。」","当佛现此国土严净之时，宝积所将五百长者子皆得无生法忍，八万四千人皆发阿耨多罗三藐三菩提心。佛摄神足，于是世界还复如故；求声闻乘三万二千天及人，知有为法皆悉无常，远尘离垢，得法眼净；八千比丘，不受诸法，漏尽意解。","维摩诘所说经方便品第二","尔时毘耶离大城中有长者，名维摩诘，已曾供养无量诸佛，深植善本，得无生忍；辩才无碍，游戏神通，逮诸总持；获无所畏，降魔劳怨；入深法门，善于智度，通达方便，大愿成就；明了众生心之所趣，又能分别诸根利钝，久于佛道，心已纯淑，决定大乘；诸有所作，能善思量；住佛威仪，心大如海，诸佛咨嗟，弟子、释、梵、世主所敬。欲度人故，以善方便居毘耶离；资财无量，摄诸贫民；奉戒清净，摄诸毁禁；以忍调行，摄诸恚怒；以大精进，摄诸懈怠；一心禅寂，摄诸乱意；以决定慧，摄诸无智；虽为白衣，奉持沙门清净律行；虽处居家，不著三界；示有妻子，常修梵行；现有眷属，常乐远离；虽服宝饰，而以相好严身；虽复饮食，而以禅悦为味；若至博弈戏处，辄以度人；受诸异道，不毁正信；虽明世典，常乐佛法；一切见敬，为供养中最；执持正法，摄诸长幼；一切治生谐偶，虽获俗利，不以喜悦；游诸四衢，饶益众生；入治政法，救护一切；入讲论处，导以大乘；入诸学堂，诱开童蒙；入诸婬舍，示欲之过；入诸酒肆，能立其志；若在长者，长者中尊，为说胜法；若在居士，居士中尊，断其贪著；若在刹利，刹利中尊，教以忍辱；若在婆罗门，婆罗门中尊，除其我慢；若在大臣，大臣中尊，教以正法；若在王子，王子中尊，示以忠孝；若在内官，内官中尊，化政宫女；若在庶民，庶民中尊，令兴福力；若在梵天，梵天中尊，诲以胜慧；若在帝释，帝释中尊，示现无常；若在护世，护世中尊，护诸众生：长者维摩诘，以如是等无量方便饶益众生。","其以方便，现身有疾。以其疾故，国王、大臣、长者、居士、婆罗门等，及诸王子并余官属，无数千人，皆往问疾。其往者，维摩诘因以身疾广为说法：「诸仁者！是身无常、无强、无力、无坚、速朽之法，不可信也！为苦、为恼，众病所集。诸仁者！如此身，明智者所不怙；是身如聚沫，不可撮摩；是身如泡，不得久立；是身如炎，从渴爱生；是身如芭蕉，中无有坚；是身如幻，从颠倒起；是身如梦，为虚妄见；是身如影，从业缘现；是身如响，属诸因缘；是身如浮云，须臾变灭；是身如电，念念不住；是身无主，为如地；是身无我，为如火；是身无寿，为如风；是身无人，为如水；是身不实，四大为家；是身为空，离我、我所；是身无知，如草木瓦砾；是身无作，风力所转；是身不净，秽恶充满；是身为虚伪，虽假以澡浴衣食，必归磨灭；是身为灾，百一病恼；是身如丘井，为老所逼；是身无定，为要当死；是身如毒蛇、如怨贼、如空聚，阴、界、诸入所共合成。","「诸仁者！此可患厌，当乐佛身。所以者何？佛身者即法身也！从无量功德智慧生，从戒、定、慧、解脱、解脱知见生，从慈、悲、喜、舍生，从布施、持戒、忍辱、柔和、勤行精进、禅定、解脱、三昧、多闻、智慧诸波罗蜜生，从方便生，从六通生，从三明生，从三十七道品生，从止观生，从十力、四无所畏、十八不共法生，从断一切不善法、集一切善法生，从真实生，从不放逸生：从如是无量清净法生如来身。诸仁者！欲得佛身、断一切众生病者，当发阿耨多罗三藐三菩提心。」","如是，长者维摩诘为诸问疾者，如应说法，令无数千人皆发阿耨多罗三藐三菩提心。","维摩诘所说经弟子品第三","尔时长者维摩诘，自念：「寝疾于床，世尊大慈，宁不垂愍？」","佛知其意，即告舍利弗：「汝行诣维摩诘问疾。」","舍利弗白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔，曾于林中宴坐树下，时维摩诘来谓我言：『唯，舍利弗！不必是坐，为宴坐也。夫宴坐者，不于三界现身、意，是为宴坐；不起灭定而现诸威仪，是为宴坐；不舍道法而现凡夫事，是为宴坐；心不住内亦不在外，是为宴坐；于诸见不动，而修行三十七品，是为宴坐；不断烦恼而入涅槃，是为宴坐。若能如是坐者，佛所印可。』时我——世尊！——闻说是语，默然而止，不能加报，故我不任诣彼问疾。」","佛告大目犍连：「汝行诣维摩诘问疾。」","目连白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔入毘耶离大城，于里巷中为诸居士说法。时维摩诘来谓我言：『唯，大目连！为白衣居士说法，不当如仁者所说。夫说法者，当如法说。法无众生，离众生垢故；法无有我，离我垢故；法无寿命，离生死故；法无有人，前后际断故；法常寂然，灭诸相故；法离于相，无所缘故；法无名字，言语断故；法无有说，离觉观故；法无形相，如虚空故；法无戏论，毕竟空故；法无我所，离我所故；法无分别，离诸识故；法无有比，无相待故；法不属因，不在缘故；法同法性，入诸法故；法随于如，无所随故；法住实际，诸边不动故；法无动摇，不依六尘故；法无去来，常不住故；法顺空，随无相，应无作；法离好丑，法无增损，法无生灭，法无所归；法过眼、耳、鼻、舌、身、心；法无高下，法常住不动，法离一切观行。唯，大目连！法相如是，岂可说乎？夫说法者，无说无示；其听法者，无闻无得，譬如幻士，为幻人说法，当建是意，而为说法。当了众生根有利钝，善于知见无所罣碍，以大悲心赞于大乘，念报佛恩不断三宝，然后说法。』维摩诘说是法时，八百居士发阿耨多罗三藐三菩提心。我无此辩，是故不任诣彼问疾。」","佛告大迦叶：「汝行诣维摩诘问疾。」","迦叶白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔于贫里而行乞，时维摩诘来谓我言：『唯，大迦叶！有慈悲心而不能普，舍豪富从贫乞。迦叶！住平等法，应次行乞食。为不食故，应行乞食，为坏和合相故，应取揣食，为不受故，应受彼食；以空聚想，入于聚落，所见色与盲等，所闻声与响等，所嗅香与风等，所食味不分别，受诸触如智证，知诸法如幻相，无自性，无他性，本自不然，今则无灭。迦叶！若能不舍八邪，入八解脱，以邪相入正法，以一食施一切，供养诸佛及众贤圣，然后可食；如是食者，非有烦恼，非离烦恼，非入定意，非起定意，非住世间，非住涅槃；其有施者，无大福，无小福，不为益，不为损，是为正入佛道，不依声闻：迦叶！若如是食，为不空食人之施也。』时我——世尊！——闻说是语，得未曾有，即于一切菩萨深起敬心，复作是念：『斯有家名，辩才智慧乃能如是！其谁闻此不发阿耨多罗三藐三菩提心？』我从是来，不复劝人以声闻、辟支佛行。是故不任诣彼问疾。」","佛告须菩提：「汝行诣维摩诘问疾。」","须菩提白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔，入其舍从乞食，时维摩诘取我钵盛满饭，谓我言：『唯，须菩提！若能于食等者，诸法亦等，诸法等者，于食亦等；如是行乞，乃可取食。若须菩提不断婬、怒、痴，亦不与俱；不坏于身，而随一相；不灭痴爱，起于明脱；以五逆相而得解脱，亦不解不缚；不见四谛，非不见谛；非得果，非不得果；非凡夫，非离凡夫法；非圣人，非不圣人；虽成就一切法，而离诸法相，乃可取食。若须菩提不见佛，不闻法，彼外道六师——富兰那迦叶、末伽梨拘赊梨子、删阇夜毘罗胝子、阿耆多翅舍钦婆罗、迦罗鸠驮迦旃延、尼犍陀若提子等——是汝之师，因其出家，彼师所堕，汝亦随堕，乃可取食。若须菩提入诸邪见，不到彼岸；住于八难，不得无难；同于烦恼，离清净法；汝得无诤三昧，一切众生亦得是定——其施汝者，不名福田；供养汝者，堕三恶道——为与众魔共一手作诸劳侣——汝与众魔及诸尘劳，等无有异——于一切众生而有怨心，谤诸佛，毁于法，不入众数，终不得灭度。汝若如是，乃可取食。』时我——世尊！——闻此语茫然，不识是何言？不知以何答？便置钵欲出其舍。维摩诘言：『唯，须菩提！取钵勿惧。于意云何？如来所作化人，若以是事诘，宁有惧不？』我言：『不也！』维摩诘言：『一切诸法如幻化相，汝今不应有所惧也。所以者何？一切言说不离是相，至于智者，不著文字故无所惧。何以故？文字性离，无有文字，是则解脱；解脱相者，则诸法也。』维摩诘说是法时，二百天子得法眼净，故我不任诣彼问疾。」","佛告富楼那弥多罗尼子：「汝行诣维摩诘问疾。」","富楼那白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔于大林中，在一树下为诸新学比丘说法。时维摩诘来谓我言：『唯，富楼那！先当入定，观此人心然后说法。无以秽食置于宝器，当知是比丘心之所念，无以琉璃同彼水精。汝不能知众生根源，无得发起以小乘法。彼自无疮，勿伤之也；欲行大道，莫示小径；无以大海，内于牛迹；无以日光，等彼萤火。富楼那！此比丘久发大乘心，中忘此意，如何以小乘法而教导之？我观小乘智慧微浅，犹如盲人，不能分别一切众生根之利钝。』时维摩诘即入三昧，令此比丘自识宿命：曾于五百佛所植众德本，回向阿耨多罗三藐三菩提。即时豁然，还得本心，于是诸比丘稽首礼维摩诘足。时维摩诘因为说法，于阿耨多罗三藐三菩提不复退转。我念声闻不观人根，不应说法，是故不任诣彼问疾。」","佛告摩诃迦旃延：「汝行诣维摩诘问疾。」","迦旃延白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念昔者，佛为诸比丘略说法要，我即于后，敷演其义，谓无常义、苦义、空义、无我义、寂灭义。时维摩诘来谓我言：『唯，迦旃延！无以生灭心行说实相法。迦旃延！诸法毕竟不生不灭，是无常义；五受阴洞达空无所起，是苦义；诸法究竟无所有，是空义；于我、无我而不二，是无我义；法本不然，今则无灭，是寂灭义。』说是法时，彼诸比丘心得解脱。故我不任诣彼问疾。」","佛告阿那律：「汝行诣维摩诘问疾。」","阿那律白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔于一处经行，时有梵王，名曰严净，与万梵俱，放净光明，来诣我所，稽首作礼问我言：『几何阿那律天眼所见？』我即答言：『仁者！吾见此释迦牟尼佛土三千大千世界，如观掌中庵摩勒果。』时维摩诘来谓我言：『唯，阿那律！天眼所见，为作相耶，无作相耶？假使作相，则与外道五通等；若无作相，即是无为，不应有见。』世尊！我时默然。彼诸梵闻其言，得未曾有，即为作礼而问曰：『世孰有真天眼者？』维摩诘言：『有。佛、世尊得真天眼，常在三昧，悉见诸佛国，不以二相。』于是严净梵王及其眷属五百梵天，皆发阿耨多罗三藐三菩提心，礼维摩诘足已，忽然不现。故我不任诣彼问疾。」","佛告优波离：「汝行诣维摩诘问疾。」","优波离白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念昔者，有二比丘犯律行，以为耻不敢问佛，来问我言：『唯，优波离！我等犯律，诚以为耻，不敢问佛，愿解疑悔，得免斯咎。』我即为其如法解说。时维摩诘来谓我言：『唯，优波离！无重增此二比丘罪！当直除灭，勿扰其心。所以者何？彼罪性不在内、不在外、不在中间，如佛所说，心垢故众生垢，心净故众生净。心亦不在内、不在外、不在中间，如其心然，罪垢亦然，诸法亦然，不出于如如。优波离！以心相得解脱时，宁有垢不？』我言：『不也！』维摩诘言：『一切众生心相无垢，亦复如是。唯，优波离！妄想是垢，无妄想是净；颠倒是垢，无颠倒是净；取我是垢，不取我是净。优波离！一切法生灭不住，如幻如电，诸法不相待，乃至一念不住；诸法皆妄见，如梦、如炎、如水中月、如镜中像，以妄想生。其知此者，是名奉律；其知此者，是名善解。』于是二比丘言：『上智哉！是优波离所不能及，持律之上而不能说。』我即答言：『自舍如来，未有声闻及菩萨，能制其乐说之辩，其智慧明达为若此也！』时二比丘疑悔即除，发阿耨多罗三藐三菩提心，作是愿言：『令一切众生皆得是辩。』故我不任诣彼问疾。」","佛告罗睺罗：「汝行诣维摩诘问疾。」","罗睺罗白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念昔时，毘耶离诸长者子来诣我所，稽首作礼，问我言：『唯，罗睺罗！汝佛之子，舍转轮王位，出家为道。其出家者，有何等利？』我即如法为说出家功德之利。时维摩诘来谓我言：『唯，罗睺罗！不应说出家功德之利。所以者何？无利、无功德，是为出家；有为法者，可说有利、有功德。夫出家者，为无为法，无为法中，无利、无功德。罗睺罗！出家者，无彼无此，亦无中间；离六十二见，处于涅槃；智者所受，圣所行处；降伏众魔，度五道，净五眼，得五力，立五根；不恼于彼，离众杂恶；摧诸外道，超越假名；出淤泥，无系著；无我所，无所受；无扰乱，内怀喜；护彼意，随禅定，离众过；若能如是，是真出家。』于是维摩诘语诸长者子：『汝等于正法中，宜共出家。所以者何？佛世难值！』诸长者子言：『居士！我闻佛言，父母不听，不得出家。』维摩诘言：『然！汝等便发阿耨多罗三藐三菩提心，是即出家，是即具足。』尔时三十二长者子皆发阿耨多罗三藐三菩提心，故我不任诣彼问疾。」","佛告阿难：「汝行诣维摩诘问疾。」","阿难白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念昔时，世尊身小有疾，当用牛乳，我即持钵，诣大婆罗门家门下立。时维摩诘来谓我言：『唯，阿难！何为晨朝持钵住此？』我言：『居士！世尊身小有疾，当用牛乳，故来至此。』维摩诘言：『止，止！阿难！莫作是语！如来身者，金刚之体，诸恶已断，众善普会，当有何疾？当有何恼？默往！阿难！勿谤如来，莫使异人闻此麁言；无令大威德诸天，及他方净土诸来菩萨得闻斯语。阿难！转轮圣王以少福故，尚得无病，岂况如来无量福会普胜者哉？行矣，阿难！勿使我等受斯耻也。外道、梵志若闻此语，当作是念：「何名为师？自疾不能救，而能救诸疾人？」可密速去，勿使人闻。当知——阿难！——诸如来身，即是法身，非思欲身。佛为世尊，过于三界；佛身无漏，诸漏已尽；佛身无为，不堕诸数。如此之身，当有何疾？当有何恼？』时我——世尊！——实怀惭愧，得无近佛而谬听耶？即闻空中声曰：『阿难！如居士言。但为佛出五浊恶世，现行斯法，度脱众生。行矣，阿难！取乳勿惭。』世尊！维摩诘智慧辩才，为若此也！是故不任诣彼问疾。」","如是五百大弟子各各向佛说其本缘，称述维摩诘所言，皆曰不任诣彼问疾。","维摩诘所说经菩萨品第四","于是佛告弥勒菩萨：「汝行诣维摩诘问疾。」","弥勒白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔为兜率天王及其眷属，说不退转地之行。时维摩诘来谓我言：『弥勒！世尊授仁者记，一生当得阿耨多罗三藐三菩提。为用何生得受记乎？过去耶？未来耶？现在耶？若过去生，过去生已灭；若未来生，未来生未至；若现在生，现在生无住。如佛所说：「比丘！汝今即时亦生亦老亦灭。」若以无生得受记者，无生即是正位；于正位中，亦无受记，亦无得阿耨多罗三藐三菩提。云何弥勒受一生记乎？为从如生得受记耶？为从如灭得受记耶？若以如生得受记者，如无有生；若以如灭得受记者，如无有灭。一切众生皆如也，一切法亦如也，众圣贤亦如也，至于弥勒亦如也。若弥勒得受记者，一切众生亦应受记。所以者何？夫如者不二不异，若弥勒得阿耨多罗三藐三菩提者，一切众生皆亦应得。所以者何？一切众生即菩提相。若弥勒得灭度者，一切众生亦应灭度。所以者何？诸佛知一切众生毕竟寂灭，即涅槃相，不复更灭。是故，弥勒！无以此法诱诸天子，实无发阿耨多罗三藐三菩提心者，亦无退者。弥勒！当令此诸天子，舍于分别菩提之见。所以者何？菩提者不可以身得，不可以心得；寂灭是菩提，灭诸相故；不观是菩提，离诸缘故；不行是菩提，无忆念故；断是菩提，舍诸见故；离是菩提，离诸妄想故；障是菩提，障诸愿故；不入是菩提，无贪著故；顺是菩提，顺于如故；住是菩提，住法性故；至是菩提，至实际故；不二是菩提，离意法故；等是菩提，等虚空故；无为是菩提，无生住灭故；知是菩提，了众生心行故；不会是菩提，诸入不会故；不合是菩提，离烦恼习故；无处是菩提，无形色故；假名是菩提，名字空故；如化是菩提，无取舍故；无乱是菩提，常自静故；善寂是菩提，性清净故；无取是菩提，离攀缘故；无异是菩提，诸法等故；无比是菩提，无可喻故；微妙是菩提，诸法难知故。』世尊！维摩诘说是法时，二百天子得无生法忍。故我不任诣彼问疾。」","佛告光严童子：「汝行诣维摩诘问疾。」","光严白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔出毘耶离大城，时维摩诘方入城，我即为作礼而问言：『居士从何所来？』答我言：『吾从道场来。』我问：『道场者何所是？』答曰：『直心是道场，无虚假故；发行是道场，能办事故；深心是道场，增益功德故；菩提心是道场，无错谬故；布施是道场，不望报故；持戒是道场，得愿具故；忍辱是道场，于诸众生心无碍故；精进是道场，不懈退故；禅定是道场，心调柔故；智慧是道场，现见诸法故；慈是道场，等众生故；悲是道场，忍疲苦故；喜是道场，悦乐法故；舍是道场，憎爱断故；神通是道场，成就六通故；解脱是道场，能背舍故；方便是道场，教化众生故；四摄是道场，摄众生故；多闻是道场，如闻行故；伏心是道场，正观诸法故；三十七品是道场，舍有为法故；谛是道场，不诳世间故；缘起是道场，无明乃至老死皆无尽故；诸烦恼是道场，知如实故；众生是道场，知无我故；一切法是道场，知诸法空故；降魔是道场，不倾动故；三界是道场，无所趣故；师子吼是道场，无所畏故；力、无畏、不共法是道场，无诸过故；三明是道场，无余碍故；一念知一切法是道场，成就一切智故。如是，善男子！菩萨若应诸波罗蜜教化众生，诸有所作，举足下足，当知皆从道场来，住于佛法矣！』说是法时，五百天、人皆发阿耨多罗三藐三菩提心。故我不任诣彼问疾。」","佛告持世菩萨：「汝行诣维摩诘问疾。」","持世白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔，住于静室，时魔波旬，从万二千天女，状如帝释，鼓乐弦歌，来诣我所。与其眷属，稽首我足，合掌恭敬，于一面立。我意谓是帝释，而语之言：『善来憍尸迦！虽福应有，不当自恣。当观五欲无常，以求善本，于身命财而修坚法。』即语我言：『正士！受是万二千天女，可备扫洒。』我言：『憍尸迦！无以此非法之物要我沙门释子，此非我宜。』所言未讫，时维摩诘来谓我言：『非帝释也，是为魔来娆固汝耳！』即语魔言：『是诸女等，可以与我，如我应受。』魔即惊惧，念：『维摩诘将无恼我？』欲隐形去，而不能隐；尽其神力，亦不得去。即闻空中声曰：『波旬！以女与之，乃可得去。』魔以畏故，俛仰而与。","「尔时维摩诘语诸女言：『魔以汝等与我，今汝皆当发阿耨多罗三藐三菩提心。』即随所应而为说法，令发道意。复言：『汝等已发道意，有法乐可以自娱，不应复乐五欲乐也。』天女即问：『何谓法乐？』答言：『乐常信佛，乐欲听法，乐供养众，乐离五欲；乐观五阴如怨贼，乐观四大如毒蛇，乐观内入如空聚；乐随护道意，乐饶益众生，乐敬养师；乐广行施，乐坚持戒，乐忍辱柔和，乐勤集善根，乐禅定不乱，乐离垢明慧；乐广菩提心，乐降伏众魔，乐断诸烦恼，乐净佛国土，乐成就相好故，修诸功德；乐严道场；乐闻深法不畏；乐三脱门，不乐非时；乐近同学，乐于非同学中，心无恚碍；乐将护恶知识，乐亲近善知识；乐心喜清净，乐修无量道品之法。是为菩萨法乐。』","「于是波旬告诸女言：『我欲与汝俱还天宫。』诸女言：『以我等与此居士，有法乐我等甚乐，不复乐五欲乐也。』魔言：『居士可舍此女？一切所有施于彼者，是为菩萨。』维摩诘言：『我已舍矣！汝便将去，令一切众生得法愿具足。』于是诸女问维摩诘：『我等云何止于魔宫？』维摩诘言：『诸姊！有法门名无尽灯，汝等当学。无尽灯者，譬如一灯，燃百千灯，冥者皆明，明终不尽。如是，诸姊！夫一菩萨开导百千众生，令发阿耨多罗三藐三菩提心，于其道意亦不灭尽，随所说法而自增益一切善法，是名无尽灯也。汝等虽住魔宫，以是无尽灯，令无数天子天女发阿耨多罗三藐三菩提心者，为报佛恩，亦大饶益一切众生。』尔时天女头面礼维摩诘足，随魔还宫，忽然不现。世尊！维摩诘有如是自在神力、智慧辩才，故我不任诣彼问疾。」","佛告长者子善德：「汝行诣维摩诘问疾。」","善德白佛言：「世尊！我不堪任诣彼问疾。所以者何？忆念我昔自于父舍设大施会，供养一切沙门、婆罗门，及诸外道、贫穷、下贱、孤独、乞人。期满七日，时维摩诘来入会中，谓我言：『长者子！夫大施会不当如汝所设，当为法施之会，何用是财施会为？』我言：『居士！何谓法施之会？』答曰：『法施会者，无前无后，一时供养一切众生，是名法施之会。』曰：『何谓也？』『谓以菩提，起于慈心；以救众生，起大悲心；以持正法，起于喜心；以摄智慧，行于舍心；以摄悭贪，起檀波罗蜜；以化犯戒，起尸罗波罗蜜；以无我法，起羼提波罗蜜；以离身心相，起毘梨耶波罗蜜；以菩提相，起禅波罗蜜；以一切智，起般若波罗蜜。教化众生，而起于空；不舍有为法，而起无相；示现受生，而起无作；护持正法，起方便力；以度众生，起四摄法；以敬事一切，起除慢法；于身命财，起三坚法；于六念中，起思念法；于六和敬，起质直心；正行善法，起于净命；心净欢喜，起近贤圣；不憎恶人，起调伏心；以出家法，起于深心；以如说行，起于多闻；以无诤法，起空闲处；趣向佛慧，起于宴坐；解众生缚，起修行地；以具相好，及净佛土，起福德业；知一切众生心念，如应说法，起于智业；知一切法不取不舍，入一相门，起于慧业；断一切烦恼、一切障碍、一切不善法，起一切善业；以得一切智慧、一切善法，起于一切助佛道法。如是，善男子！是为法施之会。若菩萨住是法施会者，为大施主，亦为一切世间福田。』","「世尊！维摩诘说是法时，婆罗门众中二百人，皆发阿耨多罗三藐三菩提心。我时心得清净，叹未曾有！稽首礼维摩诘足，即解璎珞价直百千以上之，不肯取。我言：『居士！愿必纳受，随意所与。』维摩诘乃受璎珞，分作二分，持一分施此会中一最下乞人，持一分奉彼难胜如来。一切众会皆见光明国土难胜如来，又见珠璎在彼佛上变成四柱宝台，四面严饰，不相障蔽。时维摩诘现神变已，作是言：『若施主等心施一最下乞人，犹如如来福田之相，无所分别，等于大悲，不求果报，是则名曰具足法施。』城中一最下乞人，见是神力，闻其所说，皆发阿耨多罗三藐三菩提心，故我不任诣彼问疾。」","如是诸菩萨各各向佛说其本缘，称述维摩诘所言，皆曰不任诣彼问疾。","文殊师利问疾品第五","尔时佛告文殊师利：「汝行诣维摩诘问疾。」","文殊师利白佛言：「世尊！彼上人者，难为詶对。深达实相，善说法要，辩才无滞，智慧无碍；一切菩萨法式悉知，诸佛秘藏无不得入；降伏众魔，游戏神通，其慧方便，皆已得度。虽然，当承佛圣旨，诣彼问疾。」","于是众中诸菩萨、大弟子、释、梵、四天王等，咸作是念：「今二大士文殊师利、维摩诘共谈，必说妙法！」即时八千菩萨、五百声闻、百千天人皆欲随从。","于是文殊师利与诸菩萨、大弟子众及诸天人，恭敬围绕，入毘耶离大城。","尔时长者维摩诘心念：「今文殊师利与大众俱来！」即以神力空其室内，除去所有及诸侍者；唯置一床，以疾而卧。","文殊师利既入其舍，见其室空，无诸所有，独寝一床。时维摩诘言：「善来文殊师利！不来相而来，不见相而见。」","文殊师利言：「如是！居士！若来已，更不来；若去已，更不去。所以者何？来者无所从来，去者无所至，所可见者，更不可见。且置是事，居士！是疾宁可忍不？疗治有损，不至增乎？世尊慇懃致问无量。居士！是疾何所因起？其生久如？当云何灭？」","维摩诘言：「从痴、有爱，则我病生。以一切众生病，是故我病；若一切众生病灭，则我病灭。所以者何？菩萨为众生故入生死，有生死则有病；若众生得离病者，则菩萨无复病。譬如长者唯有一子。其子得病，父母亦病；若子病愈，父母亦愈。菩萨如是，于诸众生爱之若子。众生病，则菩萨病；众生病愈，菩萨亦愈。又言『是疾何所因起？』菩萨病者，以大悲起。」","文殊师利言：「居士！此室何以空无侍者？」","维摩诘言：「诸佛国土亦复皆空。」","又问：「以何为空？」","答曰：「以空空。」","又问：「空何用空？」","答曰：「以无分别空故空。」","又问：「空可分别耶？」","答曰：「分别亦空。」","又问：「空当于何求？」","答曰：「当于六十二见中求。」","又问：「六十二见当于何求？」","答曰：「当于诸佛解脱中求。」","又问：「诸佛解脱当于何求？」","答曰：「当于一切众生心行中求。又仁所问：『何无侍者？』一切众魔及诸外道，皆吾侍也。所以者何？众魔者乐生死，菩萨于生死而不舍；外道者乐诸见，菩萨于诸见而不动。」","文殊师利言：「居士所疾为何等相？」","维摩诘言：「我病无形不可见。」","又问：「此病身合耶？心合耶？」","答曰：「非身合，身相离故；亦非心合，心如幻故。」","又问：「地大、水大、火大、风大，于此四大，何大之病？」","答曰：「是病非地大，亦不离地大；水、火、风大，亦复如是。而众生病从四大起，以其有病，是故我病。」","尔时文殊师利问维摩诘言：「菩萨应云何慰喻有疾菩萨？」","维摩诘言：「说身无常，不说厌离于身；说身有苦，不说乐于涅槃；说身无我，而说教导众生；说身空寂，不说毕竟寂灭；说悔先罪，而不说入于过去；以己之疾，愍于彼疾；当识宿世无数劫苦，当念饶益一切众生；忆所修福，念于净命，勿生忧恼，常起精进；当作医王，疗治众病：菩萨应如是慰喻有疾菩萨，令其欢喜。」","文殊师利言：「居士！有疾菩萨云何调伏其心？」","维摩诘言：「有疾菩萨应作是念：『今我此病，皆从前世妄想颠倒、诸烦恼生，无有实法，谁受病者？所以者何？四大合故，假名为身；四大无主，身亦无我。又此病起，皆由著我，是故于我不应生著。』既知病本，即除我想及众生想。当起法想，应作是念：『但以众法合成此身；起唯法起，灭唯法灭；又此法者各不相知，起时不言我起，灭时不言我灭。』彼有疾菩萨为灭法想，当作是念：『此法想者，亦是颠倒，颠倒者是即大患，我应离之。』云何为离？离我、我所。云何离我、我所？谓离二法。云何离二法？谓不念内外，诸法行于平等。云何平等？谓我等、涅槃等。所以者何？我及涅槃，此二皆空。以何为空？但以名字故空。如此二法，无决定性，得是平等，无有余病，唯有空病；空病亦空。是有疾菩萨以无所受而受诸受，未具佛法，亦不灭受而取证也。","「设身有苦，念恶趣众生，起大悲心。我既调伏，亦当调伏一切众生；但除其病，而不除法，为断病本而教导之。何谓病本？谓有攀缘，从有攀缘，则为病本。何所攀缘？谓之三界。云何断攀缘？以无所得，若无所得，则无攀缘。何谓无所得？谓离二见——何谓二见？谓内见、外见——是无所得。文殊师利！是为有疾菩萨调伏其心，为断老病死苦，是菩萨菩提。若不如是，己所修治，为无慧利。譬如胜怨，乃可为勇。如是兼除老病死者，菩萨之谓也。","「彼有疾菩萨应复作是念：『如我此病，非真非有，众生病亦非真非有。』作是观时，于诸众生若起爱见大悲，即应舍离。所以者何？菩萨断除客尘烦恼而起大悲，爱见悲者，则于生死有疲厌心；若能离此，无有疲厌，在在所生，不为爱见之所覆也。所生无缚，能为众生说法解缚，如佛所说：『若自有缚能解彼缚，无有是处；若自无缚能解彼缚，斯有是处。』是故菩萨不应起缚。何谓缚？何谓解？贪著禅味，是菩萨缚；以方便生，是菩萨解。又无方便慧缚，有方便慧解；无慧方便缚，有慧方便解。何谓无方便慧缚？谓菩萨以爱见心庄严佛土、成就众生；于空、无相、无作法中，而自调伏，是名无方便慧缚。何谓有方便慧解？谓不以爱见心庄严佛土、成就众生，于空、无相、无作法中，以自调伏而不疲厌，是名有方便慧解。何谓无慧方便缚？谓菩萨住贪欲、瞋恚、邪见等诸烦恼，而植众德本，是名无慧方便缚。何谓有慧方便解？谓离诸贪欲、瞋恚、邪见等诸烦恼，而植众德本，回向阿耨多罗三藐三菩提，是名有慧方便解。文殊师利！彼有疾菩萨，应如是观诸法。又复观身无常、苦、空、非我，是名为慧，虽身有疾，常在生死，饶益一切，而不厌倦，是名方便；又复观身，身不离病，病不离身，是病是身，非新非故，是名为慧，设身有疾，而不永灭，是名方便。","「文殊师利！有疾菩萨应如是调伏其心，不住其中，亦复不住不调伏心。所以者何？若住不调伏心，是愚人法；若住调伏心，是声闻法。是故菩萨不当住于调伏、不调伏心，离此二法，是菩萨行。在于生死，不为污行；住于涅槃，不永灭度，是菩萨行；非凡夫行，非贤圣行，是菩萨行；非垢行，非净行，是菩萨行；虽过魔行，而现降众魔，是菩萨行；求一切智，无非时求，是菩萨行；虽观诸法不生，而不入正位，是菩萨行；虽观十二缘起，而入诸邪见，是菩萨行；虽摄一切众生，而不爱著，是菩萨行；虽乐远离，而不依身心尽，是菩萨行；虽行三界，而不坏法性，是菩萨行；虽行于空，而植众德本，是菩萨行；虽行无相，而度众生，是菩萨行；虽行无作，而现受身，是菩萨行；虽行无起，而起一切善行，是菩萨行；虽行六波罗蜜，而遍知众生心、心数法，是菩萨行；虽行六通，而不尽漏，是菩萨行；虽行四无量心，而不贪著生于梵世，是菩萨行；虽行禅定解脱三昧，而不随禅生，是菩萨行；虽行四念处，而不永离身、受、心、法，是菩萨行；虽行四正勤，而不舍身心精进，是菩萨行；虽行四如意足，而得自在神通，是菩萨行；虽行五根，而分别众生诸根利钝，是菩萨行；虽行五力，而乐求佛十力，是菩萨行；虽行七觉分，而分别佛之智慧，是菩萨行；虽行八圣道，而乐行无量佛道，是菩萨行；虽行止观助道之法，而不毕竟堕于寂灭，是菩萨行；虽行诸法不生不灭，而以相好庄严其身，是菩萨行；虽现声闻、辟支佛威仪，而不舍佛法，是菩萨行；虽随诸法究竟净相，而随所应为现其身，是菩萨行；虽观诸佛国土永寂如空，而现种种清净佛土，是菩萨行；虽得佛道转于法轮、入于涅槃，而不舍于菩萨之道，是菩萨行。」","说是语时，文殊师利所将大众其中八千天子，皆发阿耨多罗三藐三菩提心。","维摩诘所说经不思议品第六","尔时舍利弗见此室中无有床座，作是念：「斯诸菩萨、大弟子众，当于何坐？」","长者维摩诘知其意，语舍利弗言：「云何仁者？为法来耶？求床座耶？」","舍利弗言：「我为法来，非为床座。」","维摩诘言：「唯，舍利弗！夫求法者，不贪躯命，何况床座？夫求法者，非有色、受、想、行、识之求，非有界、入之求，非有欲、色、无色之求。唯，舍利弗！夫求法者，不著佛求，不著法求，不著众求；夫求法者，无见苦求，无断集求，无造尽证、修道之求。所以者何？法无戏论，若言我当见苦、断集、证灭、修道，是则戏论，非求法也。唯，舍利弗！法名寂灭，若行生灭，是求生灭，非求法也；法名无染，若染于法乃至涅槃，是则染著，非求法也；法无行处，若行于法，是则行处，非求法也；法无取舍，若取舍法，是则取舍，非求法也；法无处所，若著处所，是则著处，非求法也；法名无相，若随相识，是则求相，非求法也；法不可住，若住于法，是则住法，非求法也；法不可见、闻、觉、知，若行见、闻、觉、知，是则见、闻、觉、知，非求法也；法名无为，若行有为，是求有为，非求法也：是故，舍利弗！若求法者，于一切法，应无所求。」","说是语时，五百天子于诸法中得法眼净。","尔时，长者维摩诘问文殊师利：「仁者游于无量千万亿阿僧祇国，何等佛土有好上妙功德成就师子之座？」","文殊师利言：「居士！东方度三十六恒河沙国，有世界名须弥相，其佛号须弥灯王，今现在。彼佛身长八万四千由旬，其师子座高八万四千由旬，严饰第一。」","于是长者维摩诘现神通力，即时彼佛遣三万二千师子座，高广严净，来入维摩诘室，诸菩萨、大弟子、释、梵、四天王等，昔所未见。其室广博，悉皆包容三万二千师子座，无所妨碍。于毘耶离城及阎浮提、四天下，亦不迫迮，悉见如故。","尔时维摩诘语文殊师利：「就师子座！与诸菩萨上人俱坐，当自立身如彼座像。」其得神通菩萨，即自变形为四万二千由旬，坐师子座，诸新发意菩萨及大弟子皆不能升。","尔时维摩诘语舍利弗：「就师子座！」舍利弗言：「居士！此座高广，吾不能升。」","维摩诘言：「唯，舍利弗！为须弥灯王如来作礼，乃可得坐。」于是新发意菩萨及大弟子即为须弥灯王如来作礼，便得坐师子座。","舍利弗言：「居士！未曾有也！如是小室，乃容受此高广之座，于毘耶离城无所妨碍，又于阎浮提聚落、城邑，及四天下诸天、龙王、鬼神宫殿，亦不迫迮。」","维摩诘言：「唯，舍利弗！诸佛菩萨，有解脱名不可思议。若菩萨住是解脱者，以须弥之高广内芥子中无所增减，须弥山王本相如故，而四天王、忉利诸天不觉不知己之所入，唯应度者乃见须弥入芥子中，是名住不思议解脱法门。又以四大海水入一毛孔，不娆鱼、鼈、鼋、鼍水性之属，而彼大海本相如故，诸龙、鬼神、阿修罗等不觉不知己之所入，于此众生亦无所娆。又，舍利弗！住不可思议解脱菩萨，断取三千大千世界，如陶家轮，著右掌中，掷过恒河沙世界之外，其中众生不觉不知己之所往；又复还置本处，都不使人有往来想，而此世界本相如故。又，舍利弗！或有众生乐久住世而可度者，菩萨即延七日以为一劫，令彼众生谓之一劫；或有众生不乐久住而可度者，菩萨即促一劫以为七日，令彼众生谓之七日。又，舍利弗！住不可思议解脱菩萨，以一切佛土严饰之事集在一国，示于众生。又菩萨以一佛土众生置之右掌，飞到十方遍示一切，而不动本处。又，舍利弗！十方众生供养诸佛之具，菩萨于一毛孔皆令得见；又十方国土所有日、月、星宿，于一毛孔普使见之。又，舍利弗！十方世界所有诸风，菩萨悉能吸著口中，而身无损，外诸树木亦不摧折；又十方世界劫尽烧时，以一切火内于腹中，火事如故而不为害。又于下方过恒河沙等诸佛世界，取一佛土举著上方，过恒河沙无数世界，如持针锋举一枣叶，而无所娆。又，舍利弗！住不可思议解脱菩萨，能以神通现作佛身，或现辟支佛身，或现声闻身，或现帝释身，或现梵王身，或现世主身，或现转轮王身。又十方世界所有众声上、中、下音，皆能变之令作佛声，演出无常、苦、空、无我之音，及十方诸佛所说种种之法，皆于其中普令得闻。舍利弗！我今略说菩萨不可思议解脱之力，若广说者，穷劫不尽。」","是时大迦叶闻说菩萨不可思议解脱法门，叹未曾有，谓舍利弗：「譬如有人，于盲者前现众色像，非彼所见；一切声闻闻是不可思议解脱法门，不能解了，为若此也！智者闻是，其谁不发阿耨多罗三藐三菩提心？我等何为永绝其根，于此大乘已如败种！一切声闻闻是不可思议解脱法门，皆应号泣，声震三千大千世界；一切菩萨应大欣庆，顶受此法。若有菩萨信解不可思议解脱法门者，一切魔众无如之何。」大迦叶说是语时，三万二千天子皆发阿耨多罗三藐三菩提心。","尔时维摩诘语大迦叶：「仁者！十方无量阿僧祇世界中作魔王者，多是住不可思议解脱菩萨。以方便力教化众生，现作魔王。又，迦叶！十方无量菩萨，或有人从乞手足耳鼻、头目髓脑、血肉皮骨、聚落城邑、妻子奴婢、象马车乘、金银琉璃、车磲马碯、珊瑚琥珀、真珠珂贝、衣服饮食，如此乞者，多是住不可思议解脱菩萨，以方便力而往试之，令其坚固。所以者何？住不可思议解脱菩萨，有威德力，故现行逼迫，示诸众生如是难事；凡夫下劣，无有力势，不能如是逼迫菩萨。譬如龙象蹴踏，非驴所堪。是名住不可思议解脱菩萨智慧方便之门。」","维摩诘所说经观众生品第七","尔时文殊师利问维摩诘言：「菩萨云何观于众生？」","维摩诘言：「譬如幻师，见所幻人，菩萨观众生为若此。如智者见水中月，如镜中见其面像，如热时焰，如呼声响，如空中云，如水聚沫，如水上泡，如芭蕉坚，如电久住，如第五大，如第六阴，如第七情，如十三入，如十九界，菩萨观众生为若此。如无色界色，如焦谷牙，如须陀洹身见，如阿那含入胎，如阿罗汉三毒，如得忍菩萨贪恚毁禁，如佛烦恼习，如盲者见色，如入灭尽定出入息，如空中鸟迹，如石女儿，如化人起烦恼，如梦所见已寤，如灭度者受身，如无因之火，菩萨观众生为若此。」","文殊师利言：「若菩萨作是观者，云何行慈？」","维摩诘言：「菩萨作是观已，自念：『我当为众生说如斯法。』是即真实慈也。行寂灭慈，无所生故；行不热慈，无烦恼故；行等之慈，等三世故；行无诤慈，无所起故；行不二慈，内外不合故；行不坏慈，毕竟尽故；行坚固慈，心无毁故；行清净慈，诸法性净故；行无边慈，如虚空故；行阿罗汉慈，破结贼故；行菩萨慈，安众生故；行如来慈，得如相故；行佛之慈，觉众生故；行自然慈，无因得故；行菩提慈，等一味故；行无等慈，断诸爱故；行大悲慈，导以大乘故；行无厌慈，观空无我故；行法施慈，无遗惜故；行持戒慈，化毁禁故；行忍辱慈，护彼我故；行精进慈，荷负众生故；行禅定慈，不受味故；行智慧慈，无不知时故；行方便慈，一切示现故；行无隐慈，直心清净故；行深心慈，无杂行故；行无诳慈，不虚假故；行安乐慈，令得佛乐故。菩萨之慈，为若此也。」","文殊师利又问：「何谓为悲？」","答曰：「菩萨所作功德，皆与一切众生共之。」","「何谓为喜？」","答曰：「有所饶益，欢喜无悔。」","「何谓为舍？」","答曰：「所作福祐，无所悕望。」","文殊师利又问：「生死有畏，菩萨当何所依？」","维摩诘言：「菩萨于生死畏中，当依如来功德之力。」","文殊师利又问：「菩萨欲依如来功德之力，当于何住？」","答曰：「菩萨欲依如来功德力者，当住度脱一切众生。」","又问：「欲度众生，当何所除？」","答曰：「欲度众生，除其烦恼。」","又问：「欲除烦恼，当何所行？」","答曰：「当行正念。」","又问：「云何行于正念？」","答曰：「当行不生不灭。」","又问：「何法不生？何法不灭？」","答曰：「不善不生，善法不灭。」","又问：「善、不善孰为本？」","答曰：「身为本。」","又问：「身孰为本？」","答曰：「欲贪为本。」","又问：「欲贪孰为本？」","答曰：「虚妄分别为本。」","又问：「虚妄分别孰为本？」","答曰：「颠倒想为本。」","又问：「颠倒想孰为本？」","答曰：「无住为本。」","又问：「无住孰为本？」","答曰：「无住则无本。文殊师利！从无住本，立一切法。」","时维摩诘室有一天女，见诸大人闻所说法，便现其身，即以天华散诸菩萨、大弟子上。华至诸菩萨，即皆堕落，至大弟子，便著不堕。一切弟子神力去华，不能令去。尔时天女问舍利弗：「何故去华？」","答曰：「此华不如法，是以去之。」","天曰：「勿谓此华为不如法。所以者何？是华无所分别，仁者自生分别想耳！若于佛法出家，有所分别，为不如法；若无所分别，是则如法。观诸菩萨华不著者，已断一切分别想故。譬如人畏时，非人得其便；如是弟子畏生死故，色、声、香、味、触得其便也。已离畏者，一切五欲无能为也；结习未尽，华著身耳！结习尽者，华不著也。」","舍利弗言：「天止此室，其已久如？」","答曰：「我止此室，如耆年解脱。」","舍利弗言：「止此久耶？」","天曰：「耆年解脱，亦何如久？」","舍利弗默然不答。天曰：「如何耆旧大智而默？」","答曰：「解脱者无所言说，故吾于是不知所云。」","天曰：「言说文字，皆解脱相。所以者何？解脱者，不内不外，不在两间；文字亦不内不外，不在两间。是故，舍利弗！无离文字说解脱也。所以者何？一切诸法是解脱相。」","舍利弗言：「不复以离婬、怒、痴为解脱乎？」","天曰：「佛为增上慢人说离婬、怒、痴为解脱耳；若无增上慢者，佛说婬、怒、痴性，即是解脱。」","舍利弗言：「善哉，善哉！天女！汝何所得？以何为证？辩乃如是！」","天曰：「我无得无证，故辩如是。所以者何？若有得有证者，即于佛法为增上慢。」","舍利弗问天：「汝于三乘为何志求？」","天曰：「以声闻法化众生故，我为声闻；以因缘法化众生故，我为辟支佛；以大悲法化众生故，我为大乘。舍利弗！如人入瞻卜林，唯嗅瞻卜，不嗅余香。如是，若入此室，但闻佛功德之香，不乐闻声闻、辟支佛功德香也。舍利弗！其有释、梵、四天王，诸天、龙、鬼神等，入此室者，闻斯上人讲说正法，皆乐佛功德之香，发心而出。舍利弗！吾止此室十有二年，初不闻说声闻、辟支佛法，但闻菩萨大慈大悲、不可思议诸佛之法。舍利弗！此室常现八未曾有难得之法。何等为八？此室常以金色光照，昼夜无异，不以日月所照为明，是为一未曾有难得之法；此室入者，不为诸垢之所恼也，是为二未曾有难得之法；此室常有释、梵、四天王、他方菩萨来会不绝，是为三未曾有难得之法；此室常说六波罗蜜不退转法，是为四未曾有难得之法；此室常作天人第一之乐，弦出无量法化之声，是为五未曾有难得之法；此室有四大藏，众宝积满，赒穷济乏，求得无尽，是为六未曾有难得之法；此室释迦牟尼佛、阿弥陀佛、阿閦佛、宝德、宝炎、宝月、宝严、难胜、师子响一切利成，如是等十方无量诸佛，是上人念时即皆为来，广说诸佛秘要法藏，说已还去，是为七未曾有难得之法；此室一切诸天严饰宫殿、诸佛净土，皆于中现，是为八未曾有难得之法。舍利弗！此室常现八未曾有难得之法，谁有见斯不思议事，而复乐于声闻法乎？」","舍利弗言：「汝何以不转女身？」","天曰：「我从十二年来，求女人相了不可得，当何所转？譬如幻师化作幻女，若有人问：『何以不转女身？』是人为正问不？」","舍利弗言：「不也！幻无定相，当何所转？」","天曰：「一切诸法亦复如是，无有定相，云何乃问不转女身？」","即时天女以神通力，变舍利弗令如天女，天自化身如舍利弗，而问言：「何以不转女身？」","舍利弗以天女像而答言：「我今不知何转而变为女身？」","天曰：「舍利弗！若能转此女身，则一切女人亦当能转。如舍利弗非女而现女身，一切女人亦复如是，虽现女身，而非女也。是故佛说一切诸法非男、非女。」","即时天女还摄神力，舍利弗身还复如故。天问舍利弗：「女身色相今何所在？」","舍利弗言：「女身色相，无在无不在。」","天曰：「一切诸法，亦复如是，无在无不在。夫无在无不在者，佛所说也。」","舍利弗问天：「汝于此没，当生何所？」","天曰：「佛化所生，吾如彼生。」","曰：「佛化所生，非没生也。」","天曰：「众生犹然，无没生也。」","舍利弗问天：「汝久如当得阿耨多罗三藐三菩提？」","天曰：「如舍利弗还为凡夫，我乃当成阿耨多罗三藐三菩提。」","舍利弗言：「我作凡夫，无有是处。」","天曰：「我得阿耨多罗三藐三菩提，亦无是处。所以者何？菩提无住处，是故无有得者。」","舍利弗言：「今诸佛得阿耨多罗三藐三菩提，已得、当得如恒河沙，皆谓何乎？」","天曰：「皆以世俗文字数故，说有三世，非谓菩提有去、来、今。」","天曰：「舍利弗！汝得阿罗汉道耶？」","曰：「无所得故而得。」","天曰：「诸佛、菩萨亦复如是，无所得故而得。」","尔时维摩诘语舍利弗：「是天女已曾供养九十二亿佛，已能游戏菩萨神通，所愿具足，得无生忍，住不退转；以本愿故，随意能现，教化众生。」","维摩诘所说经佛道品第八","尔时文殊师利问维摩诘言：「菩萨云何通达佛道？」","维摩诘言：「若菩萨行于非道，是为通达佛道。」","又问：「云何菩萨行于非道？」","答曰：「若菩萨行五无间，而无恼恚；至于地狱，无诸罪垢；至于畜生，无有无明、憍慢等过；至于饿鬼，而具足功德；行色、无色界道，不以为胜。示行贪欲，离诸染著；示行瞋恚，于诸众生无有恚阂；示行愚痴，而以智慧调伏其心；示行悭贪，而舍内外所有，不惜身命；示行毁禁，而安住净戒，乃至小罪犹怀大惧；示行瞋恚，而常慈忍；示行懈怠，而懃修功德；示行乱意，而常念定；示行愚痴，而通达世间、出世间慧；示行谄伪，而善方便随诸经义；示行憍慢，而于众生犹如桥梁；示行诸烦恼，而心常清净；示入于魔，而顺佛智慧，不随他教；示入声闻，而为众生说未闻法；示入辟支佛，而成就大悲，教化众生；示入贫穷，而有宝手，功德无尽；示入形残，而具诸相好，以自庄严；示入下贱，而生佛种姓中，具诸功德；示入羸劣丑陋，而得那罗延身，一切众生之所乐见；示入老病，而永断病根，超越死畏；示有资生，而恒观无常，实无所贪；示有妻妾采女，而常远离五欲淤泥；现于讷钝，而成就辩才，总持无失；示入邪济，而以正济度诸众生；现遍入诸道，而断其因缘；现于涅槃，而不断生死。文殊师利！菩萨能如是行于非道，是为通达佛道。」","于是维摩诘问文殊师利：「何等为如来种？」","文殊师利言：「有身为种，无明有爱为种，贪恚痴为种，四颠倒为种，五盖为种，六入为种，七识处为种，八邪法为种，九恼处为种，十不善道为种：以要言之，六十二见及一切烦恼，皆是佛种。」","曰：「何谓也？」","答曰：「若见无为入正位者，不能复发阿耨多罗三藐三菩提心。譬如高原陆地不生莲华，卑湿淤泥乃生此华；如是见无为法入正位者，终不复能生于佛法，烦恼泥中，乃有众生起佛法耳！又如殖种于空，终不得生，粪壤之地，乃能滋茂；如是入无为正位者，不生佛法，起于我见如须弥山，犹能发于阿耨多罗三藐三菩提心，生佛法矣！是故，当知一切烦恼为如来种。譬如不下巨海，不能得无价宝珠；如是不入烦恼大海，则不能得一切智宝。」","尔时大迦叶叹言：「善哉，善哉！文殊师利！快说此语。诚如所言，尘劳之畴为如来种；我等今者，不复堪任发阿耨多罗三藐三菩提心，乃至五无间罪，犹能发意生于佛法，而今我等永不能发。譬如根败之士，其于五欲不能复利；如是声闻诸结断者，于佛法中无所复益，永不志愿。是故，文殊师利！凡夫于佛法有返复，而声闻无也。所以者何？凡夫闻佛法，能起无上道心，不断三宝；正使声闻终身闻佛法、力、无畏等，永不能发无上道意。」","尔时会中有菩萨，名普现色身，问维摩诘言：「居士！父母妻子、亲戚眷属、吏民知识，悉为是谁？奴婢僮仆、象马车乘，皆何所在？」","于是维摩诘以偈答曰：",`「智度菩萨母，　方便以为父，
一切众导师，　无不由是生。
法喜以为妻，　慈悲心为女，
善心诚实男，　毕竟空寂舍。
弟子众尘劳，　随意之所转，
道品善知识，　由是成正觉。
诸度法等侣，　四摄为伎女，
歌咏诵法言，　以此为音乐。
总持之园苑，　无漏法林树，
觉意净妙华，　解脱智慧果。
八解之浴池，　定水湛然满，
布以七净华，　浴此无垢人。
象马五通驰，　大乘以为车，
调御以一心，　游于八正路。
相具以严容，　众好饰其姿，
惭愧之上服，　深心为华鬘。
富有七财宝，　教授以滋息，
如所说修行，　回向为大利。
四禅为床座，　从于净命生，
多闻增智慧，　以为自觉音。
甘露法之食，　解脱味为浆，
净心以澡浴，　戒品为涂香。
摧灭烦恼贼，　勇健无能逾，
降伏四种魔，　胜幡建道场。
虽知无起灭，　示彼故有生，
悉现诸国土，　如日无不见。
供养于十方，　无量亿如来，
诸佛及己身，　无有分别想。
虽知诸佛国，　及与众生空，
而常修净土，　教化于群生。
诸有众生类，　形声及威仪，
无畏力菩萨，　一时能尽现。
觉知众魔事，　而示随其行，
以善方便智，　随意皆能现。
或示老病死，　成就诸群生，
了知如幻化，　通达无有碍；
或现劫尽烧，　天地皆洞然，
众人有常想，　照令知无常。
无数亿众生，　俱来请菩萨，
一时到其舍，　化令向佛道。
经书禁呪术，　工巧诸伎艺，
尽现行此事，　饶益诸群生。
世间众道法，　悉于中出家，
因以解人惑，　而不堕邪见。
或作日月天，　梵王世界主，
或时作地水，　或复作风火。
劫中有疾疫，　现作诸药草，
若有服之者，　除病消众毒；
劫中有饥馑，　现身作饮食，
先救彼饥渴，　却以法语人；
劫中有刀兵，　为之起慈悲，
化彼诸众生，　令住无诤地。
若有大战阵，　立之以等力，
菩萨现威势，　降伏使和安。
一切国土中，　诸有地狱处，
辄往到于彼，　勉济其苦恼；
一切国土中，　畜生相食噉，
皆现生于彼，　为之作利益。
示受于五欲，　亦复现行禅，
令魔心愦乱，　不能得其便。
火中生莲华，　是可谓希有，
在欲而行禅，　希有亦如是。
或现作婬女，　引诸好色者，
先以欲钩牵，　后令入佛智；
或为邑中主，　或作商人导，
国师及大臣，　以祐利众生。
诸有贫穷者，　现作无尽藏，
因以劝导之，　令发菩提心。
我心憍慢者，　为现大力士，
消伏诸贡高，　令住无上道。
其有恐惧众，　居前而慰安，
先施以无畏，　后令发道心。
或现离婬欲，　为五通仙人，
开导诸群生，　令住戒忍慈。
见须供事者，　现为作僮仆，
既悦可其意，　乃发以道心，
随彼之所须，　得入于佛道，
以善方便力，　皆能给足之。
如是道无量，　所行无有涯，
智慧无边际，　度脱无数众。
假令一切佛，　于无量亿劫，
赞叹其功德，　犹尚不能尽。
谁闻如是法，　不发菩提心？
除彼不肖人，　痴冥无智者。」`,"维摩诘所说经入不二法门品第九","尔时维摩诘谓众菩萨言：「诸仁者！云何菩萨入不二法门？各随所乐说之。」","会中有菩萨名法自在，说言：「诸仁者！生灭为二。法本不生，今则无灭，得此无生法忍，是为入不二法门。」","德守菩萨曰：「我、我所为二。因有我故，便有我所；若无有我，则无我所，是为入不二法门。」","不眴菩萨曰：「受、不受为二。若法不受，则不可得；以不可得故，无取无舍、无作无行，是为入不二法门。」","德顶菩萨曰：「垢、净为二。见垢实性，则无净相，顺于灭相，是为入不二法门。」","善宿菩萨曰：「是动、是念为二。不动则无念，无念则无分别，通达此者，是为入不二法门。」","善眼菩萨曰：「一相、无相为二。若知一相即是无相，亦不取无相，入于平等，是为入不二法门。」","妙臂菩萨曰：「菩萨心、声闻心为二。观心相空如幻化者，无菩萨心、无声闻心，是为入不二法门。」","弗沙菩萨曰：「善、不善为二。若不起善、不善，入无相际而通达者，是为入不二法门。」","师子菩萨曰：「罪、福为二。若达罪性，则与福无异，以金刚慧决了此相，无缚无解者，是为入不二法门。」","师子意菩萨曰：「有漏、无漏为二。若得诸法等，则不起漏、不漏想，不著于相，亦不住无相，是为入不二法门。」","净解菩萨曰：「有为、无为为二。若离一切数，则心如虚空，以清净慧无所碍者，是为入不二法门。」","那罗延菩萨曰：「世间、出世间为二。世间性空，即是出世间，于其中不入、不出、不溢、不散，是为入不二法门。」","善意菩萨曰：「生死、涅槃为二。若见生死性，则无生死，无缚无解，不然不灭，如是解者，是为入不二法门。」","现见菩萨曰：「尽、不尽为二。法若究竟尽、若不尽，皆是无尽相；无尽相即是空，空则无有尽、不尽相。如是入者，是为入不二法门。」","普守菩萨曰：「我、无我为二。我尚不可得，非我何可得？见我实性者，不复起二，是为入不二法门。」","电天菩萨曰：「明、无明为二。无明实性即是明，明亦不可取，离一切数，于其中平等无二者，是为入不二法门。」","喜见菩萨曰：「色、色空为二。色即是空，非色灭空，色性自空；如是，受、想、行、识、识空为二，识即是空，非识灭空，识性自空，于其中而通达者，是为入不二法门。」","明相菩萨曰：「四种异、空种异为二。四种性即是空种性，如前际、后际空故，中际亦空。若能如是知诸种性者，是为入不二法门。」","妙意菩萨曰：「眼、色为二。若知眼性，于色不贪、不恚、不痴，是名寂灭；如是，耳、声，鼻、香，舌、味，身、触，意、法为二，若知意性，于法不贪、不恚、不痴，是名寂灭，安住其中，是为入不二法门。」","无尽意菩萨曰：「布施、回向一切智为二。布施性即是回向一切智性，如是，持戒、忍辱、精进、禅定、智慧、回向一切智为二，智慧性即是回向一切智性，于其中入一相者，是为入不二法门。」","深慧菩萨曰：「是空、是无相、是无作为二。空即无相，无相即无作；若空、无相、无作，则无心、意、识，于一解脱门即是三解脱门者，是为入不二法门。」","寂根菩萨曰：「佛、法、众为二。佛即是法，法即是众，是三宝皆无为相，与虚空等，一切法亦尔。能随此行者，是为入不二法门。」","心无碍菩萨曰：「身、身灭为二。身即是身灭。所以者何？见身实相者，不起见身及见灭身，身与灭身无二无分别，于其中不惊、不惧者，是为入不二法门。」","上善菩萨曰：「身、口、意业为二。是三业皆无作相，身无作相，即口无作相；口无作相，即意无作相；是三业无作相，即一切法无作相。能如是随无作慧者，是为入不二法门。」","福田菩萨曰：「福行、罪行、不动行为二。三行实性即是空，空则无福行、无罪行、无不动行。于此三行而不起者，是为入不二法门。」","华严菩萨曰：「从我起二为二。见我实相者，不起二法；若不住二法，则无有识；无所识者，是为入不二法门。」","德藏菩萨曰：「有所得相为二。若无所得，则无取舍；无取舍者，是为入不二法门。」","月上菩萨曰：「暗与明为二。无暗、无明，则无有二。所以者何？如入灭受想定，无暗、无明，一切法相亦复如是，于其中平等入者，是为入不二法门。」","宝印手菩萨曰：「乐涅槃、不乐世间为二。若不乐涅槃、不厌世间，则无有二。所以者何？若有缚，则有解；若本无缚，其谁求解？无缚无解，则无乐、厌，是为入不二法门。」","珠顶王菩萨曰：「正道、邪道为二。住正道者，则不分别是邪是正，离此二者，是为入不二法门。」","乐实菩萨曰：「实、不实为二。实见者尚不见实，何况非实？所以者何？非肉眼所见，慧眼乃能见，而此慧眼，无见无不见，是为入不二法门。」","如是诸菩萨各各说已，问文殊师利：「何等是菩萨入不二法门？」","文殊师利曰：「如我意者，于一切法无言无说，无示无识，离诸问答，是为入不二法门。」","于是文殊师利问维摩诘：「我等各自说已，仁者当说何等是菩萨入不二法门？」","时维摩诘默然无言。","文殊师利叹曰：「善哉，善哉！乃至无有文字、语言，是真入不二法门。」","说是入不二法门品时，于此众中五千菩萨，皆入不二法门，得无生法忍。","香积佛品第十","于是舍利弗心念：「日时欲至，此诸菩萨当于何食？」","时维摩诘知其意而语言：「佛说八解脱，仁者受行，岂杂欲食而闻法乎？若欲食者，且待须臾，当令汝得未曾有食。」","时维摩诘即入三昧，以神通力示诸大众上方界分，过四十二恒河沙佛土，有国名众香，佛号香积，今现在。其国香气，比于十方诸佛世界人、天之香，最为第一。彼土无有声闻、辟支佛名，唯有清净大菩萨众，佛为说法。其界一切皆以香作楼阁，经行香地，苑园皆香。其食香气，周流十方无量世界。时彼佛与诸菩萨方共坐食，有诸天子皆号香严，悉发阿耨多罗三藐三菩提心，供养彼佛及诸菩萨，此诸大众莫不目见。","时维摩诘问众菩萨言：「诸仁者！谁能致彼佛饭？」以文殊师利威神力故，咸皆默然。维摩诘言：「仁此大众，无乃可耻？」","文殊师利曰：「如佛所言，勿轻未学。」","于是维摩诘不起于座，居众会前化作菩萨——相好光明，威德殊胜，蔽于众会——而告之曰：「汝往上方界分，度如四十二恒河沙佛土，有国名众香，佛号香积，与诸菩萨方共坐食。汝往到彼，如我辞曰：『维摩诘稽首世尊足下！致敬无量，问讯起居，少病少恼，气力安不？愿得世尊所食之余，当于娑婆世界施作佛事，令此乐小法者得弘大道，亦使如来名声普闻。』」","时化菩萨即于会前，升于上方。举众皆见其去，到众香界，礼彼佛足，又闻其言：「维摩诘稽首世尊足下！致敬无量，问讯起居，少病少恼，气力安不？愿得世尊所食之余，欲于娑婆世界施作佛事，使此乐小法者得弘大道，亦使如来名声普闻。」","彼诸大士见化菩萨，叹未曾有：「今此上人从何所来？娑婆世界为在何许？云何名为乐小法者？」即以问佛。佛告之曰：「下方度如四十二恒河沙佛土，有世界名娑婆，佛号释迦牟尼，今现在。于五浊恶世，为乐小法众生敷演道教。彼有菩萨名维摩诘，住不可思议解脱，为诸菩萨说法，故遣化来，称扬我名，并赞此土，令彼菩萨增益功德。」","彼菩萨言：「其人何如，乃作是化？德力无畏，神足若斯！」佛言：「甚大！一切十方皆遣化往，施作佛事饶益众生。」","于是香积如来以众香钵盛满香饭，与化菩萨。时彼九百万菩萨俱发声言：「我欲诣娑婆世界供养释迦牟尼佛，并欲见维摩诘等诸菩萨众。」佛言：「可往。摄汝身香，无令彼诸众生起惑著心；又当舍汝本形，勿使彼国求菩萨者，而自鄙耻；又汝于彼莫怀轻贱，而作碍想。所以者何？十方国土，皆如虚空，又诸佛为欲化诸乐小法者，不尽现其清净土耳！」时化菩萨既受钵饭，与彼九百万菩萨俱，承佛威神及维摩诘力，于彼世界忽然不现，须臾之间至维摩诘舍。","时维摩诘即化作九百万师子之座，严好如前，诸菩萨皆坐其上。是化菩萨以满钵香饭与维摩诘，饭香普熏毘耶离城及三千大千世界。时毘耶离婆罗门、居士等，闻是香气，身意快然，叹未曾有！于是长者主月盖从八万四千人，来入维摩诘舍。见其室中菩萨甚多，诸师子座高广严好，皆大欢喜，礼众菩萨及大弟子，却住一面。诸地神、虚空神及欲、色界诸天，闻此香气，亦皆来入维摩诘舍。","时维摩诘语舍利弗等诸大声闻：「仁者可食。如来甘露味饭，大悲所熏，无以限意食之，使不消也。」有异声闻念：「是饭少，而此大众人人当食。」化菩萨曰：「勿以声闻小德小智称量如来无量福慧！四海有竭，此饭无尽！使一切人食，揣若须弥，乃至一劫，犹不能尽。所以者何？无尽戒、定、智慧、解脱、解脱知见功德具足者所食之余，终不可尽。」于是钵饭悉饱众会，犹故不𣩠。其诸菩萨、声闻、天、人，食此饭者，身安快乐，譬如一切乐庄严国诸菩萨也；又诸毛孔皆出妙香，亦如众香国土诸树之香。","尔时维摩诘问众香菩萨：「香积如来以何说法？」","彼菩萨曰：「我土如来无文字说，但以众香令诸天、人得入律行。菩萨各各坐香树下，闻斯妙香，即获一切德藏三昧。得是三昧者，菩萨所有功德皆悉具足。」","彼诸菩萨问维摩诘：「今世尊释迦牟尼以何说法？」","维摩诘言：「此土众生刚强难化，故佛为说刚强之语以调伏之。言是地狱、是畜生、是饿鬼，是诸难处，是愚人生处；是身邪行，是身邪行报；是口邪行，是口邪行报；是意邪行，是意邪行报；是杀生，是杀生报；是不与取，是不与取报；是邪婬，是邪婬报；是妄语，是妄语报；是两舌，是两舌报；是恶口，是恶口报；是无义语，是无义语报；是贪嫉，是贪嫉报；是瞋恼，是瞋恼报；是邪见，是邪见报；是悭悋，是悭悋报；是毁戒，是毁戒报；是瞋恚，是瞋恚报；是懈怠，是懈怠报；是乱意，是乱意报；是愚痴，是愚痴报；是结戒，是持戒，是犯戒；是应作，是不应作；是障碍，是不障碍；是得罪，是离罪；是净，是垢；是有漏，是无漏；是邪道，是正道；是有为，是无为；是世间，是涅槃。以难化之人心如猨猴，故以若干种法制御其心，乃可调伏，譬如象马，𢘙悷不调，加诸楚毒乃至彻骨，然后调伏。如是刚强难化众生，故以一切苦切之言，乃可入律。」","彼诸菩萨闻说是已，皆曰：「未曾有也！如世尊释迦牟尼佛，隐其无量自在之力，乃以贫所乐法度脱众生；斯诸菩萨亦能劳谦，以无量大悲生是佛土。」","维摩诘言：「此土菩萨于诸众生大悲坚固，诚如所言。然其一世饶益众生，多于彼国百千劫行。所以者何？此娑婆世界有十事善法，诸余净土之所无有。何等为十？以布施摄贫穷，以净戒摄毁禁，以忍辱摄瞋恚，以精进摄懈怠，以禅定摄乱意，以智慧摄愚痴，说除难法度八难者，以大乘法度乐小乘者，以诸善根济无德者，常以四摄成就众生，是为十。」","彼菩萨曰：「菩萨成就几法？于此世界行无疮疣，生于净土。」","维摩诘言：「菩萨成就八法，于此世界行无疮疣，生于净土。何等为八？饶益众生，而不望报；代一切众生受诸苦恼，所作功德尽以施之；等心众生，谦下无碍；于诸菩萨视之如佛；所未闻经，闻之不疑；不与声闻而相违背；不嫉彼供，不高己利，而于其中调伏其心；常省己过，不讼彼短，恒以一心求诸功德，是为八法。」","维摩诘、文殊师利于大众中说是法时，百千天、人皆发阿耨多罗三藐三菩提心，十千菩萨得无生法忍。","维摩诘所说经菩萨行品第十一","是时佛说法于庵罗树园，其地忽然广博严事，一切众会皆作金色。阿难白佛言：「世尊！以何因缘，有此瑞应？是处忽然广博严事，一切众会皆作金色。」","佛告阿难：「是维摩诘、文殊师利，与诸大众恭敬围绕，发意欲来，故先为此瑞应。」","于是维摩诘语文殊师利：「可共见佛，与诸菩萨礼事供养。」","文殊师利言：「善哉！行矣！今正是时。」","维摩诘即以神力持诸大众并师子座，置于右掌，往诣佛所。到已著地，稽首佛足，右绕七匝，一心合掌，在一面立；其诸菩萨即皆避座，稽首佛足，亦绕七匝，于一面立；诸大弟子、释、梵、四天王等，亦皆避座，稽首佛足，在一面立。","于是世尊如法慰问诸菩萨已，各令复坐，即皆受教。众坐已定，佛语舍利弗：「汝见菩萨大士自在神力之所为乎？」","「唯然，已见！」","「于汝意云何？」「世尊！我覩其为不可思议，非意所图，非度所测。」","尔时阿难白佛言：「世尊！今所闻香，自昔未有，是为何香？」","佛告阿难：「是彼菩萨毛孔之香。」","于是舍利弗语阿难言：「我等毛孔亦出是香。」","阿难言：「此所从来？」","曰：「是长者维摩诘从众香国取佛余饭，于舍食者，一切毛孔皆香若此。」","阿难问维摩诘：「是香气住当久如？」","维摩诘言：「至此饭消。」","曰：「此饭久如当消？」","曰：「此饭势力至于七日，然后乃消。又，阿难！若声闻人未入正位，食此饭者，得入正位，然后乃消；已入正位，食此饭者，得心解脱，然后乃消；若未发大乘意，食此饭者，至发意乃消；已发意，食此饭者，得无生忍，然后乃消；已得无生忍，食此饭者，至一生补处，然后乃消。譬如有药，名曰上味，其有服者，身诸毒灭，然后乃消；此饭如是，灭除一切诸烦恼毒，然后乃消。」","阿难白佛言：「未曾有也！世尊！如此香饭能作佛事。」","佛言：「如是，如是！阿难！或有佛土以佛光明而作佛事，有以诸菩萨而作佛事，有以佛所化人而作佛事，有以菩提树而作佛事，有以佛衣服、卧具而作佛事，有以饭食而作佛事，有以园林台观而作佛事，有以三十二相、八十随形好而作佛事，有以佛身而作佛事，有以虚空而作佛事；众生应以此缘得入律行。有以梦、幻、影、响、镜中像、水中月、热时炎如是等喻，而作佛事；有以音声、语言、文字而作佛事；或有清净佛土，寂寞无言、无说、无示、无识、无作、无为，而作佛事。如是，阿难！诸佛威仪进止，诸所施为，无非佛事。","「阿难！有此四魔、八万四千诸烦恼门，而诸众生为之疲劳，诸佛即以此法而作佛事，是名入一切诸佛法门。菩萨入此门者，若见一切净好佛土，不以为喜，不贪不高；若见一切不净佛土，不以为忧，不碍不没；但于诸佛生清净心，欢喜恭敬，未曾有也！诸佛如来功德平等，为化众生故，而现佛土不同。阿难！汝见诸佛国土，地有若干，而虚空无若干也；如是见诸佛色身有若干耳，其无碍慧无若干也。","「阿难！诸佛色身、威相、种性，戒、定、智慧、解脱、解脱知见，力、无所畏、不共之法，大慈、大悲，威仪所行及其寿命，说法教化，成就众生，净佛国土，具诸佛法，悉皆同等，是故名为三藐三佛陀，名为多陀阿伽度，名为佛陀。阿难！若我广说此三句义，汝以劫寿不能尽受；正使三千大千世界满中众生，皆如阿难多闻第一，得念总持，此诸人等以劫之寿亦不能受。如是，阿难！诸佛阿耨多罗三藐三菩提无有限量，智慧辩才不可思议。」","阿难白佛言：「我从今已往，不敢自谓以为多闻。」","佛告阿难：「勿起退意！所以者何？我说汝于声闻中为最多闻，非谓菩萨。且止，阿难！其有智者不应限度诸菩萨也；一切海渊尚可测量，菩萨禅定、智慧、总持、辩才一切功德不可量也。阿难！汝等舍置菩萨所行，是维摩诘一时所现神通之力，一切声闻、辟支佛于百千劫，尽力变化所不能作。」","尔时众香世界菩萨来者，合掌白佛言：「世尊！我等初见此土生下劣想，今自悔责，舍离是心。所以者何？诸佛方便不可思议，为度众生故，随其所应，现佛国异。唯然世尊！愿赐少法，还于彼土当念如来。」","佛告诸菩萨：「有尽无尽解脱法门，汝等当学。何谓为尽？谓有为法。何谓无尽？谓无为法。如菩萨者，不尽有为，不住无为。","「何谓不尽有为？谓不离大慈，不舍大悲；深发一切智心，而不忽忘；教化众生，终不厌倦，于四摄法，常念顺行；护持正法，不惜躯命，种诸善根，无有疲厌；志常安住，方便回向，求法不懈，说法无悋；勤供诸佛；故入生死而无所畏，于诸荣辱，心无忧喜；不轻未学，敬学如佛，堕烦恼者，令发正念，于远离乐，不以为贵，不著己乐，庆于彼乐；在诸禅定，如地狱想，于生死中，如园观想；见来求者，为善师想，舍诸所有，具一切智想；见毁戒人，起救护想；诸波罗蜜，为父母想，道品之法，为眷属想；发行善根，无有齐限，以诸净国严饰之事，成己佛土；行无限施，具足相好，除一切恶，净身、口、意；生死无数劫，意而有勇，闻佛无量德，志而不倦；以智慧剑，破烦恼贼，出阴、界、入，荷负众生，永使解脱；以大精进，摧伏魔军，常求无念实相智慧行；于世间法少欲知足，于出世间求之无厌，而不舍世间法，不坏威仪法而能随俗；起神通慧，引导众生，得念总持，所闻不忘；善别诸根，断众生疑，以乐说辩，演法无碍；净十善道，受天、人福；修四无量，开梵天道；劝请说法，随喜赞善，得佛音声；身、口、意善，得佛威仪；深修善法，所行转胜，以大乘教，成菩萨僧；心无放逸，不失众善：行如此法，是名菩萨不尽有为。","「何谓菩萨不住无为？谓修学空，不以空为证；修学无相、无作，不以无相、无作为证；修学无起，不以无起为证；观于无常，而不厌善本；观世间苦，而不恶生死；观于无我，而诲人不倦；观于寂灭，而不永灭；观于远离，而身心修善；观无所归，而归趣善法；观于无生，而以生法荷负一切；观于无漏，而不断诸漏；观无所行，而以行法教化众生；观于空无，而不舍大悲；观正法位，而不随小乘；观诸法虚妄，无牢无人、无主无相，本愿未满，而不虚福德、禅定、智慧：修如此法，是名菩萨不住无为。","「又具福德故，不住无为；具智慧故，不尽有为。大慈悲故，不住无为；满本愿故，不尽有为。集法药故，不住无为；随授药故，不尽有为。知众生病故，不住无为；灭众生病故，不尽有为。诸正士菩萨以修此法，不尽有为、不住无为，是名尽无尽解脱法门，汝等当学。」","尔时彼诸菩萨闻说是法，皆大欢喜，以众妙华、若干种色、若干种香，散遍三千大千世界，供养于佛及此经法并诸菩萨已，稽首佛足，叹未曾有，言：「释迦牟尼佛乃能于此善行方便。」言已，忽然不现，还到彼国。","维摩诘所说经见阿閦佛品第十二","尔时世尊问维摩诘：「汝欲见如来，为以何等观如来乎？」","维摩诘言：「如自观身实相，观佛亦然。我观如来前际不来，后际不去，今则不住；不观色，不观色如，不观色性，不观受、想、行、识，不观识如，不观识性，非四大起，同于虚空；六入无积，眼、耳、鼻、舌、身、心已过；不在三界，三垢已离，顺三脱门，具足三明，与无明等；不一相、不异相，不自相、不他相，非无相、非取相；不此岸，不彼岸，不中流而化众生；观于寂灭，亦不永灭；不此不彼，不以此，不以彼；不可以智知，不可以识识；无晦无明，无名无相，无强无弱，非净非秽；不在方，不离方，非有为，非无为，无示无说；不施不悭，不戒不犯，不忍不恚，不进不怠，不定不乱，不智不愚，不诚不欺，不来不去，不出不入，一切言语道断；非福田，非不福田，非应供养，非不应供养；非取非舍，非有相，非无相；同真际，等法性，不可称，不可量，过诸称量；非大非小，非见非闻，非觉非知，离众结缚；等诸智，同众生，于诸法无分别；一切无失，无浊无恼，无作无起，无生无灭；无畏无忧，无喜无厌无著；无已有，无当有，无今有；不可以一切言说分别显示：世尊！如来身为若此，作如是观，以斯观者，名为正观；若他观者，名为邪观。」","尔时舍利弗问维摩诘：「汝于何没而来生此？」","维摩诘言：「汝所得法有没生乎？」","舍利弗言：「无没生也。」","「若诸法无没生相，云何问言：『汝于何没而来生此？』于意云何？譬如幻师，幻作男女，宁没生耶？」","舍利弗言：「无没生也。」","「汝岂不闻佛说诸法如幻相乎？」","答曰：「如是！」","「若一切法如幻相者，云何问言：『汝于何没而来生此？』舍利弗！没者为虚诳法，败坏之相；生者为虚诳法，相续之相。菩萨虽没，不尽善本；虽生，不长诸恶。」","是时佛告舍利弗：「有国名妙喜，佛号无动。是维摩诘于彼国没，而来生此。」","舍利弗言：「未曾有也！世尊！是人乃能舍清净土，而来乐此多怒害处。」","维摩诘语舍利弗：「于意云何？日光出时与冥合乎？」","答曰：「不也！日光出时，即无众冥。」","维摩诘言：「夫日何故行阎浮提？」","答曰：「欲以明照，为之除冥。」","维摩诘言：「菩萨如是！虽生不净佛土，为化众生故，不与愚暗而共合也，但灭众生烦恼暗耳！」","是时大众渴仰，欲见妙喜世界无动如来，及其菩萨、声闻之众。佛知一切众会所念，告维摩诘言：「善男子！为此众会，现妙喜国无动如来，及诸菩萨、声闻之众，众皆欲见。」","于是维摩诘心念：「吾当不起于座，接妙喜国铁围山川、溪谷江河、大海泉源、须弥诸山及日月星宿、天龙鬼神、梵天等宫，并诸菩萨、声闻之众，城邑聚落、男女大小乃至无动如来，及菩提树、诸妙莲华，能于十方作佛事者——三道宝阶从阎浮提至忉利天，以此宝阶诸天来下，悉为礼敬无动如来，听受经法；阎浮提人亦登其阶，上升忉利，见彼诸天：妙喜世界成就如是无量功德——上至阿迦腻咤天，下至水际，以右手断取，如陶家轮，入此世界，犹持华鬘，示一切众。」作是念已，入于三昧现神通力，以其右手断取妙喜世界，置于此土。","彼得神通菩萨及声闻众，并余天、人俱发声言：「唯然，世尊！谁取我去，愿见救护。」无动佛言：「非我所为，是维摩诘神力所作。」其余未得神通者，不觉不知己之所往。妙喜世界，虽入此土而不增减，于是世界亦不迫隘，如本无异。","尔时释迦牟尼佛告诸大众：「汝等且观妙喜世界无动如来，其国严饰，菩萨行净，弟子清白。」","皆曰：「唯然已见。」","佛言：「若菩萨欲得如是清净佛土，当学无动如来所行之道。」","现此妙喜国时，娑婆世界十四那由他人，发阿耨多罗三藐三菩提心，皆愿生于妙喜佛土。释迦牟尼佛即记之曰：「当生彼国。」时妙喜世界于此国土所应饶益其事讫已，还复本处，举众皆见。","佛告舍利弗：「汝见此妙喜世界及无动佛不？」","「唯然已见，世尊！愿使一切众生得清净土，如无动佛；获神通力，如维摩诘。世尊！我等快得善利，得见是人，亲近供养。其诸众生，若今现在，若佛灭后，闻此经者，亦得善利；况复闻已信解、受持、读诵、解说，如法修行？若有手得是经典者，便为已得法宝之藏；若有读诵解释其义，如说修行，即为诸佛之所护念；其有供养如是人者，当知即为供养于佛；其有书持此经卷者，当知其室即有如来；若闻是经能随喜者，斯人即为取一切智；若能信解此经，乃至一四句偈，为他说者，当知此人即是受阿耨多罗三藐三菩提记。」","维摩诘所说经法供养品第十三","尔时释提桓因于大众中白佛言：「世尊！我虽从佛及文殊师利闻百千经，未曾闻此不可思议、自在神通、决定实相经典。如我解佛所说义趣，若有众生闻是经法，信解、受持、读诵之者，必得是法不疑，何况如说修行？斯人即为闭众恶趣开诸善门，常为诸佛之所护念；降伏外学，摧灭魔怨；修治菩提，安处道场；履践如来所行之迹。世尊！若有受持读诵、如说修行者，我当与诸眷属供养给事；所在聚落城邑、山林旷野有是经处，我亦与诸眷属听受法故，共到其所；其未信者，当令生信，其已信者，当为作护。」","佛言：「善哉，善哉！天帝！如汝所说，吾助尔喜。此经广说过去、未来、现在诸佛不可思议阿耨多罗三藐三菩提。是故，天帝！若善男子、善女人受持、读诵、供养是经者，即为供养去、来、今佛。天帝！正使三千大千世界如来满中，譬如甘蔗、竹𫁳、稻麻、丛林；若有善男子、善女人，或一劫、或减一劫，恭敬尊重，赞叹供养，奉诸所安，至诸佛灭后，以一一全身舍利起七宝塔——纵广一四天下，高至梵天，表刹庄严——以一切华香、璎珞、幢幡、伎乐微妙第一，若一劫、若减一劫，而供养之，于天帝意云何，其人植福宁为多不？」","释提桓因言：「多矣！世尊！彼之福德，若以百千亿劫说不能尽。」","佛告天帝：「当知是善男子、善女人闻是不可思议解脱经典，信解受持，读诵修行，福多于彼。所以者何？诸佛菩提皆从是生；菩提之相不可限量，以是因缘福不可量。」","佛告天帝：「过去无量阿僧祇劫，时世有佛，号曰药王如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。世界名大庄严，劫曰庄严，佛寿二十小劫。其声闻僧三十六亿那由他，菩萨僧有十二亿。天帝！是时有转轮圣王，名曰宝盖，七宝具足，主四天下。王有千子，端正勇健，能伏怨敌。","「尔时宝盖与其眷属，供养药王如来，施诸所安，至满五劫。过五劫已，告其千子：『汝等亦当如我，以深心供养于佛。』于是千子受父王命，供养药王如来，复满五劫，一切施安。其王一子，名曰月盖，独坐思惟：『宁有供养殊过此者？』以佛神力，空中有天曰：『善男子！法之供养胜诸供养。』即问：『何谓法之供养？』天曰：『汝可往问药王如来，当广为汝说法之供养。』","「即时月盖王子行诣药王如来，稽首佛足，却住一面，白佛言：『世尊！诸供养中，法供养胜。云何为法供养？』佛言：『善男子！法供养者，诸佛所说深经，一切世间难信难受，微妙难见，清净无染，非但分别思惟之所能得，菩萨法藏所摄，陀罗尼印印之；至不退转，成就六度，善分别义，顺菩提法，众经之上；入大慈悲，离众魔事及诸邪见；顺因缘法，无我、无人、无众生、无寿命，空、无相、无作、无起；能令众生坐于道场而转法轮，诸天、龙神、乾闼婆等所共叹誉；能令众生入佛法藏，摄诸贤圣一切智慧；说众菩萨所行之道；依于诸法实相之义，明宣无常、苦、空、无我、寂灭之法；能救一切毁禁众生，诸魔外道及贪著者能使怖畏，诸佛贤圣所共称叹；背生死苦，示涅槃乐，十方三世诸佛所说；若闻如是等经，信解、受持、读诵，以方便力为诸众生分别解说，显示分明，守护法故，是名法之供养。又于诸法如说修行，随顺十二因缘，离诸邪见，得无生忍；决定无我无有众生，而于因缘果报无违无诤，离诸我所；依于义不依语，依于智不依识，依了义经不依不了义经，依于法不依人；随顺法相，无所入，无所归；无明毕竟灭故，诸行亦毕竟灭，乃至生毕竟灭故，老死亦毕竟灭：作如是观十二因缘，无有尽相，不复起见，是名最上法之供养。』」","佛告天帝：「王子月盖从药王佛闻如是法，得柔顺忍。即解宝衣严身之具，以供养佛，白佛言：『世尊！如来灭后，我当行法供养，守护正法。愿以威神加哀建立，令我得降魔怨，修菩萨行。』佛知其深心所念，而记之曰：『汝于末后守护法城。』天帝！时王子月盖，见法清净，闻佛授记，以信出家，修集善法；精进不久，得五神通，逮菩萨道，得陀罗尼，无断辩才。于佛灭后，以其所得神通、总持、辩才之力，满十小劫，药王如来所转法轮随而分布。月盖比丘以守护法，勤行精进，即于此身，化百万亿人于阿耨多罗三藐三菩提立不退转；十四那由他人，深发声闻、辟支佛心；无量众生得生天上。天帝！时王宝盖岂异人乎？今现得佛，号宝炎如来；其王千子，即贤劫中千佛是也——从迦罗鸠孙駄为始得佛，最后如来号曰楼至。月盖比丘，即我身是。如是，天帝！当知此要：以法供养于诸供养为上为最，第一无比。是故，天帝！当以法之供养，供养于佛。」","维摩诘所说经嘱累品第十四","于是佛告弥勒菩萨言：「弥勒！我今以是无量亿阿僧祇劫所集阿耨多罗三藐三菩提法，付嘱于汝。如是辈经，于佛灭后末世之中，汝等当以神力广宣流布于阎浮提，无令断绝。所以者何？未来世中，当有善男子、善女人及天、龙、鬼神、乾闼婆、罗刹等，发阿耨多罗三藐三菩提心，乐于大法；若使不闻如是等经，则失善利。如此辈人闻是等经，必多信乐，发希有心，当以顶受，随诸众生所应得利，而为广说。","「弥勒！当知菩萨有二相。何谓为二？一者、好于杂句文饰之事；二者、不畏深义如实能入。若好杂句文饰事者，当知是为新学菩萨；若于如是无染无著，甚深经典无有恐畏，能入其中，闻已心净，受持读诵，如说修行，当知是为久修道行。","「弥勒！复有二法名新学者，不能决定于甚深法。何等为二？一者、所未闻深经，闻之惊怖生疑，不能随顺，毁谤不信，而作是言：『我初不闻，从何所来？』二者、若有护持、解说如是深经者，不肯亲近、供养、恭敬，或时于中说其过恶。有此二法，当知是为新学菩萨，为自毁伤，不能于深法中调伏其心。","「弥勒！复有二法，菩萨虽信解深法，犹自毁伤，而不能得无生法忍。何等为二？一者、轻慢新学菩萨，而不教诲；二者、虽解深法，而取相分别。是为二法。」","弥勒菩萨闻说是已，白佛言：「世尊！未曾有也！如佛所说，我当远离如斯之恶，奉持如来无数阿僧祇劫所集阿耨多罗三藐三菩提法。若未来世善男子、善女人求大乘者，当令手得如是等经，与其念力，使受持读诵、为他广说。世尊！若后末世，有能受持读诵、为他说者，当知皆是弥勒神力之所建立。」","佛言：「善哉，善哉！弥勒！如汝所说，佛助尔喜。」","于是一切菩萨合掌白佛：「我等亦于如来灭后，十方国土广宣流布阿耨多罗三藐三菩提法，复当开导诸说法者，令得是经。」","尔时四天王白佛言：「世尊！在在处处、城邑聚落、山林旷野，有是经卷、读诵解说者，我当率诸官属为听法故，往诣其所，拥护其人，面百由旬，令无伺求得其便者。」","是时佛告阿难：「受持是经，广宣流布。」","阿难言：「唯然！我已受持要者。世尊！当何名斯经？」","佛言：「阿难！是经名为『维摩诘所说』，亦名『不可思议解脱法门』，如是受持。」","佛说是经已，长者维摩诘、文殊师利、舍利弗、阿难等，及诸天、人、阿修罗一切大众，闻佛所说，皆大欢喜。"],source:"https://cbetaonline.dila.edu.tw/zh/T14n0475",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T14/T14n0475.xml",sourceLabel:"CBETA T14n0475",scope:"全3卷正文（不含序跋、目录、附录）",originalTitle:"維摩詰所說經",juan:[1,2,3]},{id:"cbeta-t15n0602",title:"佛说大安般守意经",subtitle:"佛说大安般守意经 · 后汉 安世高译",paragraphs:["佛在越祇国舍羁瘦国，亦说一名遮匿迦罗国。时佛坐行安般守意九十日，佛复独坐九十日者，思惟校计，欲度脱十方人及蜎飞蠕动之类。复言我行安般守意九十日者，安般守意，得自在慈念意；还行安般守意已，复收意行念也。","安为身，般为息，守意为道。守者为禁，亦谓不犯戒；禁者，亦为护；护者，遍护一切无所犯。意者，息意，亦为道也。安为生，般为灭，意为因缘，守者为道也。安为数，般为相随，守意为止也。安为念道，般为解结，守意为不堕罪也。安为避罪，般为不入罪，守意为道也。安为定，般为莫使动摇，守意莫乱意也。","安般守意，名为御意至得无为也。安为有，般为无。意念有，不得道；意念无，不得道；亦不念有亦不念无，是应空定，意随道行。有者谓万物，无者谓疑，亦为空也。安为本因缘，般为无处所。道人知本无所从来，亦知灭无处所，是为守意也。","安为清，般为净，守为无，意名为，是清净无为也。无者谓活，为者谓生，不复得苦，故为活也。安为未，般为起。已未起，便为守意；若已意起，便为守意；若已起，意便走，为不守，当为还，故佛说安般守意也。安为受五阴，般为除五阴，守意为觉因缘，不随身口意也。","守意者，无所著为守意，有所著不为守意。何以故？意起复灭故。意不复起为道，是为守意。守意莫令意生，生因有死，为不守意；莫令意死，有死因有生，意亦不死，是为道也。","安般守意有十黠，谓数息、相随、止、观、还、净、四谛，是为十黠成，谓合三十七品经为行成也。","守意，譬如灯火，有两因缘：一者、坏冥；二者、见明。守意：一者、坏痴；二者、见黠也。守意，意从因缘生，当缘因缘莫著，是为守意也。守意有三辈：一者、守令不得生；二者、已生当疾灭；三者、事已行当从后悔，计亿万劫不复作也。守与意各自异，护十方一切觉对不犯是为守，觉彼无为是为意，是守意也。","守意中有四乐：一者、知要乐；二者、知法乐；三者、为知止乐；四者、为知可乐；是为四乐。法为行，得为道。守意六事为有内外：数、随、止是为外，观、还、净是为内。随道也，何以故？念息相随，止观还净，欲习意近道故。离是六事，便随世间也。数息为遮意，相随为𣫍意，止为定意，观为离意，还为一意，净为守意。用人不能制意，故行此六事耳。","何以故数息？用意乱故。何以故不得？用不识故。何以故不得禅？用不弃习尽证行道故也。数息为地，相随为犁，止为轭，观为种，还为雨，净为行，如是六事，乃随道也。数息断外，相随断内，止为止罪，行观却意，不受世间为还，念断为净也。意乱当数息，意定当相随，意断当行止，得道意当观，不向五阴当还，无所有当为净也。多事当数息，少事当相随，家中意尽当行止，畏世间当观，不欲世间为还，念断为净也。","何以故数息？不欲随五阴故。何以故相随？欲知五阴故。何以故止？欲观五阴故。何以故观阴？欲知身本故。何以故知身本？欲弃苦故。何以故为还？厌生死故。何以故为净？分别五阴不受故。便随黠慧八种道得，别为得所愿也。行息时为随数，相随时为随念，止时为随定，观时为随净，还时为随意，净时为随道，亦为随行也。","数息为四意止，相随为四意断，止为四神足念，观为五根、五力，还为七觉意，净为八行也。得息不相随，不为守意；得相随不止，不为守意；得止不观，不为守意；得观不还，不为守意；得还不净，不为守意；得净复净，乃为守意也。已念息，恶不生，复数者，为共遮意，不随六衰故。行相随为欲离六衰，行止为欲却六衰，行观为欲断六衰，行还为欲不受六衰，行净为欲灭六衰。已灭尽，便随道也。","数息欲遮意，息中有长短，当复遮是长短意也。何以故守意？欲止恶故。恶亦可守，亦不可守。何以故？恶已尽，不当复守也。","数息有三事：一者、当坐行；二者、见色当念非常不净；三者、当晓瞋、恚、疑、嫉、念过去也。数息乱者，当识因缘所从起，当知是内意。一息乱者是外意过，息从外入故；二息乱者是内意过，息从中出故。三、五、七、九属外意，四、六、八、十属内意。嫉、瞋恚、疑，是三意在内；杀、盗、婬、两舌、恶口、妄言、绮语，是七意及余事属外也。得息为外，不得息为内。息从意生，念息合为一，数息至尽数，为一亦非一，意在外，息未尽故。譬如数钱，意在五，数为一也。数息所以先数入者，外有七恶，内有三恶，用少不能胜多，故先数入也。数息不得者，失其本意故。本意，谓非常、苦、空、非身。失是意堕颠倒故，亦为失师。师者，初坐时，第一入息得身安便次第行；为失其本意，故不得息也。数息，意常当念非常、苦、空、非身，计息出亦灭，入亦灭。已知是得道，疾当持非常恐意。得是意，即得息也。入息、出息所以异者，出息为生死阴，入息为思想阴；有时出息为痛痒阴，入息为识阴。用是为异，道人当分别是意也。入息者为不受罪，出息者为除罪，守意者为离罪。入息者为受因缘，出息者为到因缘，守意者为不离因缘也。数息不得，有三因缘：一者、罪到；二者、行不互；三者、不精进也。入息短，出息长，无所从念为道意，有所念为罪；罪恶在外，不在内也。数息时，有离意为喘息长，得息为喘息短，不安行息为长，定为短。念万物为长息，无所念为短息。未至十息，坏复更数为长息，得十息为短息。得息为短，何以故？止不复数故。得息亦为长，何以故？息不休，故为长也。喘息长自知，喘息短自知：谓意所在为自知长短，意觉长短为自知，意不觉长短为不自知也。","道人行安般守意欲止意，当何因缘得止意？听说安般守意，何等为安？何等为般？安名为入息，般名为出息，念息不离，是名为安般。守意者，欲得止意。在行者、新学者，有四种安般守意行，除两恶十六胜，即时自知，乃安般守意行，令得止意。何等为四种？一为数，二为相随，三为止，四为观。何等为两恶？莫过十息，莫减十数。何等为十六胜？即时自知喘息长；即自知喘息短；即自知喘息动身；即自知喘息微；即自知喘息快；即自知喘息不快；即自知喘息止；即自知喘息不止；即自知喘息欢心；即自知喘息不欢心；即自知内心念万物已去不可复得，喘息自知；内无所复思，喘息自知；弃捐所思，喘息自知；不弃捐所思，喘息自知；放弃躯命，喘息自知；不放弃躯命，喘息自知。是为十六即时自知也。","问：何等为莫过十数、莫减十数？报：息已尽未数是为过，息未尽便数是为减。失数亦恶，不及亦恶，是为两恶。至二息乱为短息，至九息乱为长息，得十息为快息。相随为微，意在长便转意：「我何以故念长？」意在短，即时觉不得令意止，止为著。放弃躯命者，谓行息。得道意，便放弃躯命；未得道意，常爱身故，不放弃躯命也。息细微为道，长为生死，短息动为生死，长于道为短，何以故？不得道意，无知见，故为短也。数息为单，相随为复，止为一意，观为知意，还为行道，净为入道也。数时为念，至十息为持，是为外禅；念身不净随空，是为内禅也。禅法恶来不受，是名为弃。闭口数息，随气出入，知气发何所，灭何所。意有所念，不得数；息有迟疾、大小，亦不得数；耳闻声乱，亦不得数也。数息，意在息数为不工，行意在意乃为止。数息，意但在息，是为不工。当知意所从起、气所灭，是乃应数。因缘尽，便得定意也。守意者，念出入息，已念息不生恶，故为守意。息见因缘生，无因缘灭；因缘断，息止也。数息为至诚，息不乱为忍辱。数息气微，不复觉出入，如是当守一念止也。息在身，亦在外，得因缘息生，罪未尽故有息；断因缘，息不复生也。","数息以为随第二禅。何以故？用不待念故，为随第二禅也。数息为不守意，念息乃为守意。息从外入息未尽，息在入意，在尽识，在数也。十息有十意为十绊，相随有二意为二绊，止为一意为一绊。不得息数为恶意不可绊；恶意止，乃得数，是为和调可意绊也。已得息弃息，已得相随弃相随，已得止弃止，已得观弃观，莫复还；莫复还者，莫复数。息亦使意，意亦使息也；有所念为息使意，无所念为意使息也。息有四事：一为风，二为气，三为息，四为喘。有声为风，无声为气，出入为息，气出入不尽为喘也。数息断外，相随断内，数从外入为断外，亦欲离外因缘，数从中出为欲离内因缘。外为身离，内为意离；身离、意离是为相随，出、入息是为二事也。数息为欲断内外因缘。何等为内、外？谓眼、耳、鼻、口、身、意为内，色、声、香、味、细滑、念为外也。行息为使意向空，但欲止余意。何以为向空？息中无所为故也。数息意走不？即时觉者，罪重意轻，罪引意去疾，故不觉也。行道已得息，自厌息意，欲转不复欲数，如是为得息。相随止观亦尔也。知出入息灭，灭为得息相；知生死不复用，为得生死相。已得四禅，但念空为种道栽。","行息已得定，不复觉气出入，便可观。一、当观五十五事；二、当观身中十二因缘也。","问：息出入，宁有处不？报：息入时是其处，出息时是其处。数息身坐，痛痒、思想、生死、识止不行，是为坐也。念息得道，复校计者，用息无所知故。","问：念息得道，何以为无所知？报：意知息，息不知意，是为无所知。人不能得校计意，便令数息，欲令意定。虽数息，但不生恶。无有黠智，当何等行得黠慧？从一至十，分别定乱，识对行药；已得定意，便随黠慧，得校计为堕观也。","问：何等为数？报：数者谓事。譬如人有事更求，是为数罪。道人数福，何以故正为十？一意起为一，二意起为二，数终于十，至十为竟，故言十数为福。复有罪者，用不能坏息，故为罪；亦谓意生死不灭，堕世间已，不断世间事为罪也。六情为六事，痛痒、思想、生死、识，合为十事，应内十息；杀、盗、婬、两舌、恶口、妄言、绮语、嫉妬、瞋恚、痴，应外十息，谓止不行也。","问：何等为十六事？报：十事者谓数，至十六者，谓数、相随、止、观、还、净，是为十六事，为行不离，为随道也。","问：数息念风为随色，何以应道？报：行意在数不念色，气尽便灭，堕非常、知非常为道也。道人欲得道，要当知坐、行二事：一者为坐，二者为行。","问：坐与行为同、不同？报：有时同，有时不同。数息、相随、止、观、还、净，此六事有时为坐，有时为行。何以故？数息意定是为坐，意随法是为行；已起意不离为行，亦为坐也。","坐禅法，一不数二，二不数一。一数二者，谓数一息未竟便言二，是为一数二，如是为过精进；二数一者，谓息已入二甫言一，是为二数一，如是为不及精进。从三至四、五至六、七至八、九至十，各自有分部，当分别所属；在一数一，在二数二，是为法行，便堕精进也。","有三坐堕道：一为数息坐，二为诵经坐，三为闻经喜坐，是为三也。坐有三品：一为味合坐，二为净坐，三为无有结坐。何等为味合坐？谓意著行不离，是为味合坐。何谓为净坐？谓不念为净坐。何等为无有结坐？谓结已尽为无有结坐也。息有三辈：一为杂息，二为净息，三为道息。不行道，是为杂息；数至十息不乱，是为净息；已得道，是为道息也。息有三辈：有大息，有中息，有微息。口有所语，谓大息止；念道，中息止；得四禅，微息止也。","问：佛何以教人数息守意？报：有四因缘；一者、用不欲痛故；二者、用避乱意故；三者、用闭因缘，不欲与生死会故；四者、用欲得泥洹道故也。譬喻说日无光明者，有四因缘：一者、用有云故；二者、用有尘故；三者、用有大风故；四者、用有烟故。数息不得，亦有四因缘：一者、用念生死校计故；二者、用饮食多故；三者、用疲极故；四者、用坐不得更罪地故。此四事来皆有相：坐数息，忽念他事失息意，是为念校计相；骨节尽痛，不能久坐，是为食多相；身重意瞪𥌋，但欲睡眠，是为疲极相；四面坐，不得一息，是为罪地相。以知罪，当经行；若读经文坐，意不习罪，亦祸消也。","道人行道当念本。何等为本？谓心意识是为本。是三事皆不见，已生便灭，本意不复生，得是意为道意；本意已灭，无为痛更因缘生便断也。定意日胜，日胜为定意。有时从息得定意，有时从相随得定意，有时从止得定意，有时从观得定意，随得定因缘直行也。","行息亦堕贪，何以故？意以定便喜故。便当计出息、入息、念灭时，息生，身生；息灭，身灭。尚未脱生死苦，何以故？喜已计，如是便贪止也。数息欲疾，相随欲迟；有时数息当安徐，相随时当为疾。何以故？数息意不乱当安徐，数乱当为疾，相随亦同如是也。第一数亦相随，所念异，虽数息，当知气出入，意著在数也。数息，复行相随。止观者，谓不得息；前世有习，在相随止观。虽得相随，止观当还从数息起也。数息意不离，是为法离，为非法数息，意不随罪，意在世间，便堕罪也。数息为不欲乱意故，意以不乱复行相随者，证上次意知为止。止与观同，还与净同也。行道得微意当倒意者，谓当更数息。若读经已，乃复行禅微意者，谓不数息及行相随也。","佛有六洁意，谓数息、相随、止、观、还、净，是六事能制无形也。息亦是意，亦非意。何以故？数时，意在息为是；不数时，意息各自行，是为非意。从意生息已，止无有意也。人不使意，意使人。使意者，谓数息、相随、止、观、还、净。念《三十七品经》，是为使意；人不行道，贪求随欲，是为意使人也。","息有垢，息垢不去，不得息。何等为息垢？谓三冥中最剧者，是为息垢。何等为三冥？谓三毒起时，身中正冥，故言三冥。三毒者：一为贪婬，二为瞋恚，三为愚痴。人皆坐是三事死，故言毒也。数息时，意在数息；未数时，有三意：有善意、有恶意、有不善不恶意。","欲知人得息相者，当观万物及诸好色，意不复著，是为得息；相意复著，是为未得，当更精进。行家中意欲尽者，谓六情为意家，贪爱万物皆为意家也。相随者，谓行善法，从是得脱，当与相随；亦谓不随五阴、六入、息与意相随也。","问：第三止何以故止在鼻头？报：用数息、相随、止、观、还、净，皆从鼻出入，意习故处，亦为易识，以是故著鼻头也。恶意来者断为禅，有时在鼻头止，有时在心中止；在所著为止。邪来乱人意，直观一事，诸恶来，心不当动，心为不畏之哉也。止有四：一为数止，二为相随止，三为鼻头止，四为息心止。止者，谓五乐六入，当制止之也。","入息至尽鼻头止，谓恶不复入至鼻头止；出息至尽著鼻头，谓意不复离身行向恶，故著鼻头；亦谓息初入时，便一念向不复转，息出入亦不复觉，是为止也。止者，如如出息、入息，觉知前意出，不觉后意出。觉前意为意相观，便察出入息见败，便受相畏生死，便却意，便随道意相也。莫为相随者，但念著鼻头，五阴因缘不复念，罪断意灭，亦不喘息，是为止也。莫为相随者，谓莫复意念出入，随五阴因缘，不复喘息也。","第四观者，观息败时，与观身体异，息见因缘生，无因缘灭也。心意受相者，谓意欲有所得，心计因缘会当复灭，便断所欲不复向，是为心意受相也。以识因缘为俱相观者，谓识知五阴因缘，出息亦观，入息亦观；观者谓观五阴，是为俱观。亦应意意相观，为两因缘，在内断恶、念道也。观出息异、入息异者，谓出息为生死阴，入息为思想阴；有时出息为痛痒阴，入息为识阴。随因缘起便受阴，意所向无有常，用是故为异，道人当分别知。是亦谓出息灭，入息生；入息灭，出息生也。无有故者，谓人意及万物，意起已灭，物生复死，是为无有故也。非出息是入息，非入息是出息；非谓出息时意不念入息，入息时意不念出息，所念异故言非也。中信者，谓入道中、见道因缘、信道，是为中信也。","第五还弃结者，谓弃身七恶；第六净弃结者，为弃意三恶，是名为还。还者，为意不复起恶；恶者，是为不还也。还身者，谓还恶。得第五还，尚有身亦无身。何以故？有意有身，无意无身，意为人种，是名为还。还者，谓意不复起恶；起恶者，是为不还，亦谓前助身，后助意。不杀、盗、婬、两舌、恶口、妄言、绮语，是为助身；不嫉、瞋恚、痴，是为助意也。还五阴者，譬如买金得石，便弃捐地不用；人皆贪爱五阴，得苦痛便不欲是，为还五阴也。何等为便见灭尽处，谓无所有是为灭处。","问：已无所有，何以故为处者？无所有处有四处：一者、飞鸟以空中为处；二者、罗汉以泥洹为处；三者、道以无有为处；四者、法在观处也。","出息、入息受五阴相者，谓意邪念，疾转还正以生觉断，为受五阴相。言受者，谓受不受相也。以受五阴相，知起何所，灭何所。灭者，为受十二因缘，人从十二因缘生，亦从十二因缘死；不念者，为不念五阴也。知起何所、灭何所，谓善恶因缘起便复灭，亦谓身，亦谓气生灭。念便生，不念便死，意与身同等，是为断生死道。在是生死间，一切恶事皆从意来也。今不为前、前不为今者，谓前所念已灭，今念非前念；亦谓前世所作，今世所作，各自得福；亦谓今所行善，非前所行恶；亦谓今息非前息，前息非今息也。","为生死分别者，为意念生即生，念灭即灭。故言生死，当分别万物及身。过去、未来福为索尽。何以故？尽以生便灭，灭便尽；已知尽，当尽力求也。","视上头无所从来者，谓人无所从来，意起为人；亦谓人不自作来者，为有所从来；人自作自得，是为无所从来也。生死当分别者，谓知分别五阴，亦谓知分别意生死。人意为常，知无有常，亦为分别也。","后视无处所者，为今现在不见罪人在生死，会当得，无有脱于罪故。言后视无有处所，未得道迹不得中命尽，谓已得十五，意不得中死；要当得十五，意便堕道，亦转上至阿罗汉也。中得道亦不得中命尽，为息意身，凡三事，谓善恶意要当得道迹，亦复中坏；息死复生，善意起复灭，身亦不得中死也。","何等为净？谓诸所贪欲为不净，除去贪欲是为净。何等为五阴相？譬喻火为阴，薪为相也。从息至净，是皆为观；谓观身相随止观还净，本为无有。内意数息，外意断恶因缘，是为二意也。","问：何以故不先内外观身体，反先数息、相随、止、观、还、净？报：用意不净故不见，身意已净，便悉见身内外道。","行有十九行，用人有十九病故，亦有十九药。观身念恶露，是为止贪婬药；念四等心，是为止瞋恚药；自计本何因缘有，是为止愚痴药；安般守意，是为多念药也。","内外自观身体。何等为身？何等为体？骨肉为身，六情合为体也。何等为六情？谓眼合色，耳受声，鼻向香，口欲味，细滑为身，衰意为种，栽为痴，为有生物也。","内外身体所以重出者何？谓人贪求，有大小，有前后。谓所欲得当分别观，观者见为念，念因见观者为知也。身观止者，坐念起，起念意不离，在所行意所著为识，是为身观止也。出息、入息念灭时，何等为念灭时？谓念出入气尽时，意息灭。出息、入息念灭时，譬如画空中，无有处生死，意道意俱尔也。出息、入息念灭时，亦不说息，意息说灭时。出息、入息念灭时，物从因缘生，断本为灭时也。","内外痛痒见观者，为见痛痒所从起，便观是，为见观也。内外痛痒者，谓外好物为外痒，外恶物为外痛；内可意为内痒，内不可意为内痛。在内为内法，在外因缘为外法；亦谓目为内，色为外；耳为内，声为外；鼻为内，香为外；口为内，味为外；心为内，念为外。见好细滑，意欲得，是为痒；见麁恶意，不用是为痛。俱堕罪也。痛痒观止者，若人臂痛，意不作痛，反念他一切身痛如是，以意不在痛，为止痛；亦可念，亦不可念，念痛无所著。自爱身，当观他人身；意爱他人身，当自观身，亦为止也。","内外痛痒所以重出者何？谓人见色爱有薄厚，其意不等观，多与少异故。重分别观道，当内观有痴，当外观以自证也。身心痛痒各自异，得寒热、刀杖痛极，是为身痛；得美饭、载车、好衣，身诸所便，是为身痒。心痛者，身自忧，复忧他人及万事，是为心痛；心得所好及诸欢喜，是为心痒也。意相观者，有两因缘，在内断恶念道。一者，谓五乐六衰当制断之。观者自观身，身不知麁细，以得乃觉，是为意意相观。意意相观，息亦是意，数亦是意；数时观息，为意意相观也。意观止者，欲婬制，不为；欲瞋恚制，不怒；欲痴制，不作；欲贪制，不求；诸恶事一切不向，是为观止；亦谓以知《三十七品经》，常念不离为止也。出息、入息尽定便观者，尽谓罪尽，定谓息止意。定观者，谓观止还净也；尽止者，谓我能说是、晓是、遍更是，是为尽止也。所起息，若布施作福一切善法，已起便灭，更意念耶？向习罪行亦无数，古世今世，意不如是相随；他人亦尔，已知觉，当断已断，为内外意意观止也。","内外法法者，内法谓身，外法谓他人；有持戒法，有不持戒法，是为内外法法也。内法谓行黠不离《三十七品经》，一切余事，意不堕中，行道得道，是为内法。外法谓堕生死，谓生死行，便得生死。不脱一切，当断已断，为内外法观止也。法观止者，一切人皆自身为身，谛校计非我身。何以故？有眼有色，眼亦非身，色亦非身。何以故？人已死，有眼无所见，亦有色无所应。身如是，但有识亦非身。何以故？识无有形，亦无所轻止，如是计眼、耳、鼻、舌、身、意亦尔，得是计为法观止，亦谓不念恶为止。念恶为不止，何以故？意行故也。","出息入息自觉，出息入息自知；当时为觉，以后为知；觉者谓觉息长短，知者谓知息生灭、麁细、迟疾也。出息入息觉尽止者，谓觉出入息欲报时为尽，亦计万物身生复灭。止者，谓意止也。见观空者，行道得观，不复见身。便堕空无所有者，谓意无所著；意有所著因，为有断六入，便得贤明。贤谓身，明谓道也。知出何所、灭何所者，譬如念石出、石入，木石便灭。五阴亦尔，出色入痛痒，出痛痒入思想；出思想入生死，出生死入识，已分别是，乃堕《三十七品经》也。","问：何等为思惟无为道？报：思为校计，惟为听，无谓不念万物，为者如说行，道为得，故言思惟无为道也。思为念，惟为分别白黑。黑为生死，白为道。道无所有，已分别无所有，便无所为，故言思惟无为道。若计有所为、所著，为非思惟。思亦为物，惟为解意；解意便知十二因缘事。亦谓思为念，惟为计也。断生死得神足，谓意有所念为生，无所念为死。得神足者，能飞行故，言生死当断也。","得神足有五意：一者、喜；二者、信；三者、精进；四者、定；五者、通也。四神足念不尽力得五通，尽力自在向六通，为道人四神足，得五通尽意可得六通尽意，谓万物意不欲也。一、信；二、精进；三、意；四、定；五、黠，是五事，为四神足。念为力者，凡六事也。从信为属四神足念，从喜、从念精进、从定、从黠，是为属五根也。从喜定，谓信道；从力定，谓精进；从意定，谓意念定；从施定，谓行道也。为种故有根，有为之事皆为恶，便生想，不能得胜。谓得禅是因为力，亦谓恶不能胜善意。灭复起，故为力。力定者，恶意欲来，不能坏；善意故，为力定也。","道人行道未得观，当校计得观。在所观意不复转，为得观。止恶一法，为坐禅；观二法，有时观身，有时观意，有时观喘息，有时观有，有时观无，在所因缘当分别观也。止恶一法，观二法，恶已尽，止观者为观道。恶未尽不见道，恶已尽，乃得观道也。止恶一法为知恶，一切能制不著意为止，亦为得息想随止。得息想随止，是为止恶一法。恶已止，便得观故。为观二法，为得四谛，为行净。当复作净者，识苦弃习，知尽行道，如日出时净，转出十二门故。经言：从道得脱也。去冥见明，如日出时，譬如日出多所见，为弃诸冥。冥为苦，何以知为苦？多所罣碍，故知为苦。何等为弃习？谓不作事。何等为尽证？谓无所有。道者，明识苦、断习、尽证、念道。识从苦生，不得苦，亦无有识，是为苦也。尽证者，谓知人尽。当老病死证者，知万物皆当灭，是为尽证也。譬如日出作四事：一、坏冥，谓慧能坏痴；二、见明，谓痴除独慧在；三、见色万物，为见身诸所有恶露；四、成熟万物，设无日月，万物不熟；人无有慧痴，意亦不熟也。上头行俱行者，所行事已行，不分别说，谓行五直声，身心并得行也。","从谛念法，意著法中；从谛念法，意著所念是便生是，求生死得生死，求道得道。内外随所起意，是为念法。意著法中者，从四谛自知意生，是当得，是不生，是不得，是便却，意畏不敢犯。所行所念常在道，是为意著法中也。是名为法，正从谛本起，本著意。法正者，谓道法。从谛，谓四谛。本起著意者，谓所向生死万事，皆本从意起。便著意，便有五阴所起。意当断，断本五阴便断。有时自断不念，意自起为罪，复不定在道为罪，未尽故也。意著法中者，谛意念万物，为堕外法中，意不念万物，为堕道法中。五阴为生死法，三十七品经为道法。意著法中者，谓制五阴不犯，亦谓常念道不离，是为意著法中也。","所本正者，所在外为物本，为福所；在内总为三十七品经，行道非一时端故。言所本者，谓行三十七品经法，如次第随行，意不入邪为正，故名为所本正。所本正，各自异行，以无为对本，以不求为对正；以无为为对无为，以不常为对道，以无有为对亦无有所、亦无有本、亦无有正，为无所有也。定觉受身，如是法道，说谓法定。道说者，谓说所从因缘得道。见阴受者，为受五阴。有入者，为入五阴中。因有生死阴者，为受正；正者，道自正，但当为自正心耳。人行安般守意，得数，得相随，得止，便欢喜，是四种。譬如钻火见烟，不能熟物，得何等喜？用未得出要故也。","安般守意有十八恼，令人不随道：一为爱欲，二为瞋恚，三为痴，四为戏乐，五为慢，六为疑，七为不受行相，八为受他人相，九为不念，十为他念，十一为不满念，十二为过精进，十三为不及精进，十四为惊怖，十五为强制意，十六为忧，十七为怱怱，十八为不度意行爱，是为十八恼。不护是十八因缘不得道，以护便得道也。不受行相者，谓不观三十二物，不念三十七品经，是为不受行相。受他人相者，谓未得十息，便行相随，是为受他人相。他念者，入息时念出息，出息时念入息，是为他念。不满念者，谓未得一禅，便念二禅，是为不满念。强制意者，谓坐乱，意不得息，当经行、读经，以乱不起，是为强制意也。精进为黠，走是六事中，谓数息、相随、止、观、还、净，是为六也。何等为喘？何等为息？何等为气？何等为力？何等为风？喘者，为意息，为命守，为气，为视听风，为能言语，从道屈伸力，为能举重瞋恚也。要从守意得道，何缘得守意？从数转得息，息转得相随，止观还净亦尔也。","行道欲得止意，当知三事：一者、先观念身本何从来，但从五阴行有，断五阴不复生；譬如寄托须臾耳，意不解，念九道以自证。二者、自当内视心中随息出入。三者、出息入息念灭时。息出小轻念灭时，何等为知无所有？意定便知空，知空便知无所有。何以故？息不报便死，知身但气所作，气灭为空，觉空堕道也。故行道有三事：一者、观身；二者、念一心；三者、念出入息。复有三事：一者、止身痛痒；二者、止口声；三者、止意念行，是六事疾得息也。要经言：一念谓一心，近念谓计身，多念谓一心，不离念谓不离念。身行是四事，便疾得息也。坐禅数息，即时定意，是为今福；遂安隐不乱，是为未来福；益久续复安定，是为过去福也。坐禅数息不得定意，是为今罪；遂不安隐乱意起，是为当来罪；坐禅益久遂不安定，是为过去罪也。亦有身过、意过：身直数息不得，是为意过；身曲数息不得，是为身过也。坐禅自觉得定意，意喜为乱意，不喜为道意。坐禅念息已止便观，观止复行息。人行道，当以是为常法也。","佛说有五信：一者、信有佛有经；二者、去家下头发求道；三者、坐行道、四者、得息；五者、定意。所念不念为空，难不念为空。何以故念息？报曰：息中无五，色贪、婬、瞋恚、愚痴、爱欲，是亦为空也。可守身中意者，谓意在身观，是为身中意。人不能制意，故令数息，以黠能制意，不复数息也。","问：何等为自知？何等为自证？报：谓能分别五阴是为自知，不疑道是为自证也。","问曰：何等为无为？报：无为有二辈：有外无为，有内无为。眼不观色，耳不听声，鼻不受香，口不味味，身不贪细滑，意不志念，是为外无为；数息、相随、止、观、还、净，是为内无为也。","问：现有所念，何以为无为？报：身口为戒，意向道行，虽有所念，本趣无为也。","问：何等为无？何等名为？报：无者，谓不念万物；为者，随经行指事称名，故言无为也。","问：设使宿命对来到，当何以却？报：行数息、相随、止、观、还、净，念三十七品经能却。","难：宿命对不可却，数息行三十七品经何以故能却？报：用念道故消恶。设使数息、相随、止、观、还、净不能灭恶，世间人皆不得道；用消恶，故得道。数息、相随、止、观、还、净，行三十七品经尚得作佛，何况罪对，在十方积如山，精进行道，不与罪会。","问曰：经言作是何以故不会？报：用作是故也。数息为堕十二品。何谓十二品？数息时，堕四意止；息不乱时，为堕四意念断，得十息；有时为堕四神足，是为堕十二品也。","问：何等为念三十七品经？报：谓数息、相随、止、观、还、净，行是六事，是为念三十七品经也。行数息，亦为行三十七品经。","问：何以故为行三十七品经？报：数息为堕四意止。何以故？为四意止，亦堕四意断，用不待念，故为四意断；亦堕四神足，用从信，故为神足也。数息为堕信根，用信佛意喜，故生信根；亦堕能根，用坐行，故为堕能根；亦堕识根，用知谛，故为识根；亦堕定根，用意安，故为定根；亦堕黠根，用离痴意解结，故为黠根也。数息亦堕信力，用不疑，故为信力；亦堕进力，用精进，故为进力；亦堕念力，用余意不能攘，故为念力；亦堕定力，用一心，故为定力；亦堕黠力，用前分别四意止、断、神足，故为黠力也。","数息亦堕觉意。用识苦，故为觉意；亦堕法识觉意，用知道因缘，故为法觉意；亦堕力觉意，用弃恶，故为力觉意；亦堕爱觉意，用贪乐道，故为爱觉意；亦堕息意觉，用意止，故为息意觉；亦堕定觉意，用不念，故为定觉意；亦堕守觉意，用行不离，故为守觉意也。","数息亦堕八行，用意正，故入八行。定意、慈心、念净法，是为直身；至诚语、软语、直语、不还语，是为直语。黠在意，信在意，忍辱在意，是为直心。所谓以声息，是为十善堕道行也。数息亦堕直见，用谛观，故为直见；亦堕直行，用向道，故为直行；亦堕直治，用行三十七品经，故为直治；亦堕直意，用念谛，故为直意；亦堕直定，用意白净，坏魔兵，故为直定，是为八行。何等为魔兵？谓色、声、香、味、细滑，是为魔兵。不受是为坏魔兵。","三十七品应敛，设自观身，观他人身，止婬，不乱意，止余意；自观痛痒，观他人痛痒，止瞋恚；自观意，观他人意，止痴；自观法，观他人法，得道，是名为四意止也。避身为避色，避痛痒为避五乐，避意为避念，避法不堕愿业治生，是名为四意念断也。识苦者，本为苦，为苦者，为有身。从苦为因缘起者，所见万物。苦习者，本为苦，从苦为因缘生。尽者，万物皆当败坏。为增苦习，复当为堕八道中。道人当念是八道，是名为四，为四收苦，得四神足念也。信佛意喜，是名为信根。为自守行法，从谛身意受，是名能根，为精进；从谛念遂谛，是名识根，为守意；从谛一意，从谛一意止，是名定根，为正意；从谛观谛，是名黠根，为道意，是名为五根也。","从谛信不复疑，是名信力；弃贪行道从谛自精进，恶意不能败精进，是名进力；恶意欲起当即时灭，从谛是意无有能坏意，是名念力；内外观从谛以定，恶意不能坏善意，是名定力；念四禅从谛得黠，恶意不能坏黠意，是名黠力。念出入尽复生，是名为五力也。从谛念谛，是名为觉意。得道意，从谛观谛，是名法名法识觉意；得生死意，从谛身意持，是名力觉意；持道不失为力，从谛足喜谛，是名爱觉意；贪道法行道行道法，从谛意得休息，是名息意，觉已息安隐，从谛一念意，是名定觉意；自知意，以安定从谛自在，意在所行从观，是名守意觉；从四谛观意，是名为七觉意也。","从谛守谛，是名直信道；从谛直从行谛，是为直从行念道；从谛身意持，是名直治。法不欲堕四恶者，谓四颠倒。从谛念谛，是名直意不乱意；从谛一心意，是名直定。为一心上头，为三法意行，俱行以声身心，如是佛弟子八行，是名四禅，为四意断也。第一行为直念，属心，常念道；第二行为直语，属口，断四意；第三行为直观，属身，观身内外；第四行为直见信道；第五行为直行，不随四恶，谓四颠倒；第六行为直治，断余意；第七行为直不堕贪欲；第八行为直定正心，是为八行。佛、辟支佛、阿罗汉所不行也。","第一行为直念。何等为直念？谓不念万物，意不堕是中，是为直念；念万物，意堕中，为不直念也。四意止者：一意止为身念息，二意止为念痛痒，三意止为念意息出入，四意止为念法因缘，是为四意止也。","道人当念是四意止：一者、为我前世爱身，故不得脱；二者、今有剧怨家。何以故？所欲者爱生，当断已断，为外身观止也。四意止者，意止者，意不在身为止意，不在痛痒为止意，不在意为止意，不在法为止意。随色诚便生，是为不止也。","问：人何以故不堕四意止？报：用不念苦、空、非身、不净故，不堕四意止。若人意常念苦、空、非身、不净，行道者常念是四事不离，便疾得四意止也。","问：何等为身意止？谓念老、病、死，是为身意止。何等为痛痒意止？谓所不可意，是为痛痒意止。何等为意意止？谓已念、复念，是为意意止。何等为法意止？谓往时为行，还报为法，亦谓作是得是，是为法意止也。","四意止有四辈：一者、念非常意止；二者、念苦身意止；三者、念空有意止；四者、念不净乐意止，是为四意止。一切天下事皆堕身痛痒、堕法，都卢不过是四事也。四意止者：一者、但念息不邪念；二者、但念善不念恶；三者、自念身非我所，万物皆非我所，便不复向；四者、眼不视色，意在法中，是名为四意止也。","道人当行四意止：一者、眼色，当校计身中恶露；二者、意欢喜念乐，当念痛痒苦；三者、我意瞋他，人意亦瞋；我意转他，人意亦转，便不复转意；四意者，我意嫉他，人意亦嫉；我念他人恶，他人亦念我恶，便不复念，是为法也。身意止者，自观身，观他人身。何等为身？欲言痛痒是身，痛无有数；欲言意是身，复非身有过去，意未来意；欲言法是身，复非身有过去未来法；欲言行是身，行无有形，知为非身。得是计，为四意止也。意不堕色念，识亦不生，耳、鼻、口、身亦尔。意不在身为心，意不在痛痒，意不在念，意不在法为心也。","问：谁主知身意痛痒者？报：有身，身意知；痛痒，痛痒意知；意意，意意知；有饥，饥意知；有渴，渴意知；有寒，寒意知；有热，热意知。以是分别知也。身意起身意，痛痒意起痛痒意，意意起意意，法意起法意。四意止，谓意念恶，制使不起，是为止也。四意止亦随四禅，亦随四意止。随四意止为近道，不著恶便善意生；四禅为四意定，为止意也。","行道有四因缘：一、止身；二、止痛痒；三、止意；四、止法。止身者，谓见色念不净；止痛痒者，谓不自贡高；止意者，谓止不瞋恚；止法者，谓不疑道人行。四意止，意起念生，即时识对行药，得一意止，便得四意止也。","四意定：一者、自观身，亦复观他人身；二者、自观痛痒，亦复观他人痛痒；三者、自观心，亦复观他人心；四者、自观法因缘，亦复观他人法因缘。如是身，一切观内外因缘、成败之事，当念我身，亦当成败，如是是为四意定也。人欲止四意，弃为外，摄为内；已摄意为外，弃为内也。观他人身，谓自观身不离他，便为观他人身苦，观他人身为非痛痒，意法亦尔也。自贪身，当观他人身；念他人身，便自观身，如是为意止。","问：意见行何以为止？报：意以自观身贪，便使观他人身，为意从贪转故应止；若意贪他人身，当还自观身也。","有时自身观，不观他人身；有时当观他人身，不当自观身；有时可自观身，亦可观他人身；有时不可自观身，亦不可观他人身。自观身者，为校计观他人身，意不止，须自念身为著，便转著他人身。观他人身为见色、肥、白、黛眉、赤唇，见肥当念死人胀，见白当念死人骨，见眉黑当念死人正黑，见朱唇当念血正赤。校计身诸所有，以得是意便转，不复爱身也。","观有内外，嫉、恚、疑当内观，贪、婬当外观。贪当念非常败，婬当念对所有恶露。如自观身婬，当念四断意也。观有两辈：一者、观外；二者、观内。观身有三十六物，一切有对皆属外；观无所有为道，是为内观也。观有三事：一者、观身四色，谓黑、青、赤、白；二者、观生死；三者、观九道。观白见黑为不净，当前闻以，学后得道；未得道，为闻得别，为证得，为知也。观有四：一者、身观；二者、意观；三者、行观；四者、道观，是为四观。譬如人守物，盗来便舍物；视盗人已得观，便舍身观物也。","观有二事：一者、观外诸所有色；二者、观内谓无所有。观空已得四禅，观空无所有，有意、无意、无所有，是为空，亦谓四弃得四禅也。欲断世间事，当行四意止，欲除四意止，当行四意断。人堕贪，贪故行。四神足飞，但有五根无有五力，不能制，但有五力无有五根，不生。得四神足，尚转五力，能制上次十二品。四意断，不作现在罪，但毕故罪，是为四意断也。毕故不受新，为四意止，故毕新止，为四意断，故竟新断，为四神足。知足不复求守意，意为毕，生为新，老为故，死为身体坏败为尽也。四意断，谓常念道。善念生便恶念断，故为断息道；善念止便恶念生，故为不断也。四意断者，意自不欲向恶是为断，亦谓不念罪断也。","四神足：一者、身神足；二者、口神足；三者、意神足；四者、道神足。念飞，念不欲灭，不随道也。四伊提钵，四为数，伊提为止，钵为神足。欲飞便飞，有时精进坐七日便得，或七日，或七岁也。得神足可久在世间，不死有药：一者、意不转；二者、信；三者、念；四者、有谛；五者、有黠，是为神足药也。得四神足，不久在世间，有三因缘：一者、自厌其身臭恶，故去；二者、无有人能从受经道，故去；三者、恐怨恶人诽谤得罪，故去也。神足九辈，谓乘车马，步疾走，亦为神足；外戒坚亦为神足；至诚亦为神足；忍辱亦为神足也。行神足当飞意。","问：何为飞意？报：有四因缘：一者、信；二者、精进；三者、定；四者、不转意。何等为信？信飞行。何等为精进？飞行。何等定？飞行。何等为不转意？谓著飞行不转意也。身不欲行道，意欲行便行，神足如是，意欲飞即能飞也。","五根，譬如种物，坚乃生根，不坚无有根。信为水雨，不转意为力，所见万物为根，制意为力也。信根中有三阴：一为痛痒，二为思想，三为识阴。定根中有一阴，谓识阴也。","五根、五力、七觉意，中有一阴者，中有二阴者，中有三阴者，有四阴者，皆有阴。","问：是道行，何缘有阴？报：以泥洹无阴，余皆有阴也。七觉意，上三觉属口，中三觉属身，下一觉属意。何等为觉？念念为觉，念念为得，觉得是意，便随道也。外七觉意为堕生死，内七觉意为随道。内七觉意者，谓三十七品经；外七觉意者，谓万物也。觉者为识事，便随觉意也。有觉意便随道觉，有觉意堕罪觉。三十七品经便正意，是为随道；觉善恶，是为堕罪也。","问：何等为从谛身意持报？谓身持七戒，意持三戒，是为身意持也。从谛意得休息，从四谛意因缘休；休者为止，息为思，得道为受思也。贪乐道法，常行道为爱觉意，持道不失为力觉意，已得十息身安隐为息觉意，自知已安为定觉意。身意持，意不走为持，从谛自在，意在所行，谓得四谛。亦可念四意止，亦可四意断，亦可四神足，亦可五根、五力、七觉意、八行，是为自在意。","在所行从谛观者，为三十七品经要。是为守意觉者，谓谛不复受罪也。八行有内外，身为杀、盗、婬，声为两舌、恶口、妄言、绮语，意为嫉、妬、痴。是上头三法，为十事在外，五道在内也。从谛守谛，从为神，守为护，谓法不犯罪。谛为道，知非常、苦、空、非身、不净为直见；非常人计为常，思苦为乐，空计为有，非身用作身，不净计为净，是为不直见也。何等为直见？信本因缘，知从宿命有，是名为直见。何等为直治？分别思惟，能到善意，是为直治。何等为直语？守善言，不犯法，如应受言，是名为直语也。何等为直业？身应行不犯行，是名为直业也。何等为直治？随得道者教戒行，是名为直治也。何等为直精进？行行无为，昼夜不中止，不舍方便，是名为直精进方便也。何等为直念？常向经戒，是名为直念。何等为直定？意不惑亦不舍行，是名为直定。如是行，令贤者八业行具，已行具足，便行道也。八直有治、有行，行八直，乃得出要，身不犯戒，是为直治。慧、信、忍辱是为行身，意持是名为直治。谓无所念为直，有所念为不直也。","十二部经都皆堕三十七品经中，譬如万川四流，皆归大海。三十七品经为外，思惟为内。思惟生道故为内；道人行道，分别三十七品经，是为拜佛也。三十七品经亦堕世间，亦堕道。讽经口说是为世间，意念是为应道。持戒为制身，禅为散意。行从愿，愿亦从行。行道所向，意不离；意至佛，意不还也。","亦有从次第行得道，亦有不从次行得道。谓行四意止、断、神足、五根、五力、七觉意、八行，是为从次第。畏世间恶，身便一念从是得道，是为不从次第。道人能得三十七品行意，可不顺从数息、相随、止也。身口七事，心、意、识各有十事，故为三十七品。四意止、断、神足属外，五根、五力属内，七觉意、八行得道也。泥洹有四十辈，谓三十七品经并三向，凡四十事，皆为泥洹。","问：数息为泥洹，非报数息、相随，鼻头止意有所著，不为泥洹，泥洹为有不？报：泥洹为无有，但为苦灭，一名意尽。","难：泥洹为灭。报：但善恶灭耳。","知行者，有时可行四意止，有时可行四意断，有时可行四神足，有时可行五根、五力、七觉意、八行。谛者，为知定乱。定为知行，乱为不知行也。","问：何以故正有五根、五力、七觉意、八行？报：人有五根，道有五根；人有五力，道有五力；人有七使，道有七觉意；行有八直，应道八种。随病说药，因缘相应。眼受色、耳闻声、鼻向香、口欲味、身贪细滑，是为五根。何以故名为根？已受当复生，故名为根，不受色、声、香、味、细滑，是为力，不堕七使为觉意，已八直为应道行。五根坚意，五力为不转意，七觉为正意，八行为直意也。","问：何等为善意？何等为道意？报：谓四意止、断、神足、五根、五力，是为善意；七觉意、八行，是为道意。有道善，有世间善。从四意止至五根、五力，是为道善；不婬、两舌、恶口、妄言、绮语、贪、瞋、痴，是为世间善。谛见者，知万物皆当灭，是为谛见；万物坏败，身当死，以不用为忧，是为谛观。意横意走，便责对得制，是为除罪；诸来恶不受为禅。","一心内意十二事智慧，七为数，八为相随，九为止，十为观，十一为还，十二为净，是为内十二事；外复十二事，一为目，二为色，三为耳，四为声，五为鼻，六为香，七为口，八为味，九为身，十为细滑，十一为意，十二为受欲，是为外十二事也。术阇者为智，凡有三智：一者、知无数世父母、兄弟、妻子；二者、知无数世白黑、长短，知他人心中所念；三者、毒以断，是为三也。沙罗惰怠者，为六通智：一为神足，二为彻听，三为知他人意，四为知本所从来，五为知往生何所，六为知索漏尽，是为六也。"],source:"https://cbetaonline.dila.edu.tw/zh/T15n0602",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T15/T15n0602.xml",sourceLabel:"CBETA T15n0602",scope:"全2卷正文（不含序跋、目录、附录）",originalTitle:"佛說大安般守意經",juan:[1,2]},{id:"cbeta-t15n0603",title:"阴持入经",subtitle:"阴持入经 · 后汉 安世高译",paragraphs:["佛经所𧗪，亦教诫，皆在三部，为合𧗪。何等为三？一为五阴，二为六本，三为所入。","五阴为何等？一为色，二为痛，三为想，四为𧗪，五为识；是为五阴。","色阴名为十现色入，十现色入为何等？一、眼，二、色，三、耳，四、声，五、鼻，六、香，七、舌，八、味，九、身，十、乐；是为十现色入。是名为色种。","痛种为何等？痛种为身六痛：一、眼知痛，二、耳知痛，三、鼻知痛，四、舌知痛，五、身知痛，六、心知痛；是为身六痛，名为痛种。","思想种为何等？思想种为身六思想：一、色想，二、声想，三、香想，四、味想，五、更想，六、法想；是为身六思想，名为思想种。","行种为何等？𧗪种名为身六更：一、色所更，二、声所更，三、香所更，四、味所更，五、触所更，六、法所更；是为身六更，是名为行种。","识种为何等？识种名为身六识：眼识、耳识、鼻识、舌识、身识、心识；是为身六识，是名为识种。","名为五阴种，当知是。是从何知？为非常、苦、空、非身。从是知亦有二知：一为慧知，二为断知。从慧知为何等？为非常、苦、空、非身，是为从慧知。从断知为何等？爱欲已断是为从断知。","阴貌为何等？积为阴貌，足为阴貌；譬如物种名为物种，木种名为木种，火种名为火种，水种名为水种，一切五阴亦如是。","有十八本持，十八本持为何等？一、眼，二、色，三、识，四、耳，五、声，六、识，七、鼻，八、香，九、识，十、舌，十一、味，十二、识，十三、身，十四、更，十五、识，十六、心，十七、法，十八、识，是名为十八本持。","已知是，从何知？为非常、苦、空、非身，是为知。从是知亦有二知：一为、从慧知，二为、从已断知。从慧知为何等？为非常、苦、空、非身，是为从慧知。从断知为何等？爱欲已断是为从断知。彼为具足，具足为何等？或言无有余具足，已无有余，令眼明见明。","一𧗪者，说是已为断眼本、耳本，遍说如是，卒名为本持；譬是人为多热，如是名遍，譬喻是为具足。","亦有十二入，何等为十二？自身六，外有六。自身六，为何等？一为眼、耳、鼻、舌、身、心，是为自身六入。外有六，为何等？色、声、香、味、更、法，是为十二入。","一切从何知？为非常、苦、空、非身，是从是知，亦有二知：一从慧知，二从断知。从慧解知为何等？为非常、苦、空、非身，是为从慧知。从断知为何等？爱欲已断是为从断知。","何等为入？解从是致名为入，从入解；譬从金入名为金地，从银入名为银地，如是各各应是譬喻所从所入，是从是有，如是从所意念，有行罪苦法如是。从所致，是名为从是入。亦有从是入，譬如王有入所有名，是亦如是。","为有四谛：苦、习、尽、道。苦名为要，语身亦念；习名为要，痴亦所世间爱；尽名为要，慧亦解脱；道名为要，止亦观。","亦有三十七品经法：四意止、四意断、四神足、五根、五力、七觉意、贤者八种道𧗪，是为三十七品经法。过去佛亦有是，现在佛亦有是，未来佛亦有是。辟支佛亦从是得度世道，佛弟子亦从是，是为度世无为道。","四意止为何等？或见比丘，自身身身相观行止，外身身身相观𧗪止，内外身身身相观行止，尽意念以却世间痴心不便；自痛痛痛相观𧗪止，外痛痛痛相观𧗪止，内外痛痛痛相观𧗪止。尽意念以却世间痴心不便；自意意意相观𧗪止，外意意意相观𧗪止，内外意意意相观𧗪止，尽意念以却世间痴心不便；自法法法相观𧗪止，外法法法观𧗪止，内外法法法相观𧗪止，尽意念以却世间痴不便。","何等为从四意正断？或比丘有未生弊恶意法发，方便令不生，劝意不舍方便，𧗪精进摄制意，舍散恶意，是为一断意；已生弊恶意发，清净法欲断，劝意求方便，𧗪精进摄制意，舍散恶意，是为二断意；未生清净法劝意发，方便令生，𧗪精进摄制意，舍散恶意，是为三断意；已生清净法，令止不忘、令不减、令𧗪，不啻令𧗪足发方便，𧗪精进摄制意，舍散恶意，是为四意正断。","何等为四神足？或有比丘，为欲定断生死，随𧗪增神足，恶生死猗，却欲猗尽猗，是为一神足；精进定断生死，随𧗪增神足，恶生死猗，却欲猗尽猗，从不便意生遣离去，是为二神足；意定断生死，随𧗪增神足，恶生死猗，却欲猗尽猗，从不便意生遣离去，是为三神足；戒定断生死，随𧗪增神足，恶生死猗，却欲猗尽猗，从不便意生遣离去，是为四神足。","四意止、四意断、四神足，为已说具。","何等为五根？信根、精进根、念根、定根、慧根，是名为五根。彼根应何义根为根义？属为根义，可喜为根义，不为同事为根义，是名为根义。","何等为五力？信力、精进力、念力、定力、慧力，是名为五力。彼力应何义？无有能得坏为力义，有所益为力义，有胆为力义，能得依为力义，是名为力义。","有七觉意，何等为七觉意？一、念觉意，二、法分别观觉意，三、精进觉意，四、爱可觉意，五、猗觉意，六、定觉意，七、护觉意；是名为七觉意。","有得道者八种道𧗪，何等为八？一、直见，二、直𧗪，三、直语，四、直治，五、直利，六、直方便，七、直意，八、直定；是名为八道𧗪。","八种道𧗪为堕合三种：一、戒种，二、定种，三、慧种。彼所直语、直业、直治，是名为戒种；彼所直方便、直念、直定，是名为定种；彼所直见、直𧗪，是名为慧种。皆从是教诫，令不啻教诫、令不啻教意、令不啻慧教诫。","彼戒种比丘，为拔瞋恚亦𦼇本、为散瞋恚结、为合恚疮、为识苦痛、为度欲界。","彼定种比丘，为拔悭𦼇本、为散欲结、为合欲疮、为知乐痛、为度色界。","彼慧种比丘，为拔痴𦼇本、为散痴结、为合憍慢疮、为知不乐不苦痛、为得度无有色界。是为三种比丘。止为拔三𦼇本、散三𦼇使、合四疮、知三痛、度三界。","何等为十二种？从求如求等生，从痴因缘令有𧗪，从𧗪令有识，从识令有名字，从名字令有六入，从六入令有致，从致令有痛痒，从痛痒令有爱，从爱令有受，从受令后有，从有令有生，从生令有老死忧悲苦，不可心致𤺙，如是具足苦种，为致习。痴已尽便𧗪尽，已𧗪尽便识尽，已识尽便名字尽，已名字尽便六入尽，已六入尽便致尽，已致尽便痛痒尽，已痛痒尽便爱尽，已爱尽便受尽，已受尽便有尽，已有尽便生尽，已生尽便老死尽，已老死尽，忧悲苦不可心𤺙便尽，如是具足苦种便得尽。","彼痴名为不知四谛如有，不解不见、不相应不受、不解不解根，是名为痴。","彼痴因缘𧗪为何等？为六望受。何等为六？色声、香、味、触、法。是为身六望受，是名为𧗪。","彼𧗪因缘识为六身识，眼、耳、鼻、舌、身、心，是名为六身识。","彼识因缘名字，字为色，名为四不色阴，痛想𧗪识是为名。色为四大本，谓地、水、火、风是。上为名，是四为色，是二相连共为名字。","彼名字因缘身六入受：眼、耳、鼻、舌、身、心，是名身六入受。","彼六入因缘身六思望：眼、耳、鼻、舌、身、心，是名为身六思望。","彼思望因缘身六痛：眼、耳、鼻、舌、身、心，是名为身六痛。","彼痛因缘六身爱：色爱、声爱、香爱、味爱、触爱、法爱，是名为六身爱。","彼爱因缘受为四受：一、欲受，二、见结受，三、戒愿受，四、身结𧗪受，是名为四受。","彼受因缘有为三有：一、欲界，二、色界，三、无色界，是名为三有。彼有因缘生，为上五阴、六持、六入。己有如有，生聚，已往堕致分别根，已入得有，是名为生死。","为何等名？为人人所在，在所往。已往坏已过，死时是命，亦根已闭塞，是为死。上本为老，后要为死，是故名为老死。","痴相为何等？为冥中见冥。如有不解，令从是致堕行相处。","𧗪相为何等？为令后复有，是为𧗪相。上从是发起，令从是致堕识处。","识相为何等？为识物、识事，是为识相，令从是致堕名字处。","名字相为何等？为俱猗，是为名字相，令从是致堕六入处。","六入相为何等？为分别根，是为六入相，令从是致堕思望处。","思望相为何等？为相会更生，是为思望相，令从是致堕痛处。","痛相为何等？为更觉，是为痛相，令从是致堕爱处。","爱相为何等？为发往，是为爱相，令从是致堕受处。","受相为何等？为受持，是为受相，令从是致堕有处。","有相为何等？令堕若干处，是为有相，令从是致堕生处。","生相为何等？为已有五阴，是为生相，令从是致堕老处。","老相为何等？为转熟是为老相，令从是致堕死处。","死相为何等？为命根尽，是为死相，令从是致堕苦处。","苦相为何等？为身急，是为苦相，令从是致堕不可处。","不可相为何等？为心意急，是为不可相，令干从是致堕悒悒忧。","悒悒相为何等？为忧五阴，令从是致堕愁𤺙处。","悲愁相为何等？口出声言，令致悲𤺙懑，懑为𤺙，𤺙亦为懑。","九绝处，为一切𦼇𧗪令部伴，从流行。","为有二本从有结罪，为三𦼇本，亦有四倒。","彼二本罪𤺙为何等？一为痴，二为堕有爱，名为二本。","三𦼇本为何等？一为贪欲，二为瞋恚，三为痴惑，是名为三𦼇本。","有四倒，四倒为何等？非常念常，是为思想倒、为意倒、为见倒，是为一倒；计苦为乐、非身为身、不净为净、思想意见倒，如上说，是名为四倒。","彼痴名为不解四谛：不慧、不见、不相应、不解受为𦼇，是为痴。","彼有爱为何等？为所世间欲发往不舍，是为有爱，是名为二本。彼欲贪本为何等？为所在所种贪，为奇珍宝，为奇财产，为奇严事，为有嫉在奇。贪可贪欲，可往爱相，爱哀相，往不舍，是为贪𦼇本。","是本为谁？为所有贪，为身非法𧗪，口非法𧗪，心非法行，亦余俱相连。𦼇种所作，意念是法本，是故名为贪𦼇本。","彼瞋恚非法本为何等？为在人为在𧗪，恚相恚，不忍不识，因缘瞋瞋恚发评谆，念不可，说不可，所念说不好令意却，是为恚非法本。是本为谁？为非法本，所身罪、所言罪、所心罪，亦余所相连意念，为是法本，是故为瞋，名为非法本。","彼痴惑非法本为何等？不知四贤者谛如有，不解不见、不相应不解，受非法，或随或受、或在或不识、或痴冥在冥。蔽覆令冥、令无眼、令慧坏，知尽不能致无为度世，是痴惑非法𧗪本。是本为谁？为惑非法，身𧗪作、口𧗪作、心𧗪作，亦所共相助非法，意所念非法本，是名为惑非法本。","彼当知，倒亦当知，所倒当知，从所倒当知是。","彼有一倒，从一倒为四倒，从所有为三倒。何等为一倒？为对或受，非常为常，苦为乐，非身为身，不净为净，是为一倒。","何等为四倒？所有身、痛、意、法，是为四倒。","何等为三倒？一为想，二为意，三为见，是为三倒。","使彼所可意根相连著，若色若像为受想，是为欲想。","以为有欲想，相随久不断，在意念是为欲念种。","若彼所想分别受，是名为想倒。","彼惑意不如有受，所从不应受解，是名为意倒。","所以受不舍在意，念在色，不净意计净，听可意念已快所见受往，是名为见倒。","彼所见已为相分别，应当为十二倒。何等为十二？在身有三，在痛有三，在意有三，在法有三。有四想倒，意倒亦有四，见倒亦有四；亦为在入因缘相会色，令为十二倒。身三、痛三、意三、法三合为十二倒。为如是六，为七十二倒。","从本得因缘，起随因缘，多少无有量，不可数，在人无有数，无有数倒。","彼五阴为四身有，从所有色阴是属身；从有痛阴是属痛身；从有识阴是属意身；从有想阴亦𧗪阴，是属法身。从有是五阴，令受四身因缘有。","彼身不净计净，是为身倒；彼痛苦计为乐，是为痛倒；彼意非常计为常，是为意倒；彼法不为身计为身，是为法倒。为欲正四倒故，佛为现四意止为说分别。","彼为身身相观𧗪止，为不净意念净倒得解；彼为痛痛相观为苦计为乐倒得解；彼为意意相观非常计为常倒得解；彼为法法相观非身计为身倒得解。","彼冥中冥如有不解是为痴相；令堕所倒处，欲得往是为爱相；令从是受色为身，故令欺奇，是为贪相；令堕不与取，所可不如意是为恚相；令堕杀处，为不解事，是为痴惑相；令受邪堕邪处，为作彼所𧗪法不却受相是为；令堕有常想，不知身、躯、物为更相会相，令计乐想为堕身处，为不解所法相为有身想；令堕是为是我所处为堕，受色像相，令计是为净想；令从是堕，不摄守根处，是为九品。为已分别，为一切不可𧗪非法伴已说。竟是，多闻者能解，不多闻者卒不解；是为慧人能解，不慧卒不解；是𧗪者能解，不随行不解。","有九绝处，令一切净法部堕聚合。何等为九？一、止，二、观，三、不贪，四、不恚，五、不痴，六、非常，七、为苦，八、非身，九、不净，是为九。","彼止名为意止，在处能止、已止、正止、摄止、不失止、不志、心寂然，一一向念是名为止。","何等为观？观名为了阴、为了持、为了入、了名字、了从本生、了从本法已生、了苦、了习、了尽、了道𧗪、了从善𦼇从是法生，了增复增、了白黑，了是可随、不可随。如有分别，为拕、不拕、为下、复下、为念、复念、为思观、为识、为慧、为眼、为谋、为满、为解、为慧、为明、为欲、为光、为敢不离、为观法、为觉意、为直见、为道种，是名为观。","亦有若干二辈观：一为净观，二为不净观，三为清净观，四为不清净观，五为黑观，六为白观，七为可𧗪观，八为不可𧗪观，九为罪𧗪观，十为殃福观，十一为缚观，十二为解脱观，十三为有所益观，十四为失无所益观，十五为往观，十六为还观，十七为受罪观，十八为除罪观，是故名为观。","亦为二因缘令有是说止，为一切天下人有二病。何等为二？一为痴，二为爱。是二病故，佛现二药。何等为二？一为止，二为观。若用二药为愈二病，令自证。贪爱欲，不复贪念，意得解脱，痴已解，令从慧得解脱。","彼爱欲药为何等？为止。爱已解，意亦解，意已解，病便愈。","彼痴药为何等？为观。痴已却解，从慧解脱为病愈。","如是佛说，如是二法，当知一为字，二为色。二法当舍：一为痴，二为爱。","二法当自知：一为慧，二为解脱。二法可𧗪：一为止，二为观。","彼止已行令识色，已识令爱得舍，爱已解意便得解脱，自证知。止已行满足便得舍痴，已得舍痴便从慧得解脱，自证知。","若比丘已二法自知字亦色，已二法舍痴亦爱，如是齐是便无所著，应行毕。欲度世，是为尚有余无为未度，已无为竟，命已竟毕，便为苦尽，令后无苦。","彼以有是阴，亦持亦入，已尽止寂然，从后无阴亦持亦入，无相连不复起，是为无余。已得度世无为，毕是为二无为种。","彼不贪清净本为何等？为三界中不得、不望、不求，是名为不贪清净本。","是本为谁？为不贪身清净、言清净；亦余相连清净法意所念为本，是为不贪清净本；亦有清净本，佛说为八种行，是清净本。彼为三清净道种，是为不贪本。何等为三？一为、直方便治。二为、直念。三为、直定。是为三清净道种本，是故名为不贪清净本。","彼无恚不犯法本为何等？若忍所𧗪，未来为不出恚忍因缘，为不恚不恚不受殃，无恚无瞋亦不瞋，无怨亦不想怨，是为无恚不犯法本。是故名为无恚不犯法本。","亦有三清净道种：一、无恚不犯法本为正语，二为正业，三为正致利。是为三清净道种，是故名为无恚不犯法本。","彼不惑清净本为何等？为从慧见四谛如有，如有应受清净，不愚不惑，不随惑亦不堕惑。慧明明相见，从清净法，是为不惑清净本。","是本为谁？为不惑清净，所身𧗪、所言𧗪、所心𧗪，亦所相连清净法，为意思惟相念所法本。","亦为从二清净道种，为不惑本：一为直见，二为直𧗪。是为从二清净道种本。是故名为不惑清净本，是为三清净、为八种道，已份在所随应非常，为如是。","彼非常想为何等？一切所𧗪是非常想，所想计知是为受，是为非常想。","亦从有世间八法。何等为八？有利无利、名闻不名闻、有论议无论议、若苦若乐。为意不堕不受，从若干思不受，止护观，思恶得止，是名为非常想。","彼苦想为何等？为一切世间行，是为苦所想觉知受，是名为苦想。","从是要为何等？望苦想为已习、已增，所念已多，为贪已足，为不堕贪，为意不受不堕，相牵不堕、不念。若干意护观为已，恶为得止，从是思望致是要。","彼非身想为何等？为一切法不计身不堕身，为想知想受，是名为非身想。","从是为何等？望致非身想已，为念思，为已增，令是是自计我，为是为意不受舍若干态，不受跓为观，𤻀恶得止，是为从是要致。","彼恶不净想为何等？为一切世间𧗪为不净，所想自知受，是名为不净想。","从是想为何等？望致不净想已，为念为思为已增，令世间五乐意却舍意，不牵不受不复堕，若干念以得护，为𤻀恶得跓，是为从是要致。彼为四思想念行，何以故？令知五阴，故佛说是分别，见彼不净想𧗪，为令色阴从是解，彼苦想𧗪，令痛阴从是解，彼非身想𧗪，令思想阴亦𧗪阴从是解。","彼非常想𧗪，令识阴从是解。","彼从止𧗪，令爱从是解。","彼从观𧗪，令痴从是解。","彼从不贪，为舍贪。","彼从不恚为舍恚。","彼从不惑为舍痴。","彼从非常想，令解有常。","彼从苦想，为解乐想。","彼从非身想，为解身想。","彼从不净想，为解净想。","彼从止摄意能得还，是为止想，令从是止禅。","彼从一切法寂然，能得解受，是为观想，令止跓一切知。","从欲能得还想，是为不贪相，令还不与取止。","已后不复生痴，是为无有恚想，令从杀还得止。识事亦物是为不惑相，为令得止，止所世间、所𧗪为、所法能受相，是为非常想。","令知从生，亦知从灭，识为是处。","为世间𧗪，作世间更，所所识想是为苦，为所思想，是为痛种处。","一切所法不住想，是为非身想，是为思想。","是已见身尸已坏，青膖为受是相，是为不净思想。","从是为悔却，令寂然止。是为九品处，已分别说。","见为一切无为部，说具足是为谁？知多闻、少闻不为慧者。不慧不为常意在经，为意相连生。为从不分别观；令不得非常想，不受非常想；令从是堕五乐；令五乐覆盖，从所应𧗪失；令不解苦想；令堕五阴受入；令为意计是身。若干本非一本，不舍不观，令不堕非身想，为意在颜色。","乐计是身为净，不计是皮肌覆，令不堕不净想，不住受、止。是想不信令无有想，不受喜。为从是四种已除，堕得无为种处。","佛说信根，比丘欲见知，当求在四沟港种为清净法，不舍方便相，令致清净，从清净发起令堕四意止。","佛说精进根，比丘欲见知，当在四意断。过去所更，相念不忘，为从不忘发生堕四意止。","佛说念根，比丘欲见知，当观在四意止。为一意想，是为定从不惑起，令堕四禅处。","佛说是比丘欲知定根，当知在四禅，从本校计为慧，如有能得持，从是发起令堕四谛。","佛说慧根，比丘欲见，当在四谛。为有四轮：好郡县居轮、依慧人轮、自本正愿轮、宿命有福轮。彼为道德共居相，是为好郡县居，令得贤者依止处，以得道德依猗相，是为依慧人。从是为堕有正愿处，以得正愿相，是为身正愿，令堕福处。从清净行有所入相，是名为福，令致堕五乐处。","彼为戒法十一本：一为色持戒无悔，二为已不悔令得喜意，三为已有喜令爱生，四为已意得爱为身得猗，五为已身得猗便得乐，六为已意得乐便得正止，七为已意得正止便知如有，八为已知如有便寂然，九为已寂然便得离，十为已得离便得解脱，十一为已得解脱便见慧。有慧便知生死已尽，道𧗪已毕，所作𧗪已竟，不复还受苦。","戒相为何等？至命尽持戒，令从是致无悔。身不增罪相为无悔，从是致喜令得喜处。可意相为喜，令致爱处。喜足相为处，令致有猗处。从𧗪为是为得猗相，令致乐处。已无𤺙为乐相，令从是致定处。意随使不忘为定相，令致如有慧处不惑；如有相随相，是为寂然处。若知非身是为寂然相，令从是致相别离处。不近会为相别离，为从是致解脱。已为非法𧗪不受殃，是为解脱相，令致解脱慧见。","为有四道德地，何等为四？为四行者福。彼若如有知智，是为见地；为得道迹，是为得道福；彼如有如有知是为恶却离，是名为薄地，为有往来福；彼以恶却为不用，是名为相离地；彼已相离，是为不复还福，是名为欲竟地，无所著。","亦𧗪者福是何义？为道弟子有八种道𧗪，是名为𧗪者。为是是福，是故名为𧗪者福。何以故？为𧗪清净为名，是为清净福，是为道德。有八种清净道𧗪，为是是福，是故名为清净福。","彼为应得道迹，云何已谛相应道，弟子便断三缚结？彼为三缚结为何等？一为知身非身，二为无疑，三为不贸易𧗪戒。已断是三缚结，道弟子便堕道迹，不复堕恶道、毕竟道七更天上，亦人间已更，所在往来便断苦，从苦得解，是名为见地，为得道迹福。","彼何等为令意堕是身，亦知是身？痴为以不闻，为世间人不见觉者，亦不从闻者、受教戒闻者，亦为未分别。现正法为意念，是色为身。遍覩色为身，是色亦为身，色亦是我身，痛想𧗪识，亦如上说。已如是得观，便受五乐，令为受是身，为堕身，令意念我为是，我为以是著，相连不得自在，牵相随如是有所忍，所可为意为可受，已受见随𧗪，是为邪见，堕受是身。","彼为见是五邪，令堕疑无有。何等为五？若为所色为见，是身比前，更、想、行、识亦尔，是为五邪见，令堕无有。后有余十五，令堕常。如是见是身已断，便六十二邪见已舍；令不堕常、非常。已非常、常为舍，便道弟子无倒邪见，但为度世。","直见为何等，令不堕邪见身？若道弟子为闻，为直见，见通经家，为已受度世无为；为已解度世法，不复见是色为身，遍睹色为身。是色亦为身色，色亦是我身，痛想行识已不见，如是便解三结使。何等为三？一为不见是身，二为不恚，三为不疑。","已如是，道弟子为无疑，在佛亦无疑，为信为喜为佛，如是如来、无所著、正觉，慧行已足为乐，为世间已解，无有过，是法驭法随为师，为教天上天下，为佛最上。是得信不疑，为随是法𧗪，为在法无结无疑、为信为喜。","佛说是法，现可学可致，现自更见，已解为慧。为是所贪饥渴相近已断，随已断，空无所应得。爱已坏、已离已尽，为无为。以是第二。","无结、无疑，得法随法𧗪，为同学聚、为无结无疑，已有受有喜。如是受得道弟子，为学聚，正受𧗪为如应受。戒已立，定已定，慧已得解脱，已成解脱慧，已现已致，是为佛弟子𧗪者。","聚为四人，从𧗪四双，名为八人道𧗪。为世间所重所尊，为无有比，可祠可事可恭，为福地无过，是天亦人所事，是为第三。","已为无疑法，随法𧗪一切𧗪为苦。已无疑结，已受已喜，从爱为习，苦亦从爱习。已无疑结、已受已解，已喜已爱尽，是为苦尽；便无疑无结，已得是受，便得喜已爱尽，是为苦尽。无疑结，已解受便得喜，为八种道𧗪。","从是受𧗪令苦尽，便不疑，不疑不复结，堕解得喜。","若本有疑不解，在佛不解，在法不解，在𧗪者聚；若本有疑，在苦在习、在尽在道，𧗪所惑所不解，随志所疑惑。是如是云何是疮？为是已解本已断，树不复住，已散不复现，从来本法不复生。","彼持𧗪戒转摸贸为二辈：一为渴爱堕，二为不解避。持𧗪戒转摸贸，为意向从是𧗪戒摄守，从是当为得天亦天比，当为天上，彼字为甲，玉女当为是俱相乐共居。如是望，如是可，如是思，结相见意向，是为渴爱。","虽持𧗪戒，为堕摸贸，彼为不解持𧗪戒。转摸贸为何等？戒𧗪者为转贸。戒转贸为何等？为意生从戒得净，从戒得解脱，从戒得要，为从苦乐得度，或意生从愿得度，是为不解持𧗪戒转摸贸。","何因缘为不解转摸贸？意生从被服，亦从愿得度世，从苦乐得却离，为从是二业被服，亦愿为摸。何等为摸？为是二戒被服愿，意计从是得解脱，从是得要，从是得过苦乐，从是苦乐为得无为。从是不正计法，不从是解脱，意计从是解脱，不正计为是正，随是𧗪如是有，忍可意望结见，是从是为解，是为不解持戒转摸贸，是为二结。","得道弟子已舍，为无有本已断。树已拔不复现，从后不复生，是法便为已净。戒如得道戒，随𧗪不为破、不为穿、不为失、不为悔。但有增如，慧者可，无有能夺，为得从是致定，是为三缚结。","道弟子为已断，已堕道迹，不复堕恶法，必度世，在七往来天上亦人中；往来期毕，便得出苦要。","有四相应，何谓四相应？一为已解相应，二为已断舍相应，三为自证相应，四为增满相应。彼道德弟子，从苦为已解相应；从习为已断舍相应；从尽为自证相应；从道为增满相应。彼为止观俱随行，一处一时一意。","本来有是有意，令为作四事。何等为四？一为苦，从苦已解为苦相应。二为习，从习已断舍为习相应。三为尽，从尽自证为尽相应。四为道，从道增满令道相应。何以故从苦已解相应？何以故从习已断舍相应？何以故从尽已自证相应？何以故从道已增满相应？为有譬喻。如水中沫行上至竟，为有四𧗪。从是岸边，致度岸边，度就，断脉。是亦如是，止观双俱行，一处一时一意，上要至竟，为成四事。譬如日出，上至竟，为现作四事：致明、坏冥、现色、现竟。譬如船渡，舍是岸边、致渡岸边、致物、断脉。止观亦如是，双发行，为一处一时一意，上要至竟，为作四事：为解苦如应相烛，为断习如应相应，为尽自证如应解相应，为𧗪道要如应相应。何以故？为苦从更解相应；习从断解相应；尽从苦证解相应；道𧗪要解相应。止观亦如是，双相连行，一处一时一意，止要至竟，为𧗪竟四事：为苦更，为习断，为尽自证，为𧗪道满。","譬如然灯烛，上至竟为作四事：为作明、为去冥、为现色、为却疑。止观亦如是，为作四事：为识苦、为断集、为尽自证、为𧗪道满。譬如然灯上至竟，为有四义：为现明、为去冥、为现色、为尽膏炷。止观亦如是，双随行，一处一时一意止至竟，为作四事：为识苦苦相应，为断习习相应，为尽自证尽相应，为𧗪道满道相应。","何以故为识苦苦相应？何以故为断习习相应？何以故为尽自证尽相应？何以故为𧗪道满道相应？为从谁应？为从止观。","何等为应？应云何持？意系观。已意系观，便见五阴苦，彼所意系是为止，已见五阴为苦是为观。","彼所为五阴相近，可发往欲著，愿得相往不舍习所，是已断已尽。止观道亦如是，令是道德四谛，一处一时一意上至竟，为令四谛相应。","如是道，道德弟子为是法相法，已应是名为见地；已得道脉，至道迹跓，为复止观，令是欲恚使缚为复除。得道弟子为往来受，以是𧗪足，已从往来便坏苦本，是为薄地；便已竟往来福已来得在德止；复增止观，令余爱欲恚所使为毕舍，欲恚未毕舍，使结令毕已毕，为得道弟子，便解下五结已毕。","何等为五？一为见身是非，二为解疑，三为不惑不贸戒，四为不望，五为不恚，是为五结。已毕，便得道弟子，不复还世间，彼度世不复还是世间，是名为却地，是为不还福。已致得止不还福，复增翅止观，令为解舍上五结。","何等为五？一为色欲，二为不色欲，三为痴，四为憍慢，五为不解。已上五𧗪足，为已舍五结，便无所著，已度世无有漏，已竟从正得解脱，是为毕地。无所著尚有妙无为，为舍毕已，世间命根尽，亦世间苦尽，不复生苦。彼以为是阴持入已尽寂然，不有阴持入，不相连不复发，是名为已毕无为。为已说谛相应、亦说份相应、亦说地、亦说福说断，说罪说离、说二无为，为一切如是说。佛已更度世毕，若人欲度世，当𧗪是彼。","何等为九次第思惟正定？为四禅，亦无色正四定，亦已尽毕定，为九次第正定。","彼第一禅已舍五种，随正五种。已舍五种为何等？为五盖：一、爱欲，二、瞋恚，三、睡眠，四、不了悔，五、为疑。是为五种。上禅已舍。","彼爱欲盖为何等？爱欲名为所为，五乐爱著，发往可求，随愿发不舍使发起，是名为爱欲盖。","彼瞋恚盖为何等？为若人为发行拕，𤺙恚相恚非法本所使所从起，是名为瞋恚盖。","彼睡瞑盖为何等？睡为身跓、为意跓，为身止、为意止，为身痴、为意痴，为身重、为意重，为身不便、为意不便，为身不使、为意不使，是为睡。瞑为何等？为意相，从令瞑动相动，令不作事，是为瞑。上头为睡，后为瞑，是共名为睡瞑盖。","彼不了悔盖为何等？为身不止。悔为何等？为所念可不可不得悔。是上头为不了，后为悔，是共名为不了悔盖。","彼疑盖为何等？若不信佛、不信法、不信𧗪者聚，不解苦、习、尽、道比，结使亦从发，是名为疑盖。","亦有五疑：有县聚疑、有发教疑、有道分别疑、有欲𧗪定疑、有得道福疑。如是是为说定疑，是为五盖。","盖说为何等？盖为却对，为却一切清净法。却云何？爱欲为却清净，瞋恚为却等意，睡为却止，瞑为却精进，五乐为却𧗪亦止，结为却不悔，疑为却慧，不知本从起，为却解明。"],source:"https://cbetaonline.dila.edu.tw/zh/T15n0603",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T15/T15n0603.xml",sourceLabel:"CBETA T15n0603",scope:"全2卷正文（不含序跋、目录、附录）",originalTitle:"陰持入經",juan:[1,2]},{id:"cbeta-t15n0614",title:"坐禅三昧经",subtitle:"坐禅三昧经 · 姚秦 鸠摩罗什译",paragraphs:[`导师说难遇，　闻者喜亦难；
大人所乐听，　小人所恶闻。
众生可愍伤，　坠老死崄路；
野人恩爱奴，　处畏痴不惧。
世界若大小，　法无有常者；
一切不久留，　暂现如电光。
是身属老死，　众病之所归；
薄皮覆不净，　愚惑为所欺。
汝常为老贼，　吞灭盛壮色；
如华鬘枯朽，　毁败无所直。
顶生王功德，　共释天王坐；
报利福弘多，　今日悉安在？
此王天人中，　欲乐具为最；
死时极苦痛，　以此可悟意。
诸欲初软乐，　后皆成大苦；
亦如怨初善，　灭族祸在后。
是身为秽器，　九孔常流恶；
亦如那利疮，　绝治于医药。
骨车力甚少，　筋脉缠识转；
汝以为妙乘，　忍著无羞耻。
死人所聚处，　委弃满塜间；
生时所保惜，　死则皆弃捐。
常当念如是，　一心观莫乱；
破痴倒黑暝，　执炬以明观。
若舍四念止，　心无恶不造；
如象逸无钩，　终不顺调道。
今日营此业，　明日造彼事；
乐著不观苦，　不觉死贼至。
怱怱为己务，　他事亦不闲；
死贼不待时，　至则无脱缘。
如鹿渴赴泉，　已饮方向水；
猎师无慈惠，　不听饮竟杀。
痴人亦如是，　懃修诸事务；
死至不待时，　谁当为汝护？
人心期富贵，　五欲情未满；
诸大国王辈，　无得免此患。
仙人持呪箭，　亦不免死生；
无常大象蹈，　蚁蛭与地同。
且置一切人，　诸佛正真觉；
越度生死流，　亦复不常在。
以是故当知，　汝所可爱乐；
悉应早舍离，　一心求涅槃。
后舍身死时，　谁当证知我；
复得遇法宝，　及以不遇者。
久久佛日出，　破大无明暝；
以放诸光明，　示人道非道。
我从何所来？　从何处而生？
何处得解脱？　此疑谁当明？
佛圣一切智，　久远乃出世；
一心莫放逸，　能破汝疑结。
彼不乐实利，　好著弊恶心；
汝为众生长，　当求实法相。
谁能知死时，　所趣从何道？
譬如风中灯，　不知灭时节。
至道法不难，　大圣指事说；
说智及智处，　此二不假外。
汝若不放逸，　一心常行道；
不久得涅槃，　第一常乐处。
利智亲善人，　尽心敬佛法；
厌秽不净身，　离苦得解脱。
闲静修寂志，　结跏坐林间；
捡心不放逸，　悟意觉诸缘。
若不厌有中，　安睡不自悟；
不念世非常，　可畏而不惧。
烦恼深无底，　生死海无边；
度苦舡未办，　安得乐睡眠？
是以当觉悟，　莫以睡覆心。
于四供养中，　知量知止足，
大怖俱未免，　当宜懃精进；
一切苦至时，　悔恨无所及。
衲衣树下坐，　如所应得食；
勿为贪味故，　而自致毁败。
食过知味处，　美恶都无异；
爱好生忧苦，　是以莫造爱。
行业世界中，　美恶无不更；
一切已具受，　当以是自抑。
若在畜兽中，　唌草为具味；
地狱吞铁丸，　燃热剧迸铁。
若在薜荔中，　脓吐火粪屎；
涕唾诸不净，　以此为上味。
若在天宫殿，　七宝宫观中；
天食苏陀味，　天女以娱心。
人中务贵处，　七馔备众味；
一切曾所更，　今复何以爱？
往返世界中，　厌更苦乐事；
虽未得涅槃，　当懃求此利。`,"学禅之人初至师所，师应问言：「汝持戒净不？非重罪恶邪不？」若言：「五众戒净，无重罪恶邪。」次教道法。若言：「破戒。」应重问言：「汝破何戒？」若言：「重戒。」师言：「如人被截耳鼻不须照镜，汝且还去，精懃诵经，劝化作福，可种后世道法因缘，此生永弃。譬如枯树，虽加溉灌不生华叶及其果实。」若破余戒，是时应教如法忏悔。若已清净，师若得天眼、他心智，即为随病说趣道之法；若未得通，应当观相，或复问之：「三毒之中何者偏重？婬欲多耶！瞋恚多耶！愚痴多耶！」","云何观相？若多婬相：为人轻便，多畜妻妾，多语多信，颜色和悦，言语便易，少于瞋恨，亦少愁忧。多能技术，好闻多识，爱著文颂，善能谈论，能察人情，多诸畏怖。心在房室，好著薄衣，渴欲女色，爱著卧具，服饰香华，心多柔软，能有怜愍，美于言语，好修福业，意乐生天，处众无难。别人好丑，信任妇女，欲火炽盛，心多悔变，憙自庄饰，好观彩画，悭惜己物，侥幸他财，好结亲友，不憙独处。乐著所止，随逐流俗，乍惊乍惧，志如猕猴，所见浅近，作事无虑，轻忘所为，趣得适意，憙啼憙哭。身体细软，不堪寒苦，易阻易悦，不能忍事，少得大喜，少失大忧，自发伏匿。身温汗臭，薄肤细发，多皱多白，剪爪治须，白齿趣行，憙洁净衣。学不专一，好游林苑，多情多求，意著常见。附近有德，先意问讯，憙用他语，强颜耐辱，闻事速解，所为事业，分别好丑，愍伤苦厄，自大好胜，不受侵𣣋，憙行施惠，接引善人，得美饮食，与人共之，不存近细，志在远大，眼著色欲，事不究竟，无有远虑。知世方俗，观察颜色，逆探人心，美言辩慧，结友不固，头发稀踈，少于睡眠，坐卧行立，不失容仪。所有财物，能速救急，寻后悔惜，受义疾得，寻复憙忘。惜于举动，难自改变，难得离欲，作罪轻微。如是种种是婬欲相。","瞋恚人相：多于忧恼，卒暴怀忿，身口麁䵃，能忍众苦，触事不可，多愁少欢，能作大恶，无怜愍心，憙为鬪讼。颜貌毁悴，皱眉眄睐，难语难悦，难事难可。其心如疮，面宣人阙，义论强梁，不可折伏，难可倾动，难亲难沮，含毒难吐。受诵不失，多能多巧，心不懒堕，造事疾速，持望不语，意深难知。受恩能报，有能聚众，自伏事人，不可沮败，能究竟事，难可干乱，少所畏难，譬如师子，不可屈伏，一向不回，直造直进。忆念不忘，多虑思惟，诵习忆持，能多施与，小利不回，为师利根。离欲独处，少于婬欲，心常怀胜，爱著断见，眼常恶视。真实言语，说事分了，少于亲友，为事坚著，坚忆不忘，多于筋力，肩胸姝大，广额齐发。心坚难伏，疾得难忘，能自离欲，憙作重罪。如是种种，是瞋恚相。","愚痴人相：多疑多悔，懒堕无见，自满难屈，憍慢难受，可信不信，非信而信。不知恭敬，处处信向，多师轻躁，无羞搪突，作事无虑，反教浑戾。不择亲友，不自修饰，好师异道，不别善恶，难受易忘，钝根懈怠。诃谤行施，心无怜愍，破坏法桥，触事不了，瞋目不视，无有智巧，多求悕望，多疑少信。憎恶好人，破罪福报，不别善言，不能解过，不受诲喻，亲离憎怨，不知礼节，憙作恶口。须发爪长，齿衣多垢，为人驱役，畏处不畏，乐处而忧，忧处而喜，悲处反笑，笑处反悲，牵而后随，能忍苦事，不别诸味，难得离欲，为罪深重。如是种种，是愚痴相。","若多婬欲人，不净法门治；若多瞋恚人，慈心法门治；若多愚痴人，思惟观因缘法门治；若多思觉人，念息法门治；若多等分人，念佛法门治。诸如是等种种病，种种法门治。","第一治贪欲法门","婬欲多人习不净观，从足至发不净充满，发毛爪齿、薄皮厚皮、血肉筋脉、骨髓肝肺、心脾肾胃、大肠小肠、屎尿洟唾、汗泪垢坋、脓脑胞胆、水微肤、脂肪脑膜，身中如是种种不净。复次不净观者：观青瘀膖胀、破烂血流、涂漫臭脓、噉食不尽、骨散烧焦，是谓不净观。","复次多婬人有七种爱：或著好色、或著端正、或著仪容、或著音声、或著细滑、或著众生、或都爱著。若著好色，当习青瘀观法，黄赤不净色等亦复如是！若著端正，当习膖胀身散观法；若著仪容，当观新死血流涂骨观法；若著音声，当习咽塞命断观法；若著细滑，当习骨见及干枯病观法；若爱众生，当习六种观；若都爱著，一切遍观，或时作种种更作异观。是名不净观。","问曰：「若身不净如臭腐尸者，何从生著？」","若著净身，臭腐烂身亦当应著；若不著臭身，净身亦应不著。二身等故。若求二实，净俱不可得，人心狂惑为颠倒所覆，非净计净。若倒心破，便得实相法观，便知不净虚诳不真。复次死尸，无火无命无识、无有诸根，人谛知之，心不生著；以身有暖、有命有识、诸根完具，心倒惑著。复次，心著色时谓以为净，爱著心息即知不净。若是实净应当常净，而今不然。如狗食粪谓之为净，以人观之甚为不净，是身内外无一净处。若著身外，身外薄皮举身取之，才得如㮈是亦不净，何况身内三十六物？复次，推身因缘种种不净，父母精血不净合成，既得为身常出不净，衣服床褥亦臭不净，何况死处？以是当知，生死内外都是不净（此下经本至二门初）。","复次，观亦有三品：或初习行、或已习行、或久习行。若初习行，当教言作破皮想，除却不净，当观赤骨人，系意观行，不令外念；外念诸缘，摄念令还。若已习行，当教言想却皮肉，尽观头骨，不令外念；外念诸缘，摄念令还。若久习行，当教言身中一寸心却皮肉，系意五处：顶、额、眉间、鼻端、心处。如是五处住意观骨，不令外念；外念诸缘，摄念令还，常念观心，心出制持。","若心疲极，住念所缘，舍外守住。譬如猕猴被系在柱，极乃住息。所缘如柱，念如绳锁，心喻猕猴。亦如乳母，常观婴儿不令堕落。行者观心亦复如是，渐渐制心令住缘处。","若心久住是应禅法，若得禅定即有三相：身体和悦柔软轻便，白骨流光犹如白珂，心得静住。是为观净。是时便得色界中心，是名初学禅法得色界心。心应禅法即是色界法，心得此法，身在欲界，四大极大，柔软快乐，色泽净洁，光润和悦，谓悦乐。二者、向者骨观白骨相中，光明遍照净白色。三者、心住一处是名净观，除肉观骨故名净观。如上三相皆自知之，他所不见。上三品者，初习行，先未发意；已习行，三四身修；久习行，百年身学。","第二治瞋恚法门","若瞋恚偏多，当学三种慈心法门：或初习行、或已习行、或久习行。","若初习行者，当教言慈及亲爱。云何亲及愿与亲乐？行者若得种种身心快乐，寒时得衣，热时得凉，饥渴得饮食，贫贱得富贵，行极时得止息，如是种种乐愿亲爱得，系心在慈不令异念；异念诸缘，摄之令还。若已习行，当教言慈及中人。云何及中人而与乐？行者若得种种身心快乐，愿中人得，系心在慈，不令异念；异念诸缘，摄之令还。若久习行，当教言慈及怨憎。云何及彼而与其乐？行者若得种种身心快乐，愿怨憎得，得与亲同，同得一心，心大清净，亲中怨等，广及世界，无量众生，皆令得乐，周遍十方，靡不同等。大心清净，见十方众生皆如自见，在心目前，了了见之，受得快乐，是时即得慈心三昧。","问曰：「亲爱中人愿令得乐，怨憎恶人云何怜愍复愿与乐？」","答曰：「应与彼乐。所以者何？其人更有种种好清净法因，我今云何岂可以一怨故而没其善？复次思惟：『是人过去世时或是我亲善，岂以今瞋更生怨恶？我当忍彼，是我善利。』又念行法，仁德含弘，慈力无量，此不可失。复思惟言：『若无怨憎何因生忍？生忍由怨，怨则我之亲善。』复次瞋报最重，众恶中上无有过是，以瞋加物其毒难制，虽欲烧他实是自害。复自念言：『外被法服，内习忍行，是谓沙门，岂可恶声纵此变色憋心？复次，五受阴者，众苦林薮受恶之的，苦恼恶来何由可免？如刺刺身，苦刺无量，众怨甚多，不可得除，当自守护，著忍革屣。』如佛言曰：",`「『以瞋报瞋，　瞋还著之；　瞋恚不报，
能破大军。　能不瞋恚，　是大人法；
小人瞋恚，　难动如山。　瞋为重毒，
多所残害；　不得害彼，　自害乃灭。
瞋为大瞑，　有目无覩；　瞋为尘垢，
染污净心。　如是瞋恚，　当急除灭；
毒蛇在室，　不除害人。』　如是种种，
瞋毒无量；　当习慈心，　除灭瞋恚。
是为慈三昧门。」`,"第三治愚痴法门","若愚痴偏多，当学三种思惟法门：或初习行、或已习行、或久习行。","若初习行，当教言生缘老死，无明缘行。如是思惟，不令外念；外念诸缘，摄之令还。若已习行，当教言行缘识、识缘名色、名色缘六入、六入缘触、触缘受、受缘爱、爱缘取、取缘有。如是思惟，不令外念；外念诸缘，摄之令还。若久习行，当教言无明缘行、行缘识、识缘名色、名色缘六入、六入缘触、触缘受、受缘爱、爱缘取、取缘有、有缘生、生缘老死。如是思惟，不令外念；外念诸缘，摄之令还。","问曰：「一切智人是有明，一切余人是无明，是中云何无明？」","答曰：「无明名一切不知。此中无明能造后世有，有者无、无者有，弃诸善、取诸恶，破实相、著虚妄。如〈无明相品〉中说：",`「『不明白益法，　不知道德业；
而作结使因，　如火钻燧生。
恶法而心著，　远弃于善法；
夺众生明贼，　去来明亦劫。
常乐我净想，　计于五阴中；
苦习尽道法，　亦复不能知。
种种恼险道，　盲人入中行；
烦恼故业集，　业故苦流回。
不应取而取，　应取而反弃；
驰暗逐非道，　蹴株而躃地。
有目而无慧，　其喻亦如是，
是因缘灭故，　智明如日出。』`,"「如是略说，无明乃至老死亦如是。」","问曰：「佛法中因缘甚深，云何痴多人能观因缘？」","答曰：「二种痴人：一、如牛羊；二、种种邪见、痴惑暗蔽，邪见痴人。佛为此说，当观因缘以习三昧。」","第四治思觉法门","若思觉偏多，当习阿那般那三昧法门。有三种学人：或初习行、或已习行、或久习行。若初习行，当教言一心念数，入息出息，若长若短，数一至十。若已习行，当教言数一至十，随息入出，念与息俱，止心一处。若久习行，当教言数、随、止、观、转观、清净。阿那般那三昧，六种门十六分，云何为数？一心念入息，入息至竟数一，出息至竟数二。若未竟而数为非数，若数二至九而误，更从一数起。譬如算人，一一为二、二二为四、三三为九。","问曰：「何以故数？」","答曰：「无常观易得故、亦断诸思觉故、得一心故。身心生灭无常，相似相续难见；入息出息生灭无常，易知易见故。复次，心系在数，断诸思诸觉。思觉者：欲思觉、恚思觉、恼思觉、亲里思觉、国土思觉、不死思觉。欲求净心入正道者，先当除却三种麁思觉，次除三种细思觉，除六觉已，当得一切清净法。譬如采金人，先除麁石砂，然后除细石砂，次第得细金砂。」","问曰：「云何为麁病？云何为细病？」","答曰：「欲、瞋、恼觉是三名麁病；亲里、国土及不死觉是三名细病，除此觉已，得一切清净法。」","问曰：「未得道者结使未断，六思觉强从心生乱，云何能除？」","答曰：「心厌世间，正观能遮而未能拔，后得无漏道，能拔结使根本。何谓正观？",`「见多欲人求欲苦，　得之守护是亦苦；
失之忧恼亦大苦，　心得欲时无满苦。
欲无常空忧恼因，　众共有此当觉弃；
譬如毒蛇入人室，　不急除之害必至。
不定不实不贵重，　种种欲求颠倒乐；
如六神通阿罗汉，　教诲欲觉弟子言：
『汝不破戒戒清净，　不共女人同室宿；
欲结毒蛇满心室，　缠绵爱喜不相离。
既知身戒不可毁，　汝心常共欲火宿；
汝是出家求道人，　何缘纵心乃如是？
父母生养长育汝，　宗亲恩爱共成就；
咸皆涕泣恋惜汝，　汝能舍离不顾念？
而心常在欲觉中，　共欲嬉戏无厌心；
常乐欲火共一处，　欢喜爱乐不暂离。』`,"「如是种种呵欲觉，如是种种正观除欲觉。」","问曰：「云何灭瞋恚觉？」","答曰：",`「从胎中来生常苦，　是中众生莫瞋恼；
若念瞋恼慈悲灭，　慈悲瞋恼不相比。
汝念慈悲瞋恼灭，　譬如明暗不同处；
若持净戒念瞋恚，　是人自毁破法利。
譬如诸象入水浴，　复以泥土涂坌身；
一切常有老病死，　种种鞭笞百千苦。
云何善人念众生，　而复加益以瞋恼？
若起瞋恚欲害彼，　未及前人先自烧；
是故常念行慈悲，　瞋恼恶念内不生。
若人常念行善法，　是心常习佛所念；
是故不应念不善，　常念善法欢乐心。
今世得乐后亦然，　得道常乐是涅槃；
若心积聚不善觉，　自失己利并害他。
是谓不善彼我失，　他有净心亦复没；
譬如阿兰若道人，　举手哭言贼劫我。`,"「有人问言谁劫汝？答言财贼我不畏，我不聚财求世利，谁有财贼能侵我？我集善根诸法宝，觉观贼来破我利；财贼可避多藏处，劫善贼来无处避。如是种种呵瞋恚，如是种种正观除瞋恚觉。」","问曰：「云何除恼觉？」",`答曰：「众生百千种，　诸病更互恒来恼；
死贼捕伺常欲杀，　无量众苦自沉没。
云何善人复加恼，　谗谤谋害无慈仁？
未及伤彼被殃身。　俗人起恼是可恕，
此事世法恶业因，　亦不自言我修善。
求清净道出家人，　而生瞋恚怀嫉心；
清冷云中放毒火，　当知此恶罪极深。
阿兰若人兴嫉妬，　有阿罗汉他心智，
教诫苦责汝何愚，　嫉妬自破功德本？
若求供养当自集，　诸功德本庄严身；
若不持戒禅多闻，　虚假染衣坏法身；
实是乞儿弊恶人，　云何求供养利身？
饥渴寒热百千苦，　众生常困此诸恼；
身心苦厄无穷尽，　云何善人加诸恼？
譬如病疮以针刺，　亦如狱囚考未决；
苦厄缠身众恼集，　云何慈悲更令剧？`,"「如是种种呵恼觉，如是种种正观除恼觉。」","问曰：「云何除亲里觉？」","答曰：「应如是念：世界生死中自业缘牵，何者是亲，何者非亲？但以愚痴故，横生著心计为我亲，过去世非亲为亲，未来世非亲为亲，今世是亲过去非亲。譬如鸟栖，暮集一树，晨飞各随缘去。家属亲里亦复如是，生世界中，各各自异心，缘会故亲，缘散故踈，无有定实，因缘果报，共相亲近。譬如干沙，缘手团握，缘捉故合，缘放故散。父母养子，老当得报，子蒙怀抱养育故应报，若顺其意则亲，若逆其意是贼。有亲不能益而反害，有非亲无损而大益，人以因缘故而生爱，爱因缘故而更断。譬如画师作妇女像还自爱著，此亦如是，自生染著，染著于外。过去世中汝有亲里，今世于汝复何所作？汝亦不能益过去亲，过去亲不益汝，两不相益，空念之为是亲非亲，世界中不定无边。如阿罗汉教新出家恋亲弟子言：『如恶人吐食更欲还噉，汝亦如是！汝已得出家，何以还欲爱著，是剃发染衣、是解脱相？汝著亲里不得解脱，还为爱所系，三界无常流转不定，若亲非亲，虽今亲里久久则灭，如是十方众生回转，亲里无定是非我亲。』人欲死时无心无识，直视不转，闭气命绝如堕暗坑，是时亲里家属安在？若初生时先世非亲，今强和合作亲，若当死时复非亲，如是思惟，不当著亲。如人儿死，一时三处父母俱时啼哭，诳天上父母妻子，人中亦为诳，龙中父母亦为诳，如是种种正观除亲里觉。」","问曰：「云何除国土觉？」","答曰：「行者若念是国土，丰乐安隐多诸好人，恒为国土觉绳所牵，将去罪处。觉心如是，若有智人不应念著。何以故？国土种种过罪所烧时节转故，亦有饥饿身疲极故，一切国土无常安者。复次，老病死苦无国不有，从是间身苦去、得彼处身苦，一切国土去无不苦。假有国土安隐丰乐，而有结恼心生苦患，是非好国土；能除杂恶国土、能薄结使令心不恼，是谓好国土。一切众生有二种苦：身苦。心苦。常有苦恼，无有国土无此二恼。复次有国土大寒，有国土大热，有国土饥饿，有国土多病，有国土多贼，有国土王法不理。如是种种国土之恶心不应著，如是正观除国土觉。」","问曰：「云何除不死觉？」","答曰：「应教行者，若好家生、若种族子，才技力势胜人，一切莫念。何以故？一切死时，不观老少贵贱、才技力势。是身是一切忧恼诸因缘，因自见少多寿，若得安隐，是为痴人。何以故？是谓忧恼因。依是四大、四大造色，如四毒蛇共不相应，谁得安隐者？出息期入，是不可信。复次人睡时欲期必觉，是事难信。受胎至老，死事恒来，求死时节言常不死，云何可信？譬如杀贼，拔刀、注箭常求杀人，无怜愍心。人生世间死力最大，一切无胜死力强者，若过去世第一妙人无能脱此死者，现在亦无大智人能胜死者，亦非软语求、非巧言诳可得避脱；亦非持戒精进能却此死。以是故当知，人常危脆不可怙恃，莫信计常我寿久活，是诸死贼常将人去，不付老竟然后当杀。","「如阿罗汉教诸觉所恼弟子言：『汝何以不知厌世入道？何以作此觉？有人未生便死，有生时死者，有乳𫗦时、有断乳时、有小儿时、有盛壮时、有老时，一切时中，间死法界。譬如树华，华时便堕，有果时堕，有未熟时堕。是故当知，勤力精进求安隐道，大力贼共住不可信。此贼如虎巧覆藏身，如是死贼常求杀人。』","「世界所有空如水泡，云何当言待时入道？何谁能证言汝必老可得行道？譬如崄岸大树上有大风，下有大水崩其根土，谁当信此树得久住者？人命亦如是，少时不可信。父如谷子，母如好田，先世因缘罪福如雨泽，众生如谷，生死如收刈。种种诸天子人王智德，如天王佐天鬪破诸阿须伦军，种种受乐，极高大明，还没在黑暗。以是故，莫信命活，言我今日当作此，明后当作是。如是正观种种，除不死觉。","「如是先除麁思觉，却后除细思觉，心清净生得正道，一切结使尽，从是得安隐处，是谓出家果。心得自在，三业第一清净，不复受胎，读种种经多闻，是时得报果。如是得时，不空破魔王军，便得第一勇猛名称。世界中烦恼将去，是不名健；能破烦恼贼，灭三毒火，凉乐清净，涅槃林中安隐高枕，种种禅定、根、力、七觉，清风四起，顾念众生没三毒海，德妙力如是，乃名为健。如是等散心，当念阿那般那，学六种法断诸思觉，以是故念数息。」","问曰：「若余不净、念佛、四等观中，亦得断思觉，何以故独数息？」","答曰：「余观法宽难失故，数息法急易转故。譬如放牛，以牛难失故，守之少事，如放猕猴易失故，守之多事，此亦如是！数息心数不得少时他念，少时他念则失数，以是故初断思觉应数息。」","已得数法，当行随法，断诸思觉，入息至竟，当随莫数一；出息至竟，当随莫数二。譬如负债人，债主随逐，初不舍离。如是思惟是入息，是还出更有异？出息是还入，更有异？是时知入息异、出息异。何以故？出息暖、入息冷。","问曰：「入出息是一息。何以故？出息还更入故。譬如含水水暖，吐水水冷，冷者还暖，暖者还冷故。」","答曰：「不尔！内心动故有息出，出已即灭。鼻口引外则有息入，入故息灭，亦无将出亦无将入。复次，少、壮、老人，少者入息长，壮者入出息等，老者出息长，是故非一息。复次，脐边风发相似相续，息出至口鼻边，出已便灭。譬如𭬽囊中风，开时即灭。若以口鼻因缘引之则风入，是从新因缘边生。譬如扇，众缘合故则有风。是时知入出息因缘，而有虚诳不真、生灭无常。如是思惟，出息从口鼻因缘引之而有，入息因缘心动令生，而惑者不知以为我息。」","息者是风，与外风无异，地、水、火、空亦复如是！是五大因缘合故生识，识亦如是，非我有也！五阴、十二入、十八持亦复如是！如是知之，逐息入息出，是以名随。","已得随法当行止法。止法者，数随心极，住意风门，念入出息。","问曰：「何以故止？」","答曰：「断诸思觉故，心不散故。数随息时，心不定、心多剧故；止则心闲少事故，心住一处故。」","念息出入，譬如守门人门边住，观人入出。止心亦尔！知息出时，从脐、心、胸、咽至口、鼻。息入时从口、鼻、咽、胸、心至脐。如是系心一处，是名为止。","复次心止法中住观。入息时五阴生灭异，出息时五阴生灭异，如是心乱便除却，一心思惟令观增长，是名为观法。","舍风门住离麁观法，离麁观法知息无常，此名转观。观五阴无常，亦念入息出息生灭无常。见初头息无所从来，次观后息亦无迹处，因缘合故有，因缘散故无，是名转观法。","除灭五盖及诸烦恼，虽先得止观，烦恼不净心杂，今此净法心独得清净。复次，前观异学相似行道念息入出，今无漏道相似行善有漏道，是谓清净。复次，初观身念止分，渐渐一切身念止，次行痛心念止，是中非清净，无漏道远故。今法念止中，观十六行念入出息，得煖法、顶法、忍法、世间第一法，苦法忍乃至无学尽智，是名清净。","是十六分中，初入息分六种安那般那行，出息分亦如是！一心念息入出若长若短，譬如人怖走上山，若担负重、若上气，如是比是息短；若人极时得安息欢喜，又如得利、从狱中出，如是为息长。一切息随二处：若长、若短处，是故言息长息短。是中亦行安那般那六事，念诸息遍身，亦念息出入，悉观身中诸出息入息，觉知遍至身中乃至足指，遍诸毛孔如水入沙；息出觉知从足至发，遍诸毛孔亦如水入沙。譬如𭬽囊入出皆满，口鼻风入出亦尔！观身周遍见风行处，如藕根孔亦如鱼网。复次，非独口鼻观息入出，一切毛孔及九孔中，亦见息入息出。是故知息遍诸身，除诸身行，亦念入出息。","初学息时，若身懈怠、睡眠、体重，悉除弃之！身轻柔软，随禅定心受喜，亦念息入出。除懈怠、睡眠、心重，得心轻柔软，随禅定心受喜。","复次，入息念止中竟，次行痛念止；已得身念止，实今更得痛念止，实受喜。复次已知身实相，今欲知心心数法实相，是故受喜亦念息入出，受乐亦念息入出，是喜增长名为乐。复次，初心中生悦是名喜，后遍身喜是名乐。复次，初禅、二禅中乐痛名喜，三禅中乐痛名受乐。受诸心行，亦念息入出。诸心生灭法、心染法心不染法、心散法心摄法、心正法心邪法，如是等诸心相名为心行。心作喜时亦念息入出——先受喜自生，不故作念，心故作喜。","问曰：「何以故故作喜？」","答曰：「欲治二种心：或散心、或摄心。如是作心，得出烦恼，是故念法，心作喜。」","复次，若心不悦，劝勉令喜。心作摄时，亦念息入出——设心不定，强伏令定。如经中说：「心定是道，心散非道。」心作解脱时，亦念息入出——若意不解，强伏令解。譬如羊入苍耳，苍耳著身，人为渐渐出之。心作解脱诸烦恼结，亦复如是！是名心念止作解脱。","观无常亦念息入出——观诸法无常、生灭、空、无吾我，生时诸法空生，灭时诸法空灭，是中无男、无女、无人、无作、无受，是名随无常观。","观有为法出散亦念息入出——无常是名出散。诸有为法现世中出，从过去因缘和合故集、因缘坏故散——如是随观，是名出散观。","观离欲结亦念息入出——心离诸结，是法第一，是名随离欲观。","观尽亦念息入出——诸结使苦在在处尽，是处安隐，是名随尽观。","观弃舍亦念息入出，诸染爱烦恼身心五阴诸有为法弃舍，是第一安隐。如是观是名随法意止观，是名十六分。","第五治等分法门","第五法门治等分行，及重罪人求索佛，如是人等当教一心念佛三昧。念佛三昧有三种人：或初习行、或已习行、或久习行。","若初习行人，将至佛像所，或教令自往谛观佛像相好，相相明了，一心取持。还至静处，心眼观佛像，令意不转，系念在像，不令他念；他念摄之，令常在像。若心不住，师当教言：「汝当责心：『由汝受罪，不可称计，无际生死，种种苦恼，无不更受。若在地狱，吞饮洋铜，食烧铁丸；若在畜生，食粪噉草；若在饿鬼，受饥饿苦；若在人中，贫穷困厄；若在天上，失欲忧恼。常随汝故，令我受此种种身恼心恼、无量苦恼。今当制汝，汝当随我。我今系汝一处，我终不复为汝所困更受苦毒也。汝常困我，我今要当以事困汝。』」如是不已，心不散乱，是时便得心眼见佛像相光明，如眼所见无有异也。如是心住，是名初习行者思惟。","是时当更念言：「是谁像相？则是过去释迦牟尼佛像相。如我今见佛形像，像亦不来我亦不往。」如是心想见过去佛，初降神时震动天地。有三十二相大人相：一者、足下安平立。二者、足下千辐轮。三者、指长好。四者、足跟广。五者、手足指合缦网。六者、足趺高平好。七者、伊尼延鹿𨄔。八者、平住手过膝。九者、阴马藏相。十者、尼俱卢陀身。十一者、一一孔一一毛生。十二者、毛生上向而右旋。十三者、身色胜上金。十四者、身光面一丈。十五者、皮薄好。十六者、七处满。十七者、两腋下平好。十八者、上身如师子。十九者、身大好端直。二十者、肩圆好。二十一者、四十齿。二十二者、齿白齐密等而根深。二十三者、四牙白而大。二十四者、颊方如师子。二十五者、味中得上味。二十六者、舌大广长而薄。二十七者、梵音深远。二十八者、迦兰频伽声。二十九者、眼绀青色。三十者、眼𥇒如牛王。三十一者、顶发肉骨成。三十二者、眉间白毛长好右旋。","复次八十种小相：一者、无见顶。二者、鼻直高好孔不现。三者、眉如初生月绀琉璃色。四者、耳好。五者、身如那罗延。六者、骨际如钩锁。七者、身一时回如象王。八者、行时足去地四寸而印文现。九者、爪如赤铜色薄而润泽。十者、膝圆好。十一者、身净洁。十二者、身柔软。十三者、身不曲。十四者、指长圆纤。十五者、指纹如画杂色庄严。十六者、脉深不现。十七者、踝深不现。十八者、身润光泽。十九者、身自持不委陀。二十者、身满足（三月受胎二月生）。二十一者、容仪备足。二十二者、住处安（如牛王立不动）。二十三者、威振一切。二十四者、一切乐观。二十五者、面不长。二十六者、正容貌不挠色。二十七者、唇如频婆果色。二十八者、面圆满。二十九者、响声深。三十者、脐圆深不出。三十一者、毛处处右旋。三十二、者手足满。三十三者、手足如意（旧言内外握者是）。三十四者、手足文明直。三十五者、手文长。三十六者、手文不断。三十七者、一切恶心众生见者皆得和悦色。三十八者、面广姝。三十九者、面如月。四十者、众生见者不怖不惧。四十一者、毛孔出香风。四十二者、口出香气众生遇者乐法七日。四十三者、仪容如师子。四十四者、进止如象王。四十五者、行法如鹅王。四十六者、头如磨陀罗果（此果不圆不长）。四十七者、声分满足（声有六十种分，佛皆具足）。四十八者、牙利。四十九者、（无汉名故不得出也）。五十者、舌大而赤。五十一者、舌薄。五十二者、毛纯红色色净洁。五十三者、广长眼。五十四者、孔门满（九孔门相具足满）。五十五者、手足赤白如莲华色。五十六者、腹不见不出。五十七者、不凸腹。五十八者、不动身。五十九者、身重。六十者、大身。六十一者、身长。六十二者、手足满净。六十三者、四边遍大光，光明自照而行。六十四者、等视众生。六十五者、不著教化不贪弟子。六十六者、随众声满不减不过。六十七者、随众音声而为说法。六十八者、语言无碍。六十九者、次第相续说法。七十者、一切众生目不能谛视相知尽。七十一者、视无厌足。七十二者、发长好。七十三者、发好。七十四者、发不乱。七十五者、发不破。七十六者、发柔软。七十七者、发青毘琉璃色。七十八者、发绞上。七十九者、发不稀。八十者、胸有德字手足有吉字。","光明彻照无量世界，初生行七步，发口演要言，出家勤苦行，菩提树下，降伏魔军，后夜初明，成等正觉，光相分明，远照十方，靡不周遍，诸天空中，弦歌供养，散华雨香，一切众生，咸敬无量，独步三界，还顾转身，如象王回，观视道树，初转法轮，天人得悟，以道自证得至涅槃。","佛身如是，感发无量，专心念佛，不令外念；外念诸缘，摄之令还。如是不乱，是时便得见一佛、二佛乃至十方无量世界诸佛色身，以心想故皆得见之，既得见佛又闻说法言。或自请问，佛为说法解诸疑网。既得佛念，当复念佛功德法身，无量大慧，无崖底智，不可计德。多陀阿伽度（多陀秦言如。阿伽度言解，亦言实语，又言诸余圣人安隐道来佛如是来；复次更不来后有中也）　阿犁（鲁迷反）呵（阿犁秦言贼。呵言杀。佛以忍辱为铠、精进为坚牢、禅定为弓、智慧为箭，杀憍慢等贼，故名杀贼）　三藐（无灼反）三佛陀（三藐秦言真实。三佛陀言一切觉。觉苦因习、涅槃因道，正解见四实不可转，了尽无余，故言真实觉一切）　鞞伽（除夜反）遮罗那（鞞伽秦言明。遮罗那言善行。明三明也，行清净之行，以之独成无师大觉，故言明善行也）三般那（秦言满成）　宿伽陀（秦言善解，亦名善自得，又言善说无患）　路伽惫（皮拜反）（路伽秦言智。智者知世因知尽道，故名世智。世智知世也）　阿耨多罗（秦言无上。善法圣智示导一切，大德无量，梵魔众圣莫有及者，何况能过佛尊德大？故言无上）　富楼沙昙藐（富楼沙秦言大丈夫。昙藐言可言、可化丈夫、调御师。佛以大慈大悲大智故，有时软美语、有时苦切语，或以亲教，以此调御令不失道，故名佛为可化丈夫、调御师法也）　舍（赊音）多（都饿反）提婆魔㝹舍喃（奴甘反）（秦言天人师。尽能解脱一切人烦恼，常住不退上法）　佛婆伽婆（过去未来现在，行不行知行尽不尽，一切诸法菩提树下一切了了知，故名佛婆伽婆。言：有大名声。复次婆名女根。婆名吐。永弃女根，故女根吐也）。","尔时，复念二佛神德，三四五佛乃至无量尽虚空界，皆悉如是。复还见一佛，能见一佛作十方佛，能见十方佛作一佛。能令一色作金、银、水精、毘琉璃色，随人意乐悉令见之。","尔时惟观二事：虚空佛身及佛功德，更无异念，心得自在意不驰散，是时得成念佛三昧。","若心驰散念在五尘，若在六觉者，当自勗勉克励其心，强制伏之！如是思惟人身难得、佛法难遇，故曰：「众明日为最、诸智佛为最。」所以者何？佛兴大悲，常为一切故，头目髓脑救济众生，何可放心不专念佛而孤负重恩？若佛不出世，则无人道、天道、涅槃之道；若人香华供养，以骨、肉、血、髓起塔供养，未若行人以法供养得至涅槃。虽然犹负佛恩，设当念佛空无所获，犹应勤心专念不忘，以报佛恩，何况念佛得诸三昧智慧成佛，而不专念？","是故行者常当专心令意不散，既得见佛请质所疑，是名念佛三昧。除灭等分及余重罪。","尔时，行者虽得一心，定力未成，犹为欲界烦恼所乱，当作方便，进学初禅，呵弃爱欲。云何呵弃？观欲界过，欲为不净，种种不善；当念初禅，安隐快乐。","观欲云何知欲无常？功德怨家，如幻如化，空无所得，念之未得，痴心已乱，何况已得，婬欲缠覆？天上乐处，犹不常安，何况人中？人心著欲，无有厌足，如火得薪，如海吞流。如顶生王，虽雨七宝、王四天下、帝释分座，犹不知足。如那睺沙（姓也），转金轮王，为欲所逼，堕蟒蛇中。又如仙人，食果衣草，隐居深山，被发求道，犹复不免，欲贼所坏。欲乐甚少，怨毒甚多。著欲之人，恶友相近，善人踈远。欲为毒酒，愚惑醉死；欲为欺诳，走使愚人，疲苦万端，不得自在。唯有离欲，身心安隐，快乐无极。欲无所得，如狗𫜪枯骨。求欲勤劳，极苦乃得，得之甚难，失之甚易。如假借须臾，势不得久，如梦所见，恍惚即灭。欲之为患，求之既苦，得之亦苦，多得多苦。如火得薪，多益多炽，欲如搏肉，众鸟竞逐。以要言之！如蛾赴火，如鱼吞钩，如鹿逐声，如渴饮咸水。一切众生，为欲致患，无苦不至。是故当知，欲为毒害，当求初禅，灭断欲火。行者一心精懃信乐，令心增进，意不散乱，观欲心厌，除结恼尽，得初禅定；离欲盛火得清凉定，如热得荫，如贫得富。是时便得，初禅喜觉，思惟禅中，种种功德，观分别好丑，便得一心。","问曰：「修行禅人，得一心相，云何可知？」","答曰：「面色悦泽，徐行靖正，不失一心，目不著色，神德定力，不贪名利，击破憍慢，其性柔软，不怀毒害，无复悭嫉，直信心净，论议不诤，身无欺诳，易可与语；柔软惭愧，心常在法，懃修精进，持戒完具，诵经正忆，念随法行，意常喜悦，瞋处不瞋；四供养中，不净不受，净施则受，知量止足；寤起轻利，能行二施，忍辱除邪，论议不自满，言语尠少；谦恪恭敬上中下座，善师善知识常亲近随顺；饮食知节，不著欲味，乐独静处，若苦若乐，心忍不动，无怨无竞，不喜鬪讼。如是等种种相，得知一心相。」","此觉、观二事，乱禅定心，如水澄静，波荡则浊，行者如是，内已一心，觉观所恼，如极得息，如睡得安。是时次第无觉无观，生清净定，内净喜乐，得入二禅。","心静默然，本所不得，今得此喜。是时心观，以喜为患，如上觉观，行无喜法，乃离喜地，得贤圣所说乐，一心谛知念护得入三禅。","已弃喜故，谛知忆念乐护，圣人言乐护，余人难舍，乐中第一，过此以往，无复乐也。是故一切圣人，于一切净地中，说慈为第一乐。乐则是患。所以者何？第一禅中心不动转，以无事故，有动则有转，有转则有苦，是故三禅以乐为患。复以善妙舍此苦乐，先弃忧喜除苦乐意，护念清净得入第四禅。不苦不乐护清净念一心，是故佛言：「护最清净第一，名第四禅。」以第三禅乐动故，名之为苦，是故四禅除灭苦乐，名不动处。","渐观空处，破内外色想，灭有对想，不念种种色想；观无量空处，常观色过；念空处定上妙功德。习念是法，逮得空处。","念无量识处，观空处过，念无量识处功德。习念是法，逮得识处。","念无所有处，观识处过，念无所有处功德。习念是法，便得无所有处。","念非有想非无想处，若一切想其患甚多，若病若疮，若无想，是愚痴处。是故非有想非无想，是第一安隐善处。观无所有处过，念非有想非无想功德，习念是法，便得非有想非无想处。","或有行者！先从初地乃至上地，复于上地习行慈心，先自得乐破瞋恚毒，次及十方无量众生。是时便得慈心三昧。悲心怜愍众生之苦，能破众恼，广及无量众生。是时便得悲心三昧。能破不悦，令无量众生皆得喜悦。是时便得喜心三昧。能破苦乐，直观十方无量众生，是时便得护心三昧。二禅亦复如是，三禅四禅除喜。","次学五通，身能飞行变化自在。行者一心欲定、精进定、一心定、慧定。一心观身，常作轻想，欲成飞行，若大若小（以欲定过为大，以欲定减为小），此二俱患，精进翘懃，常能一心，思惟轻观，如能浮人，心力强故，而不沉没；亦如猿猴，从高上堕，心力强故，身无痛患。此亦如是，欲力、精进力、一心力、慧力，令其广大，而身更小，便能运身。","复次观身空界。常习此观，欲力、精进力、一心力、慧力极为广大，便能举身。如大风力，致重达远，此亦如是！初当自试，离地一尺二尺，渐至一丈，还来本处。如鸟子学飞，小儿学行，思惟自审，知心力大，必能至远。学观四大，除却地大但观三大，心念不散，便得自在，身无罣碍，如鸟飞行。当复学习，远作近想，是故近灭远出。","复能变化诸物，如观木地种，除却余种，此木便变为地。所以者何？木有地种分故。水、火、风、空，金银宝物，悉皆如是。何以故？木有诸种分故。是初神通根本。","四禅有十四变化心：初禅二果：一者、初禅。二者、欲界。二禅三果：一者、二禅。二者、初禅。三者、欲界。三禅四果：一者、三禅。二者、二禅。三者、初禅。四者、欲界。四禅五果：一者、四禅。二者、三禅。三者、二禅。四者、初禅。五者、欲界。余通如《摩诃衍论》中说。","世尊弟子习学五法门志求涅槃，有二种人：或好定多，以快乐故。或好智多，畏苦患故。定多者，先学禅法，后学涅槃。智多者，直趣涅槃。直趣涅槃者，未断烦恼亦未得禅，专心不散直求涅槃，越爱等诸烦恼，是名涅槃。","身实无常、苦、不净、无我，以心颠倒故常、乐、我、净。以是故事事爱著其身，是则底下众生。行者欲破颠倒故，当习四念止观：观身种种，多诸苦患。从因缘生故无常，种种恼故苦，身有三十六物故不净，以不得自在故无我。习如是观，观内身、观外身、观内外身，习如是观，是谓身念止。","身实相如是！何故于此，而起颠倒爱著此身？谛思惟念，身边乐痛，以爱乐痛故著此身，当观乐痛实不可得。云何不得因衣食故致乐？乐过则苦生，非实乐故。如患疮苦，以药涂治，痛止为乐。以大苦故，谓小苦为乐，非实乐也。复次以故苦为苦，新苦为乐。如担重易肩，而以新重为乐，非实常乐也。如火性热，无暂冷时。若是实乐，不应有不乐。","或曰：「外事是乐，因缘不必是乐，或时乐因、或时苦因。若使心法与爱相应，尔时是乐；与恚相应，尔时是苦；与痴相应，不苦不乐。以此推之，可知有乐无乐。」","答曰：「无也。婬欲不应是乐。何以故？若婬欲在内，不应外求女色，外求女色当知婬苦。若婬是乐，不应时时弃，若弃不应是乐。于大苦中，以小苦为乐也。如人应死，全命受鞭，以是为乐。欲心炽盛，以欲为乐，老时厌欲，知欲非乐。若实乐相，不应生厌。如是种种，因缘欲乐相，实不可得，乐失则苦。佛言：『乐痛应观苦，苦痛应观乐，如箭在体，不苦不乐应观生灭无常。』是谓痛念止。」","当知心受苦乐、受不苦不乐。云何心？是心无常，从因缘生故。生灭不住，相似生故，但颠倒故，谓是为一。本无今有，已有还无，是故无常。观知心空。云何为空？从因缘生，有眼有色，可见忆念，欲见如是等，和合眼识生。如日爱珠，有日有珠，有干草牛屎，众缘和合，于是火生。一一推求，火不可得，缘合有火。眼识亦尔，不住眼中，亦非色中住，不两中间住，无有住处，亦复不无。是故佛言：「如幻如化」。现在心观过去心，或苦、或乐、或不苦不乐，心各各异各各灭，有欲心、无欲心亦如是，各各异各各灭，观内心、观外心、观内外心亦如是。是名心念止。","复次观心为属谁？观想、思惟、念欲等诸心相应法不相应法，谛观其主，主不可得。何以故？从因缘生故无常，无常故苦，苦故不自在，不自在故无主，无主故空。前别观身、痛、心、法不可得，今更总观四念止中主不可得，离此处求亦不可得。若常不可得，无常亦不可得；若常应当常苦常乐，亦不应忘；若常有神者，无杀恼罪，亦无涅槃；若身是神，无常身灭，神亦应灭，亦无后世，亦无罪福。如是遍观无主，诸法皆空不自在，因缘合故生，因缘坏故灭，如是缘合法，是名法念止。","若行者得法念止，厌世间空老病死法，都无少许常乐我净，我于此空法复何所求？应当入涅槃最善法中住。建精进力，得深舍摩陀故（深舍摩陀者，住心一处名也，此土无是名）。是时得深舍摩陀，住第四法念止中，观诸法相，皆苦无乐，无乐是实，余者妄语。苦因爱等诸烦恼及业，是非天、非时、非尘等种种妄语中生，是烦恼及业出生，此苦是苦。","入涅槃时一切灭尽，非色、无色界及世界始世界始，（外道谓一切有法之初，色为世界始，外道谓涅槃也。以此有始，能化作万物，即名造化也）等种种妄语，能灭此苦。正见等八直是涅槃道，非余外道苦行，种种空持戒、空禅定、空智慧。何以故？佛法中戒、定、慧三法合行能入涅槃，譬如人立平地，持好弓箭，能射杀怨贼，三法合行亦如是！戒为平地，禅定为快弓，智慧为利箭，三事备足，能杀烦恼贼，以是故外道辈不得涅槃。","行者是时作四法缘，观缘如射博。观苦四种：因缘生故无常，身心恼故苦，无一可得故空，无作无受故无我。观习四种：烦恼有漏业和合故集，相似果生故因，是中得一切行故生，非相似果相续故缘。观尽四种：一切烦恼覆故闭，除烦恼火故灭，一切法中第一故妙，世间过去故出。观道四种：能到涅槃故道，不颠倒故正，一切圣人去处故迹，得脱世愁恼故离。如是观者得无漏相似法，名为煖法。云何名煖？常懃精进故名煖法。诸烦恼薪，无漏智火烧，火欲出初相，名为煖法，譬如钻火，初钻烟出，是名煖，是为涅槃道初相。","佛弟子中有二种人：一者、多好一心求禅定，是人有漏道。二者、多除爱著好实智慧，是人直趣涅槃入煖法中。有煖相者深得一心，实法镜到无漏界边（镜中像似面，界边非中故以为喻）。行者是时大得安隐，自念：「我定当得涅槃，见此道故。」如人穿井得至湿泥，知当得水不久；如人击贼贼已退散，自知得胜意中安隐；如人怖死，人欲知活不？当先试之以杖打身，若隐胗脉起者，知是有煖，必可得活；亦如听法人思惟喜悦心著，是时心热，行者如是有煖法，故名为有煖，亦名能得涅槃分善根。是善根法有十六行四谛，缘六地中一智慧一切无漏法基，野人能行安隐（于无漏踈，故名为野人，案梵本尔，先言凡夫人，非），是名有煖法。","增进转上，更名顶法，如乳变为酪。是人观法实相，我当得苦脱，心爱是法是为真法，能除种种苦患及老病死。是时，思惟此法谁说？是佛世尊！从是得佛宝中信心清净大欢喜悦。若无此法，一切烦恼谁当能遮？我当云何得实智慧少许明？从是得法宝中信心清净大欢喜悦。若我不得佛弟子辈好伴，云何当得实智慧少许明？从是得僧宝中信心清净大欢喜悦。是三宝中得一心清净合实智慧，是顶善根，亦名顶法，亦名能得涅槃分善根。如《波罗延经》中说：",`「佛宝法僧宝，　谁有少信净；
是名顶善根，　汝曹一心持。」`,"云何为少信？于佛、菩萨、辟支佛、阿罗汉边为少，于野人边为多；复次，此可破可失，是故名少。如《法句》说：",`「芭蕉生实死，　竹生实亦然！
骡有子则死，　小人得养死。
破失非利故，　小人得名誉；
白净分失尽，　乃至顶法堕。」`,"复次，未断诸结使，未得无漏无量慧心，以是故名少。","复次。懃精进一心入涅槃道中，更了了观五阴、四谛十六行。是时，心不缩不悔不退，爱乐入忍，是名忍善根。忍何等？随四谛观行，是名为忍。是善根三种：上、中、下三时。","云何名忍？观五阴无常、苦、空、无我，心忍不退，是名忍。","复次，观诸世间尽苦空无有乐，是苦因习爱等诸烦恼，是习智缘尽，是名上法，更无有上。八直道能令行人得至涅槃，更无有上。如是信心不悔不疑，忍是名忍。是中更有忍，种种结使、种种烦恼疑悔，来入心中不能令破，譬如石山种种风水不能漂动，是故名忍，是事得名真好野人。如佛说《法句》中：",`「世界正见上，　谁有得多者？
乃至千万岁，　终不堕恶道。」`,"是世间正见，是名为忍善根。","是人多增进，一心极厌世界行，欲了了四谛相，作证趣涅槃，如是一心中，是名世间第一法。一时住四行：无常、苦、空、无我，观一谛，苦法忍共缘故。何以故？观欲界五受阴，无常、苦、空、无我，是中心忍入慧，亦是相应心心数法，是名苦法忍。身业、口业及心不相应诸行，现在未来世一切无漏法初门，是名苦法忍（法无漏法忍信受也）。","次第生苦法智。苦法忍断结使，苦法智作证。譬如一人刈，一人束，亦如利刀斫竹得风即偃，忍智功夫故，是事得办。欲界系见苦，断十结得得，尔时异等智得，无漏智未得，无漏慧得。是时成就一智（等智未来成就），第二心中成就法智、苦智等智，过第三心、第四心成就四智：苦智、法智、比智、等智。习、尽、道法智中，一一智增，离欲人知他心智成就增；苦比忍、苦比智断十八结，是四心苦谛能得。习法忍、习法智断欲界系七结；习比忍、习比智断色、无色界系十三结。尽法忍、尽法智断欲界系七结；尽比忍、尽比智断色、无色界系十二结。道法忍、道法智断欲界系八结；道比忍、道比智断色、无色界系十四结。道比智是名须陀般那（下子上子），实知诸法相。","是十六心能，十五心中利根名随法行，钝根名随信行。是二人未离欲，名初果向。先未断结，得十六心，名须陀般那。若先断六品结，得十六心，名息忌陀伽迷（秦言一来）。若先断九品结，得十六心，名阿那迦迷（秦言不来）。先未离欲，断八十八结故，名须陀般那；复次无漏果善根得得，故名须陀般那。利根名见得，钝根名信爱。思惟结未断，余残七世生，若思惟结三种断，名家家三世生。圣道八分、三十七品名流，流向涅槃，随是流行，故名须陀般那，是为佛初功德子。恶道得脱，三结断，三毒薄，名息忌陀伽迷。复次欲界结九种（上上、上中、上下、中上、中中、中下、下上、下中、下下），见谛断、思惟断。","若凡夫人，先以有漏道，断欲界系六种结，入见谛道十六心中，得名息忌陀伽迷。若八种断，入见谛道第十六心中，一种名息忌陀伽迷果向呵那伽迷。","若佛弟子得须陀般那，单断三结，欲得息忌陀伽迷，是思惟断欲界系九种结、六种断，是名息忌陀伽迷八种断；是名一种息忌陀伽迷果向阿那伽迷。","若凡夫人先断欲界系九种结，入见谛道第十六心中，名阿那伽迷；若得息忌陀伽迷进，断三种思惟结，第九解脱道，名阿那伽迷。","阿那伽迷有九种：今世必入涅槃阿那伽迷，中阴入涅槃阿那伽迷，生已入涅槃阿那伽迷，懃求入涅槃阿那伽迷，不懃求入涅槃阿那伽迷，上行入涅槃阿那伽迷，至阿迦尼咤入涅槃阿那伽迷，到无色定入涅槃阿那伽迷，身证阿那伽迷行向阿罗汉阿那伽迷。色、无色界九种结，以第九无碍道金刚三昧破一切结，第九解脱道尽智修一切善根，是名阿罗汉果。","是阿罗汉有九种：退法、不退法、死法、守法、住法、必知法、不坏法、慧脱、共脱。濡智濡进行五种法退，是名退法。利智利进行五种法不退，是名不退法。濡智濡进利，厌思惟自杀身，是名死法。濡智大进自护身，是名守法。中智中进、不增不减处中而住，是名住法。少利智懃精进，能得不坏心解脱，是名必知法。利智大进，初得不坏心解脱，是名不坏法。不能入诸禅，未到地中诸漏尽，是名慧解脱。得诸禅亦得灭禅诸漏尽，是名共解脱。","有阿罗汉，一切有为法常厌满足，更不求功德，待时入涅槃。有阿罗汉，求四禅、四无色定、四等心、八解脱、八胜处、十一切、入九次第、六神通，愿智阿兰若那三昧（秦言无诤。阿兰若言无事，或言空寂。旧言须菩提常行空寂，行非也，自是无诤行耳！无诤者将护众生，不令起诤，于我耳起诤，如舍利弗、目连夜入陶屋中宿，致拘迦离起诤者是也），超越三昧熏禅三解脱门及放舍（放舍者，三脱门，空、无愿、无相。空无愿无相，即十二门念，反著者也），更作利智懃精进，入如是诸禅功德，是名得不退法、不坏法。","若佛不出世，无佛法无弟子时，是时离欲人辟支佛出。辟支佛有三种：上、中、下。下者本得须陀般那、若息忌陀伽迷。是须陀般那于第七世生人中，是时无佛法，不得作弟子；复不应八世生，是时作辟支佛。若息忌陀伽迷二世生，是时无佛法，不得作弟子；复不应三世生，是时作辟支佛。有人愿作辟支佛，种辟支佛善根，时无佛法，善根熟，尔时厌世出家得道，名辟支佛，是名中辟支佛。有人求佛道，智力进力少，以因缘退（如舍利弗是也），是时佛不出世，无佛法亦无弟子，而善根行熟，作辟支佛，有相好若少若多，厌世出家得道，是名上辟支佛。","于诸法中智慧浅入，名阿罗汉；中入名辟支佛；深入名佛。如遥见树，不能分别枝；小近能分别枝，不能分别华、叶；到树下尽能分别知树枝、叶、华、实。声闻能知一切诸行无常，一切诸法无主，唯涅槃善安隐。声闻能如是观，不能分别深入深知；辟支佛少能分别，亦不能深入深知；佛知诸法分别究畅，深入深知也。","如波罗奈国王，夏暑热时处高楼上坐七宝床，令青衣磨牛头栴檀香涂身，青衣臂多著钏，摩王身时钏声满耳，王甚患之！教次第令脱，钏少声微，唯独一钏寂然无声。王时悟曰：「国家、臣民、宫人、婇女，多事多恼亦复如是！」即时离欲独处思惟，得辟支佛。须发自落、著自然衣，从楼阁去，以己神足力出家入山。如是因缘，中品辟支佛也。","若行者求佛道入禅，先当系心专念十方三世诸佛生身，莫念地水火风、山树草木、天地之中有形之类，及诸余法一切莫念。但念诸佛生身处在虚空，譬如大海清水中央金山王须弥；如夜暗中然大火；如大施祠中七宝幢。佛身如是，有三十二相、八十种好，常出无量清净光明，于虚空相青色中，常念佛身相如是，行者便得十方三世诸佛悉在心目前一切悉见三昧。若心余处缘，还摄令住念在佛身，是时便见东方三百千万千万亿种无量诸佛。如是南方、西方、北方、四维、上下，随所念方，见一切佛。如人夜观星宿，百千无量种星宿悉见。","菩萨得是三昧，除无量劫厚罪令薄、薄者令灭。得是三昧已，当念佛种种无量功德，一切智、一切解、一切见、一切德，得大慈大悲自在，自初出无明㲉，四无畏、五眼、十力、十八不共法，能除无量苦，救老死畏，与常乐涅槃。佛有如是等种种无量功德，作是念已自发愿言：「我何时当得佛身、佛功德，巍巍如是？」复作大誓：「过去一切福、现在一切福，尽持求佛道，不用余报。」复作是念：「一切众生甚可怜愍，诸佛身功德巍巍如是，众生云何更求余业而不求佛？」譬如贵家盲子堕大深坑，饥穷困苦食粪食泥。父甚愍之，为求方便，拯之于深坑，食之以上馔。行者念言：「佛二种身功德甘露如是，而诸众生堕生死深坑，食诸不净。以大悲心，我当拯济一切众生，令得佛道度生死岸，以佛种种功德法味悉令饱满，一切佛法愿悉得之。闻诵持问、观行得果，为作阶梯，立大要誓被三愿铠，外破魔众内击结贼，直入不回。如是三愿比无量诸愿，愿皆住之，为度众生得佛道故。」如是念、如是愿，是为菩萨念佛三昧。","行菩萨道者，于三毒中若婬欲偏多，先自观身：骨肉皮肤、筋脉流血，肝肺肠胃、屎尿涕唾，三十六物、九想不净，专心内观不令外念；外念诸缘，摄之令还。如人执烛入杂谷仓，种种分别豆、麦、黍、粟无不识知。复次观身六分：坚为地分、湿为水分、热为火分、动为风分、孔为空分、知为识分。亦如屠牛，分为六分，身首四支，各自异处。身有九孔，常流不净，革囊盛屎，常作是观，不令外念；外念诸缘，摄之令还。若得一心，意生厌患，求离此身，欲令速灭，早入涅槃。是时当发大慈大悲，以大功德，拔济众生，兴前三愿：「以诸众生，不知不净，起诸罪垢，我当拔置于甘露地。复次，欲界众生乐著不净如狗食粪，我当度脱至清净道。复次，我当学求诸法实相，不有常不无常、非净非不净，我当云何著此不净？观不净智从因缘生，如我法者当求实相，云何厌患身中不净而取涅槃？当如大象度驶流水穷尽源底，得实法相灭入涅槃，岂可如猕猴诸兔畏怖驶流趣自度身？我今当学如菩萨法，行不净观除却婬欲，广化众生令离欲患，不为不净观所厌没。」","复次，既观不净则厌生死，当观净门系心三处：鼻端、眉间、额上。当于是中，开一寸皮，净除血肉，系心白骨，不令外念；外念诸缘，摄之令还，著三缘中，恒与心鬪。如二人相扑，行者若胜，心则不如，制之令住，是名一心。","若以厌患，起大悲心，愍念众生，为此空骨，远离涅槃，入三恶道，我当懃力，作诸功德，教化众生，令解身相空，骨以皮覆，实聚不净，为众生故，徐当分别此诸法相。有少净想，心生爱著；不净想多，心生厌患；有出法相，故生实法。诸法实相中，无净无不净，亦无闭亦无出，观诸法等，不可坏不可动，是名诸法实相（出过罗汉法也）。","行菩萨道者，若瞋恚偏多，当行慈心，念东方众生，慈心清净，无怨无恚，广大无量，见诸众生，悉在目前。南西北方、四维上下，亦复如是。制心行慈，不令外念；外念异缘，摄之令还。持心目观，一切众生，悉见了了，皆在目前。若得一心，当发愿言：「我以涅槃，实清净法，度脱众生，使得实乐。」行慈三昧，心如此者，是菩萨道。住慈三昧，以观诸法，实相清净，不坏不动，愿令众生，得此法利。以此三昧，慈念东方一切众生，使得佛乐，十方亦尔！心不转乱，是谓菩萨慈三昧门。","问曰：「何不一时总念十方众生？」","答曰：「先念一方，一心易得，然后次第，周遍诸方。」","问曰：「人有怨家，恒欲相害，云何行慈，欲令彼乐？」","答曰：「慈是心法，出生于心，先从所亲；所亲转增，乃及怨家，如火烧薪，盛能然湿。」","问曰：「或时众生，遭种种苦，或在人中、或地狱中，菩萨虽慈，彼那得乐？」","答曰：「先从乐人，取其乐相，令彼苦人，得如彼乐。如败军将，怖惧失胆，视彼敌人，皆谓勇士。」","问曰：「行慈三昧有何善利？」","答曰：「行者自念：『出家离俗，应行慈心。』又思惟言：『食人信施，宜行利益。』如佛所言：『须臾行慈，是随佛教，则为入道，不空受施。』复次身著染服，心应不染，慈三昧力，能令不染；复次我心行慈，于破法世我有法人，非法众中我有法人，如法无恼，慈定力故。菩萨行道，趣甘露门，种种热恼，慈凉冷乐。如佛所言：『人热极时，入清凉池乐。』复次被大慈铠、遮烦恼箭，慈为法药、消怨结毒，烦恼烧心、慈能除灭；慈为法梯，登解脱台；慈为法船，渡生死海，贫善法财，慈为上宝；行趣涅槃，慈为道粮；慈为骏足，度入涅槃；慈为猛将，越三恶道。能行慈者，消伏众恶，诸天善神，常随拥护。」","问曰：「若当行人得慈三昧，云何不失而复增益？」","答曰：「学戒清净，善信倚乐，学诸禅定，一心智慧，乐处闲静，常不放逸，少欲知足，行顺慈教，节身少食，减损睡眠，初夜后夜，思惟不废，省烦言语，默然守静，坐卧行住，知时消息，不令失度，致疲苦极，调和寒温，不令恼乱，是谓益慈。","「复次，以佛道乐涅槃之乐与一切人，是名大慈。行者思惟：『现在未来，大人行慈，利益一切，我亦被蒙，是我良祐，我当行慈，毕报施恩。』复更念言：『大德慈心，愍念一切，以此为乐，我亦当尔，念彼众生，令得佛乐、涅槃之乐，是为报恩。』","「复次慈力，能令一切，心得快乐，身离热恼，得清凉乐；持行慈福，念安一切，以报其恩。复次慈有善利，断瞋恚法，开名称门，施主良田，生梵天因，住离欲处，除却怨对，及鬪诤根。诸佛称扬，智人爱敬，能持净戒，生智慧明，能闻法利，功德醍醐，决定好人，出家猛力，消灭诸恶。骂辱不善，慈报能伏，结集悦乐，生精进法，富贵根因，办智慧府，诚信库藏，诸善法门，致称誉法，敬畏根本，佛正真道。","「若人持恶向，还自受其殃。五种恶语：非时语、非实语、非利语、非慈语、非软语。是五恶语不能倾动，一切毒害亦不能伤，譬如小火不能热大海（此下应出优填王持五百发箭）。如《毘罗经》中优填王阿婆陀那说，有二夫人：一名无比，二名舍迷婆帝。无比诽谤舍迷婆帝。舍迷婆帝有五百直人，王以五百箭欲一一射杀之。舍迷婆帝语诸直人，在我后立。是时舍迷婆帝入慈三昧，王挽弓射之，箭堕足下。第二箭还向王脚下。王大惊怖，复欲放箭。舍迷婆帝语王言：『止止。夫妇之义是故相语，若放此箭当直破汝心。』王时恐畏，投弓舍射，问言：『汝有何术？』答言：『我无异术。我是佛弟子，入慈三昧故也！』","「是慈三昧略说有三种缘：生缘、法缘、无缘。诸未得道，是名生缘。阿罗汉辟支佛，是名法缘。诸佛世尊，是名无缘，是故略说慈三昧门。」","行菩萨道者，于三毒中若愚痴偏多，当观十二分，破二种痴：内破身痴，外破众生痴。思惟念言：「我及众生俱在厄难，常生、常老、常病、常死、常灭、常出，众生可怜，不知出道，从何得脱？」一心思惟，生老病死从因缘生。当复思惟何因缘生？一心思惟，生因缘有、有因缘取、取因缘爱、爱因缘受、受因缘触、触因缘六入、六入因缘名色、名色因缘识、识因缘行、行因缘无明。如是复思惟，当何因缘灭生老死？一心思惟，生灭故老死灭、有灭故生灭、取灭故有灭、爱灭故取灭、受灭故爱灭、触灭故受灭、六入灭故触灭、名色灭故六入灭、识灭故名色灭、行灭故识灭、痴灭故行灭。","此中十二分，云何无明分？不知前、不知后、不知前后，不知内、不知外、不知内外，不知佛、不知法、不知僧，不知苦、不知习、不知尽、不知道，不知业、不知果、不知业果，不知因、不知缘、不知因缘，不知罪、不知福、不知罪福，不知善、不知不善、不知善不善，不知有罪法、不知无罪法，不知应近法、不知应远法，不知有漏法、不知无漏法，不知世间法、不知出世间法，不知过去法、不知未来法、不知现在法，不知黑法、不知白法，不知分别因缘法，不知六触法，不知实证法。如是种种不知不慧不见，暗黑无明，是名无明。","无明缘行。云何名行？行有三种：身行、口行、意行。云何身行？入息出息是身行法。所以者何？是法属身，故名身行。","云何口行？有觉有观，是作觉观已，然后口语，若无觉观则无言说，是谓口行。云何意行？（痛名世界人所著三种痛，痛应为受，受则随界受苦乐，上界所无，故宜言受想出家所患也）。痛想是意法，系属意故，是名意行。复次欲界系行、色界系行、无色界系行。复次善行、不善行、不动行。云何善行？欲界一切善行，亦色界三地。云何不善行？诸不善法。云何不动行？第四禅有漏善行及无色定善有漏行。是名行。","行因缘识。云何名识？六种识界：眼识乃至意识，是名六识。","识因缘名色，云何为名？无色四分：痛、想、行、识，是谓名。云何为色？一切色四大及造色，是谓色。云何四大？地、水、火、风。云何地？坚重相者地，濡湿相者水，热相者火，轻动相者风。余色可见，有对无对是名造色。名色和合，是谓名色。","名色因缘六入。云何六入？内六入：眼内入乃至意内入，是名六入。","六入因缘触。云何触？六种触界：眼触乃至意触。云何眼触？眼缘色生眼识，三法和合，是名眼触，乃至意触亦如是！","触因缘受。云何受？三种受：乐受、苦受、不苦不乐受。云何乐受？爱使。云何苦受？恚使。云何不苦不乐受？痴使。复次乐受生乐，住乐灭苦；苦受生苦，住苦灭乐；不苦不乐受，不知苦不知乐。","受因缘爱。云何爱？眼触色生爱，乃至意触法生爱。","爱因缘取。云何取？欲取、见取、戒取、我语取。","取因缘有。云何有？三种有：欲有、色有、无色有。下从阿鼻大泥梨。上至他化自在天，是名欲有，及其能生业。云何色有？从下梵世上至阿迦尼咤天，是名色有。云何无色有？从虚空乃至非有想非无想处，是名无色有。","有因缘生。云何生？种种众生处处生出，有受阴得持得入得命，是名生。","生因缘老死。云何老？齿落、发白、多皱、根熟、根破、气噎，身偻拄杖行步，阴身朽故，是名老。","云何死？一切众生处处退、落、堕、灭、断、死，失寿命尽，是名死。先老后死，故名老死。","是中十二因缘，一切世间非无因缘边、非天边、非人边，非种种等邪缘边出。菩萨观十二因缘，系心不动不令外念；外念诸缘摄之令还。观十二分生三世中：前生、今生、后生。菩萨若得心住，当观十二分空无有主。痴不知我作行，行不知我从痴有，但无明缘故行生。如草木种从子芽出，子亦不知我生芽，芽亦不知从子出，乃至老死亦复如是！是十二分中，一一观知无主无我，如外草木无主，但从倒见计有吾我。","问曰：「若无吾我、无主、无作，云何去来言说死此生彼？」","答曰：「虽无吾我，六情作因、六尘作缘、中生六识，三事和合故触法生，念知诸业，由是去来，言说从是有生死。譬如日爱珠，因日、干牛屎，和合方便故火出。五阴亦尔，因此五阴生，后世五阴出，非此五阴至后世，亦不离此五阴得后世五阴，五阴但从因缘出。譬如谷子中芽出，是子非芽亦非余芽边生，非异非一，得后世身亦尔！譬如树未有茎节、枝叶、华实，得时节因缘华叶具足，善恶行报亦复如是！种子坏故非常、非一；芽、茎、叶等生故不断不异；死生相续亦复如是！」","行者谓法无常、苦、空、无我，自生自灭。知因爱等有，知因灭是尽，知尽是道。以四种智知十二分，是正见道。众生为缚著所诳，如人有无价宝珠，不别其真，为他欺诳。是时菩萨发大悲心，我当作佛，以正真法化彼众生，令见正道。","问曰：「如《摩诃衍般若波罗蜜》中言：『诸法不生不灭，空无所有，一相无相，是名正见。』云何言无常等观名为正见？」","答曰：「若《摩诃衍》中说『诸法空无相』，云何言无常、苦、空等不实？若言不生不灭空是实相者，不应言无相。汝言前后不相应。复次佛说四颠倒，无常中常颠倒亦有道理，一切有为无常。何以故？因缘生故。无常因、无常缘，所生果云何常？先无而今有，已有便无。一切众生皆见无常，内有老、病、死，外见万物凋落，云何言无常不实？」","问曰：「我不言有常为实、无常为不实，我言有常、无常俱是不实。何以故？佛言：『空中有常、无常，二事不可得，若著此二事，是俱颠倒。』」","答曰：「汝言不与法相应。何以故？言无法，云何复言二俱颠倒？一切空无所有，是为实不颠倒。若我破有常著无常，我法应破而不实，我有常颠倒，破故观无常。何以故？无常力能破有常，如毒能破余毒，如药除病，药亦俱去，当知药妙能除病故。若药不去，后药为病，此亦如是！若无常法著，应当破，不实故。我不受无常法，云何破？佛言：『苦是四真谛中言实苦，谁能使乐？苦因是实因，谁能令非因？苦尽是实尽，谁能令不尽？尽道是实道，谁能令非道？如日或可令冷，月或可令热，风可令不动，是四真谛终不可动转。』汝于《摩诃衍》中不能了，但著言声。《摩诃衍》中诸法实相，实相不可破、无有作者。若可破可作，此非摩诃衍。如月初生，一日二日其生时甚微细，有明眼人能见，指示不见者。此不见人但视其指，而迷于月。明者语言：『痴人！何以但视我指？指为月缘，指非彼月。』汝亦如是！言音非实相，但假言表实理。汝更著言声，暗于实相。」","行若得如是正知见，观十二分，和合为因果二分：果时十二分为苦谛，因时十二分为习谛，因灭是尽谛，见因果尽是道谛。四种观果：无常、苦、空、无我。四种观因：集、因、缘、生。","问曰：「果有四种但名苦谛，余者无谛名也？」","答曰：「若言无常谛复疑，苦谛亦疑，无我谛亦疑，一种难处。复次，若言无常谛无咎，空非我谛亦无咎。若无常苦空无我谛，于说为重故，是故于四说一。」","问曰：「苦有何异相，于三中独得名？」","答曰：「苦是一切众生所厌患，众生所怖畏，无常不尔！或有人为苦所逼，思得无常，无有欲得苦者。」","问曰：「有人欲得捉刀自杀，针炙苦药入贼，如是种种非求苦也？」","答曰：「非为欲得苦，欲存大乐，畏苦故取死。苦为第一患，乐为第一利，以是故离实苦得快乐，是故佛以果分，独名苦谛，非无常、空、无我谛。」","是于四谛中了了实智慧不疑不悔，是名正见。思惟是事种种增益故，是名正觉。除邪命摄四种邪语，离余四种邪语，摄四种正语，除邪命摄身三种业，除余三种邪业，名正业。离余种种邪命，是名正命。如是观时精进，是正方便。是事念不散，是名正念。是事思惟不动，是名正定。正觉如王，七事随从，是名道谛。","是事一心实信不动，是名信根。一心精懃求道，是名精进根。一心念不忘失，是名念根。心住一处亦不驰散，是名定根。思惟分别无常等觉，是名慧根。是名增长得力，是名五力。","问曰：「八正道中皆说慧念定等，根力中何以重说？」","答曰：「随入行时初得小利，是时名为根。是五事增长得力，是时得名为力。」","初入无漏见谛道中，是功德名八正道。入思惟道时，名七觉意。初入道中，观念身、痛、心、法，常一心念，是名四念止。如是得善法味四种精懃，是名四正懃。如是欲精进定慧初门，懃精进求如意自在，是名四神足。虽名四念止、四正懃、四神足、五根等，皆摄随行时初后少多行地缘，各各得名。譬如四大，各各有四大，但多得名。若地种多，水火风少处，名为地大。水火风亦如是！如是三十七品中各各有诸品，如四念止中有四正懃、四神足、五根、五力、七觉、八道等。","如是观十二分、四谛行、四念止、四正懃、四神足、五根、五力、七觉意、八正道，其心安乐。复以此法度脱众生，一心誓愿精进求佛。是时心中思惟观念：「我了了观知此道，不应取证。」有二事力故未入涅槃：一者、大悲不舍众生，二者、深知诸法实相。诸心心数法从因缘生，我今云何随此不实？当自思惟，欲入深观十二因缘，知因缘是何法。复更思惟，是四种缘：因缘、次第缘、缘缘、增上缘。五因为因缘，除过去现在阿罗汉最后心，余过去现在心心数法，是次第缘。缘缘、增上缘，缘一切法。复自思惟言：「若法先因缘中有，则不应言是法因缘生；若无，亦不应言因缘中生；生有半无亦不应因缘生；云何有因缘？若法未生，若过去心心数法失，云何能作次第缘？若佛法中妙法无缘涅槃，云何为缘缘？若诸法实无性，有法不可得；若因缘果生，因此有彼，是说则不然；若因缘中各各别、若和合一处，是果不可得，云何因缘边出果？因缘中无果故。若因缘中先无果而出者，何以不非因缘边出果？二俱无故。果属因缘，因缘边出，是因缘不自在属余因缘，是果属余因缘。云何不自在？因缘能生果，是故果不从因缘有，亦不从非因缘有，则为非果。果无故，缘与非缘亦无也！」","问曰：「佛言十二因缘，无明缘诸行，汝云何言无因果？」","答曰：「先以被答，不应更难，若难者更当答。佛言眼因色缘痴边生邪忆念，痴是无明，是中无明，何所依住？若依眼邪？若色中、若识邪？不应依眼住。若依眼住，不应待色，常应痴。若依色住，不应待眼。是则外痴，何豫我事？若依识住，识无色、无对、无触、无分、无处。无明亦尔，云何可住？是故无明非内、非外、非两中间，不从前世来，亦不住后世，非东西南北、四维上下来，无有实法，无明性尔。了无明性，则变为明，一一推之，痴不可得。云何无明缘行？如虚空不生不灭、不有不尽，本性清净。无明亦如是，不生不灭、不有不尽，本性清净，乃至生缘老死亦尔。」","菩萨如是观十二因缘，知众生虚诳系在苦患，易度耳。诸法若有实相难可得度，思惟如是则破愚痴。","若菩萨心多思觉，常念阿那波那，入时出时数一乃至十，一一心不令驰散。菩萨从此门得一心，除五盖欲行。","菩萨见道应行三种忍法：生忍、柔顺法忍、无生忍。云何生忍？一切众生或骂或打或杀，种种恶事，心不动转、不瞋、不恚，不唯忍之而更慈悲，此诸众生求诸好事愿一切得，心不舍放。是时渐得解诸法实相，如气熏著。譬如慈母爱其赤子乳哺养育，种种不净不以为恶，倍加怜念欲令得乐。行者如是，一切众生作种种恶、净不净行，心不增恶不退不转。复次十方无量众生，我一人应当悉度使得佛道，心忍不退、不悔、不却、不懈、不厌、不畏、不难，是生忍中一心系念。三种思惟不令外念，外念诸缘摄之令还，是名生忍。","云何柔顺法忍？菩萨既得生忍，功德无量，知是功德福报无常，是时厌无常自求常福，亦为众生求常住法。一切诸法，色无色法、可见不可见法、有对无对法、有漏无漏、有为无为、上中下法，求其实相。实相云何？非有常非无常、非乐非不乐、非空非不空、非有神非无神？何以故非有常？因缘生故。先无今有故，已有还无故，是故非有常。云何非无常？业报不失故，受外尘故，因缘增长故非无常。云何非乐？新苦中生乐想故，一切无常性故，缘欲生故，是故非乐。云何非不乐？乐有受故，欲染生故，求乐不惜身故，是非不乐。云何非空？内外入各各受了了故，有罪福报故，一切众生信故，是故非空。云何非不空？和合等实故，分别求不可得故，心力转故，是故非不空。云何非有神？不自在故，第七识界不可得故，神相不可得故，是故非有神。云何非无神？有后世故，得解脱故，各各我心生不计余处故，是故非无神。如是不生不灭、不不生不不灭、非有非无、不受不著，言说悉灭、心行处断，如涅槃性，是法实相。于此法中信心清净，无滞无碍，软知软信软进，是谓柔顺法忍。","云何无生法忍？如上实相法中，智慧、信、进增长根利，是名无生法忍。譬如声闻法中煖法、顶法，智慧、信、精进增长得忍法，忍者忍涅槃、忍无漏法，故名为忍。新得、新见，故名为忍。法忍亦如是。时解脱阿罗汉不得无生智，增进广利转成不时解脱得无生智。无生法忍亦如是，未得菩萨果得无生法忍，得菩萨真行果，是名菩萨道果。是时得般舟三昧，于众生中得大悲，入般若波罗蜜门。尔时诸佛便受其号，堕生佛界中，为诸佛所念，一切重罪薄，薄者灭，三恶道断，常生天上人中，名不退转。到不动处，末后肉身尽入法身中，能作种种变化，度脱一切众生，具足六度供养诸佛，净佛国土教化众生，立十地中功德成满，次第得阿耨多罗三藐三菩提，为菩萨禅法中初门。",`行者定心求道时，　常当观察时方便；
若不得时无方便，　是应为失不为利。
如犊未生𤛓牛乳，　乳不可得非时故；
若犊生已𤛓牛角，　乳不可得无智故。
如钻湿木求出火，　火不可得非时故；
若折干木以求火，　火不可得无智故。
得处知时量己行，　观心方便力多少；
宜应精进及不宜，　道相宜时及不宜。
若心调动不应勇，　如是勇过不得定；
譬如多薪炽大火，　大风来吹不肯灭。
若能以定自调心，　如是动息心得定；
譬如大火大风吹，　大水来浇无不灭。
若人心软复懈怠，　如是厌没不应行；
譬如少薪无焰火，　不得风吹便自灭。
若有精进勇猛心，　如是转健得道疾；
譬如小火多益薪，　风吹转炽无灭时。
若行放舍止调缩，　设复发舍失护法；
譬如病人宜将养，　若复放舍无得活。
若有舍想正等心，　宜时懃行得道疾；
譬如有人乘调象，　如意至凑无踬碍。
若多婬欲爱乱心，　是时不应行慈等；
婬人行慈益痴闷，　如人冷病服冷药。
婬人心乱观不净，　谛观不净心得定；
行法如是相应故，　如人冷病服热药。
若多瞋恚忿乱心，　是时不应观不净；
瞋人观恶增恚心，　如人热病服热药。
若人瞋怒行慈心，　行慈不舍瞋心灭；
行法如是相应故，　如人热病服冷药。
若多愚痴心暗浅，　不净行慈悲行法；
二行增痴无益故，　如人风病服𪎊药。
人心痴暗观因缘，　分别谛观痴心灭；
法行如是相应故，　如人病风服腻药。
譬如金师排扇炭，　用功非时失𭬽法；
怱怱急𭬽不知时，　或时水浇或放舍。
金融急𭬽则消过，　未融便止则不消；
非时水浇金则生，　非时放置则不熟。
精进摄心及放舍，　应当观察行道法；
非时方便失法利，　若非法利为非利。
譬如药师三种病，　冷热风病除灭故；
应病与药佛如是！　婬怒痴病随药灭。`],source:"https://cbetaonline.dila.edu.tw/zh/T15n0614",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T15/T15n0614.xml",sourceLabel:"CBETA T15n0614",scope:"全2卷正文（不含序跋、目录、附录）",originalTitle:"坐禪三昧經",juan:[1,2]},{id:"cbeta-t15n0617",title:"思惟略要法",subtitle:"思惟略要法 · 姚秦 鸠摩罗什译",paragraphs:["形疾有三：风、寒、热病，为患轻微。心有三病，患祸深重，动有劫数受诸苦恼，唯佛良医能为制药。行者无量世界长婴此疾，今始造行，当令其心决定专精不惜身命，如人入贼，心不决定不能破贼，破乱想军亦复如是。如佛言曰：「血肉虽尽，但有皮筋尚在，不舍精进，如人火烧身衣，但欲救火更无余念。」出烦恼苦亦复如是，当忍事病苦饥渴、寒热瞋恨等，当避愦閙乐住闲寂。所以者何？众音乱定，如入棘林。","凡求初禅先习诸观，或行四无量、或观不净、或观因缘、或念佛三昧、或安那般那，然后得入初禅则易。若利根之人直求禅者，观于五欲种种过患，犹如火坑亦如厕舍；念初禅地，如清凉池如高台观，五盖则除便得初禅。如波利仙人初学禅时，道见死女膖胀烂臭，谛心取相，自观其身如彼不异，静处专思便得初禅。佛在恒水边坐禅，有一寡闻比丘问佛：「云何得道？」佛言：「他物莫取。」便解法空即得道迹，有多闻比丘，自怪无所得而问于佛。佛言：「取恒水中小石，以君迟水净洗。」比丘如教。佛问：「恒水多？君迟水多？」答：「不可为喻也。」佛言：「不以指洗，虽多无用也。」行者当勤精进，用智定指洗除心垢，若不如是，不能离法也。","四无量观法：","求佛道者，当先行四无量心。其心无量，功德亦无量。于一切众生中，凡有三分：一者父母亲里善知识等，二者怨贼嫌人常欲恼害者，三者中人不亲不怨。行者于此三品人中，慈心视之当如亲里，老者如父母，中年如兄弟，少年如儿子，常应修集如是慈心。人之为怨以有恶缘，恶因缘尽还复成亲，怨亲无定。何以故？今世是怨后世成亲，瞋憎之心自失大利，破忍辱福、失慈心业、障佛道因缘，是故不应瞋憎。怨贼应当视之如其亲里。所以者何？是怨贼令我得佛道因缘，若使怨贼无恶于我，我无所忍，是则为我善知识也，令我得成忍辱波罗蜜。怨贼之中得是慈已，于十方众生慈心爱念。普遍世界，见诸众生无常变异，有老病死众苦逼切，蜎蜚蠕动皆无安者而起悲心。若见众生得今世乐及后世乐，得生天乐贤圣道乐而起喜心。不见众生有苦乐事，不忧不喜以慧自御，但缘众生而起舍心，是名四无量心。于十方众生慈心遍满故名为无量，行者常应修集是心。若或时有瞋恚心起，如蛇如火在于身上，即应急却。若心驰散入于五欲，及为五盖所覆，当以精进智慧之力强摄之还。修习慈心，常念众生令得佛乐，习之不息，便得离五欲、除五盖、入初禅。得初禅相者喜乐遍身，诸善法中生欢喜乐，见有种种微妙之色，是名入佛道初门禅定福德因缘也。得是四无量心已，于一切众生忍辱不瞋，是名众生忍。得众生忍已，易得法忍。法忍者，所谓诸法不生不灭毕竟空相。能信受是法忍，是名无生忍，得阿耨多罗三藐三菩提记，当得作佛。行者应当如是修习也。","不净观法：","贪欲、瞋恚、愚痴是众生之大病，爱身著欲则生瞋恚，颠倒所惑即是愚痴，愚痴所覆故内身外身爱著浮相，习之来久染心难遣，欲除贪欲当观不净。瞋恚由外既尔可制，如人破竹初节为难，既制贪欲，余二自伏。不净观者，当知此身生于不净，处在胞胎，还从不净中出。薄皮之内纯是不净，外有四大变为饮食充实其内，谛心观察，从足至发从发至足，皮囊之里无一净者，脑膜涕唾、脓血屎尿等，略说则三十六，广说则无量。譬如农夫开仓，种种别知麻米豆麦等。行者以心眼开是身仓，见种种恶露肝肺肠胃诸虫动食，九孔流出不净，常无休止。眼流眵泪、耳出结𦡲、鼻中涕流、口出唌吐、大小便孔常出屎尿，虽复衣食障覆，实是行厕。身状如此，何由是净？又观此身假名为人，四大和合譬之如屋，脊骨如栋、脇肋如椽、骸骨如柱、皮如四壁、肉如泥涂，虚伪假合，人为安在？危脆非真，幻化须臾。脚骨上胫骨接之，胫骨上髀骨接之，髀骨上脊骨接之，脊骨上髑髅接之，骨骨相拄危如累卵。谛观此身无一可取，如是心则生厌恶。常念不净三十六物，如实分别，内身如此外身不异。若心不住，制之令还专念不净。心住相者，身体柔软渐得快乐。心故不住，当自诃心：「从无数劫来常随汝故，更历三恶道中苦毒万端。从今日去我当伏汝，汝且随我。」还系其心令得成就。若极厌恶其身，当进白骨观，亦可入初禅。行者志求大乘者，命终随意生诸佛前，不尔必至兜率天上得见弥勒。","白骨观法：","白骨观者，除身皮血筋肉都尽，骨骨相拄白如珂雪，光亦如是。若不见者，譬如癞人，医语其家：「若令饮血色同乳者，便可得差。」家中所有悉令作白，银桮盛血，语之：「饮乳，病必得差。」癞人言：「血也。」答言：「白物治之，汝岂不见家中诸物悉是白耶？罪故见血，但当专心乳想，莫谓是血也。」如是七日便变为乳，何况实白而不能见？既见骨人，当观骨人之中，其心生灭相续如𫄧穿珠，如意所见及观外身，亦复如是。若心欲住，精勤莫废，如攒火见烟、掘井见湿，必得不久。若心静住，开眼闭眼光骨明了，如水澄静则见面像，浊则不了，竭则不见。","观佛三昧法：","佛为法王，能令人得种种善法，是故习禅之人先当念佛。念佛者，令无量劫重罪微薄得至禅定。至心念佛。佛亦念之，如人为王所念，怨家债主不敢侵近。念佛之人。诸余恶法不来扰乱，若念佛者佛常在也。云何忆念？人之自信无过于眼，当观好像便如真佛。先从肉髻、眉间白毫下至于足，从足复至肉髻，如是相相谛取，还于静处闭目思惟，系心在像不令他念。若念余缘，摄之令还，心目观察如意得见，是为得观像定。当作是念：「我亦不往，像亦不来，而得见者，由心定想住也。」然后进观生身便得见之，如对面无异也。人心驰散多缘恶法，当如乳母伺视其子，莫令坠于坑井险道。念则如子，行者如母，若心不住，当自责心：「念老病死甚为切近。若生天者，著于妙欲，无有治心善法；若堕三恶道，苦恼怖懅善心不生。今受妙法，云何可不至心专念耶？」又作念言：「生在末法，末法垂已欲灭，犹如赦鼓开门放囚，鼓音渐已欲止，门扉已闭一扇，岂可自宽不求出狱。过去无始世界已来，所更生死苦恼万端，今所受法未得成就，无常死贼须臾叵保，当复更受无央数劫生死之苦。」如是种种鞭心，令心得住。心住相者，坐卧行步常得见佛，然后更进生身、法身。得初观已，展转则易。","生身观法：","生身观者，既已观像，心想成就，捡意入定，即便得见，当因于像以念生身。观佛坐于菩提树下，光明显照相好奇特；或如鹿野苑中坐，为五比丘说四谛法时；或如耆阇崛山放大光明，为诸大众说波若时。如是随用一处，系念在缘不令外散，心想得住即便见佛，举身快乐乐彻骨髓。譬如热得凉池、寒得温室，世间之乐无以为喻也。","法身观法：","法身观者，已于空中见佛生身，当因生身观内法身，十力、四无所畏、大慈大悲无量善业。如人先念金瓶，后观瓶内摩尼宝珠，所以尊妙神智无比，无远无近无难无易，无限世界悉如目前，无有一人在于外者，一切诸法无所不了。常当专念不令心散，心念余缘摄之令还。复次，一切愚智当其死时，外失诸根如投黑坑，若能发声声至梵天。大力大苦大怖大畏无过死贼，唯佛一人力能救拔，能与种种人天涅槃之乐。复次，一切诸佛，世世常为一切众生故不惜身命。如释迦牟尼佛昔为太子时，出游道见癞人，勅医令治。医言：「当须不瞋人血饮之，以髓涂之，乃可得差。」太子念言：「是人难得，设使有者复不可尔。」即便以身与之令治。若为一切众生，亦复如是。佛恩深重过于父母，若使一切众生悉为父母，佛为一分，二分之中常当念佛，不应余念。如是种种功德，随念何事，若此定成除断结缚，乃至可得无生法忍。若于中间诸病起者，随病习药。若不得定，六欲天中豪尊第一，飞行所至宫殿自随。或生诸佛前，终不空也；若人药和赤铜，若不成金，不失银也。","十方诸佛观法：","念十方诸佛者，坐观东方廓然明净，无诸山河石壁，唯见一佛结跏趺坐举手说法。心眼观察，光明相好画然了了，系念在佛不令他缘，心若余缘摄之令还。如是见者，更增十佛，既见之后复增百千，乃至无有边际，近身则狭转远转广，但见诸佛光光相接。心眼观察得如是者，回身东南，复如上观。既得成就，南方西南方，西方西北方，北方东北方，上下方都亦如是。既得方方皆见诸佛，如东方已，当复端坐总观十方诸佛，一念所缘周匝得见。定心成就者，即于定中十方诸佛皆为说法，疑网云消得无生忍。若宿罪因缘不见诸佛者，当一日一夜六时忏悔随喜劝请，渐自得见，纵使诸佛不为说法，是时心得快乐身体安隐。是则名为观十方诸佛也。","观无量寿佛法：","观无量寿佛者，有二种人。钝根者，先当教令心眼观察额上一寸，除却皮肉但见赤骨。系念在缘不令他念，心若余缘摄之令还。得如是见者，当复教令变此赤骨辟方一寸令白如珂。既得如是见者，当复教令自变其身皆作白骨，无有皮肉色如珂雪。复得如是见，当更教令变此骨身使作琉璃，光色清净视表彻里，既得如是见者，当复教令从此琉璃身中放白光明，自近及远遍满阎浮，唯见光明不见诸物，还摄光明入于身中。既入之后，复放如初。凡此诸观从易及难，其白亦应初少后多。既能如是，当从身中放此白光，乃于光中观无量寿佛。无量寿佛其身姝大光明亦妙，西向端坐相相谛取，然后总观其身，结跏趺坐颜容巍巍如紫金山。系念在佛不令他缘，心若余缘摄之令还，常如与佛对坐不异，如是不久便可得见。若利根者，但当先作明想，晃然空净，乃于明中观佛，便可得见。行者若欲生于无量寿佛国者，当作如是观无量寿佛也。","诸法实相观法：","诸法实相观者，当知诸法从因缘生，因缘生故不得自在，不自在故毕竟空相，但有假名无有实者。若法实有不应说无，先有今无是名为断。不常不断亦不有无，心识处灭言说亦尽，是名甚深清净观也。又观婬怒痴法即是实相。何以故？是法不在内不在外。若在内，不应待外因缘生；若在外，则无所住。若无所住亦无生灭，空无所有清净无为，是名婬怒痴实相观也。又一切诸法毕竟清净，非诸佛贤圣所能令尔。但以凡夫未得慧观，见诸虚妄之法有种种相。得实相者观之，如镜中像，但诳人眼，其实不生亦无有灭。如是观法甚深微妙，行者若能精心思惟，深静实相不生邪者，即便可得无生法忍。此法难缘，心多驰散，若不驰散或复缩没，常应清净其心了了观察。若心难摄当呵责心：「汝无数劫来常应杂业无有厌足，驰逐世乐不觉为苦，一切世间贪乐致患，随业因缘受生五道，皆心所为，谁使尔者？汝如狂象，蹈藉残害无有物制，谁调汝者？若得善调则离世患。当知处胎不净，苦厄逼迮切身犹如地狱。既生在世，老病死苦忧悲万端不得自在；若生天上，当复堕落。三界无安，汝何以乐著？」如是种种呵责其心已，还念本缘。心想住者，心得柔软，见有种种色光从身而出，是名诸法实相观也。","欲生无量寿佛国者，应当如是上观无量寿佛。又观诸法实相，又当观于世间如梦如幻皆无实者，但以颠倒虚妄之法，横起烦恼受诸罪报。如人见诸小儿共诤瓦石土木，便生瞋鬪。观诸世间亦复如是，当兴大悲誓度一切，常伏其心修行二忍，所谓众生忍、法忍也。众生忍者，若恒河沙等众生种种加恶，心不瞋恚；种种恭敬供养，心不欢喜。又观众生无初无后，若有初者则无因缘，若有因缘是则无初，若无初者中后亦无。如是观时不堕常断二边，用安隐道观诸众生不生邪见，是名众生忍。法忍者，当观诸法甚深清净毕竟空相，心无罣碍能忍是事，是名法忍。新发意者虽未得是法忍，当如是修习其心。又观诸法毕竟空相，而于众生常兴大悲，所有善本尽以回向，愿生无量寿佛国，便得往生。","法华三昧观法：","三七日一心精进如说修行，正忆念《法华经》者，当念释迦牟尼佛于耆阇崛山与多宝佛在七宝塔共坐，十方分身化佛遍满所移众生国土之中，一切诸佛各有一生补处菩萨一人为侍，如释迦牟尼佛以弥勒为侍。一切诸佛现神通力，光明遍照无量国土，欲证实法出其舌相，音声满于十方世界。所说《法华经》者，所谓十方三世众生若大若小，乃至一称南无佛者，皆当作佛。惟一大乘，无二无三，一切诸法一相一门，所谓无生无灭毕竟空相。唯有此大乘，无有二也。习如是观者，五欲自断、五盖自除，五根增长，即得禅定。住此定中深爱于佛，又当入是甚深微妙一相一门清净之法。当恭敬普贤、药王、大乐说、观世音、得大势、文殊、弥勒等大菩萨众，是名一心精进如说修行正忆念《法花经》也。此谓与禅定和合令心坚固，如是三七日中，则普贤菩萨乘六牙白象来至其所，如经中说。"],source:"https://cbetaonline.dila.edu.tw/zh/T15n0617",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T15/T15n0617.xml",sourceLabel:"CBETA T15n0617",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"思惟略要法",juan:[1]},{id:"cbeta-t15n0618",title:"达摩多罗禅经",subtitle:"达摩多罗禅经 · 东晋 佛陀跋陀罗译",paragraphs:["修行方便道安那般那念退分第一",`前礼牟尼尊，　炽然烦恼灭，
流转退住者，　度以升进道。
修行微妙法，　能离退住过；
亦灭一切恶，　成就诸功德。`,"佛世尊善知法相，得如实智慧，灭烦恼盛火，出炽然之宅，乘诸波罗蜜船，度无量苦海。以本愿大悲力，故不舍众生，为诸修行，说未曾有法，度诸未度，令得安隐，谓二甘露门。各有二道：一、方便道，二曰、胜道。清净具足，甚深微妙，能令一切诸修行者出三退法，远离住缚，增益升进，成就决定，尽生死苦，究竟解脱，兼除众生久远痴冥。","佛灭度后，尊者大迦叶、尊者阿难、尊者末田地、尊者舍那婆斯、尊者优波崛、尊者婆须蜜、尊者僧伽罗叉、尊者达摩多罗，乃至尊者不若蜜多罗，诸持法者，以此慧灯，次第传授，我今如其所闻而说是义。",`我今如所闻，　演说修行地，
方便胜究竟，　如其修所生。
修行于善法，　先当知四种：
退减住升进，　决定诸功德。
修行退减时，　令住法不生，
亦不能升进，　是今当略说。
先当起等意，　习行慈心观，
须臾止瞋恚，　令暂息不行。
烦恼暂止息，　次当净尸罗，
尸罗既清净，　三昧于中起。
三昧已修起，　观察应不应？
善知应不应，　修向所应作。
既向所应作，　专念系心处，
已能乐彼处，　正观依风相。
正观依风时，　其心犹驰乱，
止心在入息（安般者二种：一见，二触钝根不见），
如系调御马。　心既止入息，
思惟正忆念，　冷暖与轻重，
柔软麁澁滑。　修行谛觉知，
随顺善调适。　于触复不了，
是说修行退。　数一以为二，
数二以为一，　至九犹错乱，
是说修行退。　若于修行退，
更数从初起；　十数满足者，
远离诸过行。　不修与过修，
或有异修起，　有此诸过生，
是说修行退。　修行若俱数，
心据生惑乱，　惑乱若增长，
是说修行退。　气息不通流，
冲击于鼻面，　头顶悉苦痛，
内或绞风起；　息乱失其道，
而彼不知治，　身体极烧热，
其心生愦乱。　四种既错乱，
依风极违诤。　修行欲令息，
而不善方便，　不知对治法，
是必疾退减。　修行缘入息，
而反缘出息；　修行缘出息，
而反缘入息。　于二心俱净，
是应修行果。　寂止定意生，
而复更求数，　有此诸过谬，
是皆修行退。　急喘而安般，
则令念错乱；　由是错乱念，
修行心发狂。　其心发狂故，
不知应不应，　于二无分别，
是说修行退。　修行数已成，
息去亦随去；　去已处处住，
于彼善观察。　既观令息还，
还已起清净。　不善知六种，
是说修行退。　长短悉分别，
遍身尽觉知，　身行渐休息，
一切应决了。　于此不善知，
是令修行退（身念处四胜竟）。　知喜亦知乐，
勤方便意行；　当复制心行，
令不至掉乱（受念处四胜竟）。　次分别知心，
修行正观察；　又生欣悦心，
还复摄令定。　非是不定心，
定已心解脱（心念处四胜竟）。　善修解脱者，
不令心退没；　若入退减分，
则无有解脱。　观察无常断，
离欲与灭尽，　出息入息灭，
是名修行胜（此四相似法念处）。　如是十六行，
自在心回转。　觉触之所获，
见得亦复然。　若于见与触，
不善识分际；　是过应当知，
无智令修退。　修行上增进，
不应缘于下；　缘下亦如是，
不应上增进。　若见二增进，
心住而等观，　任之则自成，
还到修行处。`,"方便道安般念退分第一竟。","修行胜道退分第二",`胜念已成就，　懈怠竟沉没，
是则为退像，　无堪于所求。
不染污无记，　起诸烦恼退，
垢浊热炎生，　由是失正见。
振掉或关钥（以灼反），　浮飘麁澁滑，
是五退减相，　修行应分别。
望远绝所悕，　有见已坠落，
还顾覩深崄，　是皆退减相。
长病诵止诤，　多业远游行，
彼时解脱种，　是五退减因。
信、戒、闻、舍、慧，　于是渐衰退。
身重与惛钝，　耽睡及沉没，
是五应当知，　修行退转相。
恐怯多犹豫，　惊畏不欣乐，
懈怠离所欲，　不回向修行。
不习、过修习，　是二俱为失，
彼时解脱种，　于是修行退。
三昧离相乐，　尔炎皆消尽；
麁澁四大种，　还从身内起。
掉动失正念，　由是意愦乱，
其心不恬静，　斯从行者生。
一切诸瑞相，　不显现分明，
修行如是观，　欲见为甚难。
诸根悉驰纵，　随欲向所缘；
邪意普流散，　乐著诸境界。
形消意愁惨，　其身皆烧然；
如是烧然者，　是说为忧退。
方便不精勤，　后则生悔恨；
闻所应成就，　欲进劣无能。
不趣喜胜处，　或见胜不取，
皆由无智故，　是说修行退。
自念有越戒，　疑悔及诸觉，
意淡无滋味，　是说修行退。
诸过定意羸，　三昧渐消减，
心乱盖所覆，　是说修行退。
心举调顺舍，　不观时非时，
不了住起缘，　无智故修退。
不知六时行，　六界亦不善，
亦愚六巧便，　是说修行退。
贪欲瞋恚觉，　十想巧方便，
得向诸禅地，　及法心妄解，
一切次第度，　无知故修退。
不观处非处，　业报及正受，
禅定诸解脱，　净味愚不了；
诸根到处道，　性欲不分别，
心随众杂相，　是悉无知退。
于苦乐速道，　其心不趣向，
如是意迷惑，　必向退转处。
起住与起缘，　入出及方便，
六法不成就，　是令修行退。
知法亦知义，　知时亦知量，
自知与知众，　及知福伽罗，
于七愚不了，　是令修行退。
兴起诸恶法，　习行卑贱业，
亲近不善友，　令是修行退。
错说违所应，　受者心乐向，
当知是不久，　必于修行退。
所止处及人，　床卧等众具，
斯皆非所乐，　近令修行退。
喜随诸杂相，　损减所修慧；
弃舍所缘处，　心不得真实。
修行舍本相，　散心随外缘，
虽欲还彼处，　意众不复乐，
遂失长养分，　其心不一定。
身无复滋润，　悦乐亦不生；
所依不可乐，　身意俱错乱；
三昧不复起，　其心永不住；
如是不住心，　必于修行退。
爱见慢增禅，　于缘心味著，
有此累念生，　是说修行退。
身如利刺害，　或复极振掉，
举体皆烦壮，　如蛇毒充满，
有此三过恶，　必于修行退。
得未得服行，　他务意不闲，
习近三退法，　是说修行退。
业与烦恼报，　说是三障阂，
亦有解脱障，　是令修行退。
方便想恶行，　三摩提行地，
于彼不观察，　是令修行退。
方便想诸地，　三昧行及余，
所闻随悕望，　则于发趣退。
生时作灭想，　灭时作生想，
二想俱当失，　是则修行退。
若于住法中，　而作生灭想，
兴此诸颠倒，　是说修行退。
入时作出想，　出时作入想，
二俱作住想，　是说为颠倒。
欲断烦恼得，　修行正方便，
由彼得力故，　相似诸相生。
相似相既生，　修行心随转，
烦恼即时起，　是说修行退。
退过诸驶水，　漂浪修行者，
随我力所能，　少量退法海。
无量余退过，　是深非所恻；
诸深明智者，　自当广称说。`,"胜道中退分竟。","修行方便道安般念住分第三",`如我力所能，　演说退过已，
今当说住过，　修行者善听！
若于入出息，　无见亦无觉，
不解方便求，　是则初门住。
闻慧既已生，　应起思慧念；
不善解次第，　愚痴住所缚。
若数已成就，　息去应随去；
不知随顺法，　是说修行住。
如佛问比丘：　「谁习安般念？」
有一比丘答：　「是念我修习。」
「汝有安般念，　不言汝无有，
复更有胜妙，　牟尼说当修，
方便道安般。」`,"念住分第三竟。","修行胜道住分第四",`胜道修正观，　相行念已成；
不善升进法，　是则住所缚。
爱著所缘境，　进业心懈怠，
由是缚所缚，　不能至胜处。
或有不可动，　非软亦非坚；
或强极牢密，　亦如金刚像；
有此五障阂，　不进亦不退，
是则住缚相，　远离升进道。
乱光及黑暗，　忍自身不现；
譬燃浊油光，　亦如翳目视。
光明不显发，　背舍诸喜乐，
寂止息乐分，　彼终不复生。
犹如坚实物，　而有濡相现；
或时修行者，　住相亦复然。
相非随所欲，　而起随欲想；
虽欲令随意，　终不从所乐。
谓相非所留，　而欲强制持，
如是违反念，　则为住所缚。
是想已成就，　当知非所制。
住彼去留相，　能到最胜处。
欲令涌作没，　或欲高为下，
于去欲使来，　于住不欲住，
灭时欲不灭，　终不如所欲。
修行住生灭，　所行常转进，
诸法相已成，　终不舍自相，
若不舍自相，　自相则显现。
薄皮覆不净，　令不见身秽，
威仪及众具，　利乐翳身苦。
相似次第生，　前后续无间，
隐蔽非常相，　令不见身变，
施作服用受，　摄持吾我相。
能忆念本事，　隐身非我观，
是诸相似相，　修行不分别。
于彼起爱乐，　而生功德相，
染著妄想生，　不复乐升进。
不能取胜法，　住过日增长；
非我相似相，　此等不回转；
如是不回转，　行者痴惑生。
无智住所缚，　系著于彼处，
乐著生诸过，　是相今当说。
尔炎渐损坏，　分离及交乱，
破散叵和合，　是则住相缚。
于身不巧便，　自生分离想；
交乱或尘碎，　是为住所缚。
守常无异想，　众色不次生；
种种众妙想，　亦不次第起。
流出而不住，　其身渐消减；
相或来复去，　修行不增长。
寂止既不生，　于身无长养；
心不起悦乐，　是说不净舍。
彼不清净舍，　所见不鲜白，
亦不能升进，　亦复不退转。
如戏沙门像，　少时生悦乐。
譬如借衣服，　亦如梦所见。
为命不清净，　谄曲及余恶，
聚落知识所，　自显其功德。
覆藏诸过恶，　犯罪不发露；
及余一切缚，　垢污修行者。
髣髴有事相，　而便起实想；
未熟谓为熟，　未灭想已灭；
方便不等满，　而欲求升进；
如部含穟苗，　是则住所缚。
业始无方便，　相现坚守持，
过进心矜举，　如是住所缚。
或有修行者，　而起断常见；
是见令心乱，　则为缚所缚。
或有修行者，　身身细微观；
彼为住所缚，　厌心不增长。
厌心不增进，　不能离贪欲；
若不离贪欲，　何从有解脱？
解脱不成就，　终不得漏尽；
不断诸漏者，　则无实智慧。
于彼身念处，　住相已分别，
受心法念处，　如是应广说。
修行心不悦，　彼喜亦不生；
身无寂止乐，　当知是住相。
修行所受获，　信、戒、闻、舍、慧；
常守其少分，　是则为住相。
有住缚比丘，　往到阿难所，
迷于所住相，　是今当略说。
得无相三昧，　六年住所缚，
乐欲闻所说，　常随逐阿难。
不能进所业，　亦复不退转，
住于住境界，　不得解脱道。
不来亦不去，　解脱已而住，
住已复解脱，　解脱已还缚。
或有修行者，　住在不退地，
微细烦恼起，　而不能觉知，
不觉烦恼故，　不能到胜处。
于地无分别，　亦无有退过，
地诸过不起，　如是止于住；
或于住分中，　而失众妙相。
众妙相虽灭，　意犹顺彼地；
意顺彼地时，　余分乐相生。
已有少乐故，　心依寂止住，
因其寂止心，　自谓作已作。
安止不具足，　不得具足果；
无智翳心目，　而自谓为智。
修行无智障，　不觉所应用；
觉所应用者，　于地能究竟。
彼住共地中，　种种垢所污，
若使修行者，　成就不共地，
如是知过患，　彼终不为缚。
不识烦恼过，　愚痴无实智；
于禅觉吉安，　犹如象系树。
修行观尔炎，　莫知所起处；
从其所依出，　而自不能知。
不涌亦不没，　不见相所起；
亦不知灭处，　过亦无过是。
所说诸障碍，　皆是坚住相，
谓不由彼住，　斯非明智说。
兴造诸过患，　若干因缘缚；
能用诸对治，　众妙复显说。
所尊不恭敬，　亦不舍憍慢；
自隐覆其过，　不向明者说。
我年既衰老，　已为众所弃，
或能失利养，　令我生苦恼。
心常怀忧畏，　深虑长叹息；
我后当死时，　将欲作何计？
隐过心忧恼，　愚惑作所缚；
横自生罪累，　失大功德海。
味著现法乐，　贪餐黠无慧，
弃舍后世果，　兴此诸过恶。
如是诸住缚，　所起各各异；
修行无怯劣，　能治所应治。
怯劣无方便，　自谓无由进；
是则甚难拔，　如象溺深泥。
如是甚难拔，　懈怠心所欺；
长夜没住泥，　热迫而趣死。
业行烦恼报，　为此三障覆；
无智无势起，　永为住所没。
久远积痴冥，　业行诸烦恼，
系缚斯等类，　迷乱不自在。
习近诸过恶，　远离善功德，
令其意匆扰，　如箭旋虚空。
蛇毒盛充满，　蝮蝎恶龙处，
巨海深无底，　无泽大火聚；
盲人近彼游，　暗往而不见，
修行住所缚，　其过亦如是。
住过多无量，　升进德亦然；
如海无涯底，　是深不可量。
世间无知障，　真实慧为灯；
持灯无放逸，　彼明终不灭。
善说住分过，　缚诸无黠者；
决定知境界，　究竟非我分。
种种过所缚，　是缚非一相；
当知业众缘，　唯佛能觉了。`,"修行方便道升进分第五",`比丘安般念，　功德住升进，
能令智慧增，　我今次第说。
功德住已进，　进复功德住，
是故说修行，　功德住升进。
修行于鼻端，　系心令坚住，
专念谛思惟，　正观依风相。
入息与出息，　系心随忆念；
忆念若不忘，　是初功德住。
彼功德住已，　复起方便求，
更求功德时，　住则生升进。
升进等起时，　亦生功德住，
是名住已进，　进已功德住。
善解安般相，　功德及诸过，
息轻重冷暖，　软麁与澁滑。
阿那摄般那，　是摄持诸根，
于彼所缘境，　摄之令寂止；
外散心数法，　摄还义亦然，
持风来入内，　是故说阿那，
心转于所缘，　止令不复转，
心于所缘起，　亦复制令灭。
修行观若增，　制之令从止；
修行若止增，　起之令从观。
见增则以触，　触增则以见，
得证与智证，　二增俱相摄。
修行缘不寂，　意寂止摄来，
身中清凉起，　灭除诸热恼。
掉踊不静心，　摄之令寂止，
勤方便回转，　其身悉充满。
长养四大种，　当知从息起；
是种复增益，　行者报四大。
阿那力能起，　寂止善法分；
我所大恶刺，　亦能拔令出。
息短而渐灭，　修行心安静，
是故佛世尊，　说名为阿那。
复次般那相，　是今当略说。
毛孔诸窍处，　先净治息道，
前出名般那，　始由入风起。
修行出息时，　诸根随所缘，
心心法俱顺，　是亦说般那。
出息归于灭，　乃入根本地；
正受及命终，　斯由舍出息。
修行出息灭，　得入无想定，
灭尽三摩提，　第四禅亦然。
般那既已灭，　次第阿那生，
阿那时悕望，　说阿世婆娑。
我观彼死者，　定无有是相；
彼息更生者，　观有如是相，
毒淤埿火蛇，　此相似境界。
出息能摄意，　不令随所缘；
犹如制象钩，　名波世婆娑（出息有摄心义）。
舍除颠倒想，　成就真实想，
离自在及常，　唯为空行聚。
本无所从来，　去亦无所至；
去来不可得，　亦不须臾住。
慧智明见此，　离诸知作者；
出息无作者，　见则堕颠倒。
出息已过去，　彼则不可见；
命断诸息灭，　过去亦复然。
安般诸功德，　出息与入息，
众物及字义，　我已略说竟。
是种增故说，　未曾相离用，
若为觉想乱，　当习安般念。
已能应于数，　则除内贪著；
于数若随顺，　是则离不顺。
志在无乱境，　能摄诸乱想，
先数从一起，　如是乃至十。
修行顺此数，　便得功德住，
已得功德住，　则能求升进，
灭一切乱觉，　佛说增上故（数门竟）。
数能灭一切，　觉佛但言灭；
一切不死者，　以增上故也。
内外出入息，　去则心影随，
决定善观察，　顺是趣涅槃。
修行出入息，　随到所起处（出入息所起处同在脐），
如是知升进，　能离外贪著（随门竟）。
安止极风处（极上下风际），
三摩提等起，　三昧既已起，
便得功德住（止门竟）。　修行正住已，
种种观察风，　先观于本处，
谓风所从起。　此处为云那，
为一为二耶？　冷暖悉观察，
八种如前说。　为总观诸大？
唯在一种耶？　观时悉俱有，
以一增上说。　修行观风大，
造色从彼生，　唯心与心法，
依彼造色起；　非彼造色已，
而复有种大。
诸有入出息，　是风名依种，
报风及长养，　是为三种风。
或说入在前，　出者在于后；
或说出在前，　入者在于后，
皆有因缘故，　彼作如是说。
如其真实义，　慧者乃决定。
于脐处所起，　净治毛孔道（此报风开毛孔故名出，非出外）；
由此风义故，　彼说出在前。
毛孔已开净，　入者则在前；
如人初生时，　阿那入故起。
息风最先出，　是故说波那（此是真实义）；
息风诸种大，　割截不生苦。
当知彼非受，　谓受则不然。
以彼修行者，　不患诸断逼；
是故出入息，　于身复非受。
识命若断时，　息则不回转；
是则众生数，　必由命根起。
息则是身行，　世尊之所说；
亦名根本依，　众生所由转。
是息既已灭，　命则无所依；
以能持命根，　故说众生数。
阿那般那念，　缘风为境界；
虽曰正思惟，　而非真实行。
一切所修观，　彼悉缘风起；
于观有差别，　次第今当说。
阿那般那念，　分别有三种：
所谓从闻起，　思慧与修慧。
于是安般念，　比丘闻慧生，
一切时悉受，　名字为境界。
境界出入息，　正念思慧生；
当知彼缘名，　时或复缘义。
阿那般那念，　所起修禅慧，
悉已舍名观，　唯缘诸法义。
当知近境界，　无有种种异，
亦非相续缘，　说是等智行。
谓是安般念，　无痴智慧性；
亦名为舍性，　是则佛所说。
当知是慧性、　舍根共俱生。
若使是舍性，　则与余共起。
欲色二有系，　无色无身依。
非彼最后禅，　身密无息故。
或谓根本地，　亦复是眷属。
说言唯眷属，　非是根本地。
欲使彼舍性，　在于根本地；
阿那般那念，　应当在八地。
所言唯眷属，　如是说舍根，
知彼安般念，　唯在于五地。
此定在五地，　依是处回转；
欲中间未至，　及后二眷属，
最上顶四禅。　彼虽有舍根，
无有于彼身，　净治毛孔道。
第四及眷属，　彼中说二种：
报生与长养，　唯无有依风。
出息与入息，　是风名为依；
以身极厚密，　无依说二种。
佛说出入息，　四禅正受刺；
亦言咽喉处，　明知有所说，
是彼方便故，　亦以禅义摄。
出息与入息，　彼处定无有，
修行观出息，　上际第四禅。
已极风境界，　于彼正忆念：
云何我是心？　于缘究竟未？
或复更于上，　少进重观察；
或即于彼住，　不作余方便。
修行如是观，　则能除疑惑。
修行极风际，　是处善观察，
当知如是心，　则名除疑观（观门竟）。
于上观察已，　依风还止住；
观察所应已，　复起余所修。
若彼观风心，　于还善决定；
是说修行者，　回转巧方便。
如人游聚落，　所作讫已归；
修行如是观，　喜乐遂增长。
已舍入息念，　安处出息缘；
亦舍出息念，　安处入息缘。
于数已究竟，　息去亦随去。
如是一切种，　亦名为回转。
观察所应相，　相相而回转；
种种众事观，　次第转亦然。
善于回转者，　说此回转义，
当知是回转，　修行智慧处。
从彼方便起，　胜道现在前，
闻慧念已度，　次第思慧生。
已舍欲界行，　然后入修慧；
是悉名回转，　世尊之所说。
从彼未至地，　次第入初禅，
乃至第三禅，　其转亦如是。
第四禅眷属，　若彼有风者，
是亦应回转，　入于根本地。
从彼起巧便，　次第住起缘；
入出与优波，　此六悉回转。
舍共方便地，　共地现在前；
舍共方便地，　不共现在前；
舍不共方便，　不共现在前。
缘相方便地，　展转究竟地，
是名上回转，　明智所称说。`,"（圣人、凡夫共有法，名为共地。从缘至缘，名为转诸相。诸方便、诸地次第转，亦如是也。）",`如我智方便，　已说回转义；
无垢清净念，　今当次第说。
如令彼修行，　须臾抑止盖，
是则为清净，　不净非所应。
若已成就数，　能舍内贪著，
此义应当知，　慧者观清净。
随顺已成就，　能舍外贪著，
如是正思惟，　智者念清净。
比丘心已住，　不为乱所乱，
如是不动念，　修行智清净。
若已于风际，　观察离疑惑，
不复更求息，　是则为清净。
念地悉已竟，　所依诸过恶，
不为则清净，　是说须臾顷。
阿那般那念，　方便道所摄；
功德住升进，　是义我已说。`,"方便升进第五竟。","修行胜道升进分第六",`功德住升进，　及余方便摄，
修行一切地，　共地不共地。
功德住升进，　彼依胜道起，
种种相行义，　今当说善听。
挮揥既已起（心住处名），　修行心爱乐；
如是爱乐心，　巧便功德住。
慧者善方便，　起意勤修行，
如其功德住，　是则巧方便。
将入微妙境，　勿随流注想，
慧者摄心住，　如应善受持。
所住妙功德，　澄净无垢浊，
具足无减少，　清净安隐住。
淳一普鲜明，　凝定而不动；
是缘由感有，　时过复归无。
色相次第起，　种种众相生；
修行正思惟，　身心生喜乐。
于是功德住，　具足摄止观；
既能起身乐，　心亦正安隐。
自地亦他地，　功德住升进，
是今当略说，　修行应分别。
修行三摩提，　巧便随顺念；
智者开慧眼，　说名为功德。
心足处安立，　说名功德住；
圣道修对治，　说名功德进。
对治诸圣行，　功德住升进；
随地过恶心，　所起悉能除。
修行勤精进，　功德利增广，
信、戒、闻、舍、慧，　无贪、恚、痴根，
欲精进惭愧，　除喜不放逸，
悦乐念定舍，　正智余善法，
如是一切种，　自地离诸垢。
其功德住立，　即随地对治，
是由精进力，　助善长养心。
何于彼地中，　种数不摄受；
功德住升进，　自地以广说。
自地善根力，　他地功德生，
修行最胜义，　此相今略说。
自地既增上，　余胜净法生；
当知是功德，　他地而升进。
无量行方便，　一切诸度法，
种种对治相，　他地功德起。
谓于初念处，　三念兼已修；
煖来及顶忍，　世间第一法。
见道思惟道，　无学道亦修；
诸禅与神通，　无量无色定。
正法道品分，　究竟漏尽智；
背舍一切入，　妙愿智清净。
身念善根力，　乃起是诸法；
微妙功德相，　一切随顺生。
若住系心处，　是则自地相；
其相起在身，　亦现亦复触。
有时说近果，　有时说非近；
或复有与果，　或空无所与。
所谓近果者，　是相近边住；
若彼果不近，　当知是相远。
若使现而触，　是即与果相；
虽现而不触，　空相无功德。
譬犹无果树，　华繁而无实。
如人冷渴逼，　远见有水火；
彼终不起触，　但见相亦然。
空无功德故，　于身无快乐；
喜悦极增长，　息乐及寂止，
身心受斯乐，　是说与果相。
功德及余法，　自地与他地，
升进相回转，　四种俱亦然。
一切升进相，　殊妙种种印，
莲花众宝树、　靡丽诸器服、
光炎极显炤，　无量庄严具。
慧说为胜道，　功德住升进，
所起诸妙相，　我今当具说。
修行者谛听！　于上曼荼逻，
淳一起众相，　流光参然下，
清净如颇梨；　其光充四体，
令身极柔软，　又复从身出。
渐渐稍流下，　随其善根力，
远近无定相。　彼成曼荼逻，
势极还本处。　根本种性中，
其相三阶起。　功德住五相，
功德进五相。　不坏功德二，
半坏功德二，　尽坏功德一。
复还系心处，　住本种性已。
流散遍十方（十相生），　功德十相上（十相各生十相），
各复一相现，　又于流散边，
生诸深妙相；　于彼深妙际，
复生深妙相。　上下轮诸相，
亦复如是现。　于彼三阶处，
种种杂相生，　自相各已灭，
唯彼总相住。　诸杂既已无，
寂静行回转，　此三曼荼逻，
境分犹不移。　顺本功德住，
自体如前说。　入息三摩提，
遍充满下方；　出息三摩提，
遍充满上方。　二俱满十方，
正受妙甚深，　如是随意者，
是谓法自在。　清净系心处，
无法而不求，　既生有长养，
成就诸功德，　如天曼陀树，
曼陀池生长。　功德住升进，
种种众妙相，　是义我已说，
修行善守持。`,"胜道升进第六竟。","修行方便道安般念决定分第七",`已说升进法，　所摄诸功德；
修行决定分，　是今次第说。
善于出息念，　入息俱亦然。
出入谛思惟，　分别具明了；
此则决定分，　世尊之所说。
一切诸善根，　各各尽自相，
最胜无上智，　说名为决定。
彼诸修行者，　安住决定分，
出息入息时，　正观无常相。
息法次第生，　展转更相因；
乃至众缘合，　起时不暂停。
当知和合法，　是性速朽灭；
法从因缘起，　性羸故无常。
一切众缘力，　是法乃得生；
虚妄无坚固，　速起而速灭。
非常毒所毒，　其性不久住，
修行如是观，　此则决定念。
譬如运行天，　息变疾于彼；
决定无常想，　修行趣涅槃。
非出息未灭，　而有入息生；
非入息未灭，　而有出息生；
如是谛观察，　修行决定分。
麁澁利刺生，　种种苦逼相；
谓息出与入，　一切时迫切。
于息能觉了，　具足众苦相；
如是谛思惟，　说名为决定。
自相无坚固，　寂灭空无我；
因缘力所起，　从缘起故灭。
舍利有我相，　常住不变易；
如是颠倒行，　一切悉远离；
唯作真实观，　是名为决定。
非我无牢固，　亦无有自在；
非彼出入息，　曾有觉知相；
谛知无我故，　是说为决定。
当知是智相，　相似圣行名；
此则为方便，　非彼真实行。
比丘安般念，　杂想觉所乱；
既乱心不悦，　应当从数起。
或从入息数，　或从出思数，
思乱觉观想，　由是究竟离。
慧者于入息，　系心行数时，
一入数为一，　不杂数出息，
专念不乱数，　如是乃至十。
舍彼十出息，　从此得决定；
此则说具足，　成就根本数。
更有余数法，　修行方便起。
若于根本数，　不能起决定，
促息使易觉，　方便令心生。
当舍二出息，　然后数入一；
定意心不乱，　第二数成就。
若于二方便，　犹不起决定，
乃至越十出，　然后数入一。
正念心不乱，　次第至具足，
是说修行者，　十种数成就。
如上十种法，　是则数究竟；
于上更复舍，　增数非修行。
修行如是数，　是则数法成；
成已应当舍，　复进余方便。
修行于数法，　若复不成就，
应更如前说，　还从初数起。
方便成数法，　便得决定分；
数法已成就，　慧者心随顺。
六种如前说，　修行正方便，
修行于六种，　疾生厌离想，
不乐著生死，　勤忧断烦恼。
修行心远离，　一切有为法，
当知是离欲，　清净决定分。
或说长在前，　或说短在前，
如其决定义，　今当次第说。
谓出息始起，　说言短在前，
是说非所应，　势渐增进故。
息去渐久远，　乃至未还间，
当知尽是长，　谓短则不然。
出息渐增长，　未到究竟处，
是中所观察，　说名长中短。
一心勤方便，　专念正思惟，
增长至究竟，　说名长中长。
观已风回转，　舍离余求想，
然后得决定，　此则短中长。
入息极短时，　还到所起处，
于是所观察，　说名短中短。
如是正思惟，　修行善明了，
已得决定分，　复进余方便。
满身遍觉知，　出入身行息，
修行如是觉，　则为决定分。
譬如火炽然，　光炎则长远；
薪尽火将灭，　光炎还渐短；
若更增益薪，　光炎普周遍；
势尽乃归灭；　四种风亦然。
或说于长短，　内外互立名；
或二俱长短，　如是种种说。
如彼汲深井，　瓶下转就远；
既摄令还上，　讫至复之短。
譬如仰射空，　矢发疾无阂，
其去渐高远，　势极还自下。
修行正思惟，　观察依风相，
初远然后近，　长短义亦然。
犹如牵旋轮，　屈伸互往来，
往远名为长，　来近则为短；
息风迭出入，　长短亦复然。
譬彼真谛观，　先苦而后集；
观息亦如是，　先长然后短。
若初禅息短，　第二禅息长，
以违正受义，　是说则不然。
于彼初禅中，　息风势极远；
第二禅息短，　正受渐差别；
满身遍觉知，　则依第三禅；
最后身行息，　以离毛孔故。
此说诸三昧，　随顺功德相，
修行安住彼，　不为觉想乱。
何故初禅中，　唯说长无短？
不舍诸所依，　由是故息长。
彼以觉想力，　能令息去长；
第二舍诸依，　势羸故息短。
甚深修多罗，　佛说山顶泉，
涓流势不远，　余处无来故。
如彼山顶喻，　第二依亦然，
唯从其处起，　是终不能远。
彼说健士夫，　负重而上山，
竭力令气奔，　息风急回转，
既到安隐处，　其息乃调适；
是喻说彼息，　前短而后长。
所说健士夫，　负重而上山，
以身力方便，　是乃令息长。
如彼劣方便，　不自力负重；
以无力方便，　息微故不远。
譬如壮夫射，　能令箭极远；
劣力无方便，　势弱去则近。
此喻应当知，　是说长短义。
修行细微觉，　一切谛明了，
如是十六分，　悉名为决定。
如方便升进，　分别功德住，
决定安般念，　亦应如是说。
如彼所未说，　诸余功德住；
是故我当说，　如其决定分。
观察风所起，　根本极清净；
修行微妙相，　则于是处现。
于彼究竟处，　摩尼宝三昧；
当知此功德，　方便根本生。
已说妙方便，　根本决定分，
余深正受相，　一切如前说。`,"方便决定分竟。","修行方便胜道决定分第八",`已说方便道，　所摄决定分；
胜道决定相，　是今我当说。
修行善决定，　系心处坚固（谓尔炎也）；
身受与心法，　于是正观察。
说有六种因，　是能成就果，
成坏各三种（成熟熟亦坏也），
修行决定相。　于是六种因，
方便善观察；　是则能次第，
疾得诸漏尽。　复更有余因，
种种成坏事；　如是多无量，
我今当略说。　何等为修行？
水种所坏相，　谓七日死尸，
毁变相已现。　彼彼诸死尸，
青黑瘀烂坏；　已坏脓血流，
恶汁相浇漫；　溃漏若分离，
杂恶极臭秽。　是悉水所坏，
内身俱亦然，　乃至劫成败，
斯由水大力。　水轮极沸涌，
大地皆瀸坏；　从彼三禅际，
周匝水来下；　洪注极漂荡，
有物皆消尽。　一切情识类，
百谷及藂林，　土地地所生，
悉为水所坏。　众生水所坏，
是皆依宿业，　如上水灾相，
无垢决定说。　此诸一切种，
皆从三昧地，　修行果所起，
当知是决定。　修行善系心，
安住三摩提，　是能于所缘，
明见彼种相。　此地熟时熟，`,"（亦义言坏，此地能坏烦恼时见坏相。）",`充满境界海。　修行所见坏，
水大决定相，　火大所坏相，
今当说善听。　识类非识类，
斯亦如上说。　及自现火然，
一切皆消尽；　乃至劫成败，
世界悉灰灭。　于彼火轮处，
炽炎大火起；　亦从二禅际，
弥满悉雨火。　盛火普周遍，
世界俱洞然；　于彼三昧地，
正观思惟起。　修行见此变，
火坏决定相，
风大所坏相，　今当次第说，
如上诸种类，　悉为风所坏。
大地及须弥，　分散若粉尘，
一切尽磨灭，　是皆风大力。
上际第四禅，　下极风轮界，
灾风从彼起，　其中皆散坏。
一切风所坏，　智者见真实；
如是正思惟，　风坏决定相。
云何彼修行，　常起深忧厌？
于前见苦法，　随忆念不忘。
八苦大地狱，　各增十六分，
彼彼众苦类，　无量边地狱，
众生生彼处，　随行受众苦。
我于此恶道，　未离或牵来，
如八大地狱，　谁能尽称说，
其中无量苦，　难可得边际。
设人有百头，　头各有百舌，
欲说地狱苦，　穷劫不能尽。
如愚黠地经，　唯佛善分别；
我悉能究竟，　无有能测者。
轮回苦毒海，　往返无量劫，
颠倒不善行，　致此大苦果。
自见宿命时，　是痛曾悉经；
修行忆本苦，　便得顺涅槃。
暗冥心增上，　畜生不净业，
受痴不爱果，　种种苦报身。
九万九千种，　形类各别异。
空行水陆性，　蚑行蠕动类，
随业各受生，　宛转此剧处，
一切诸畜生，　展转相残食。
我以愚痴故，　悉增受此苦；
顾此而怀惧，　心与厌患俱。
修行深忧厌，　则于苦决定；
修行已如是，　方便生厌离。
又复自忆念：　饿鬼无量苦，
咽细如针孔，　巨身如沃焦，
于此无数劫，　饥渴极热恼，
见天降甘雨，　欲饮成炭火。
如彼四大海，　深广无崖底，
饮之令悉尽，　不能止饥渴。
裸形被长发，　状烧多罗树，
于中甚久长，　受此种种苦。
业风飘东西，　吹身令碎折；
亦如狂飚起，　摧破久枯树。
我积悭贪行，　不习惠施业，
故生饿鬼处，　受此诸苦痛。
三昧境界地，　修行思惟起，
种种别观察，　便得不放逸。
虽未断烦恼，　见此众苦迫，
楚毒深忧惧，　极厌生死苦。
既厌能离欲，　如观掌中宝；
贪欲既已离，　便速得解脱。
譬如香美食，　其中有蛊毒；
种种生死味，　杂苦亦如是。
亦如箧盛蛇，　有人负自随；
若能觉弃舍，　不为毒所中。
身亦复如是，　四大为毒蛇；
智者能舍离，　不为彼所害。
如愚执火炬，　急持即自烧；
明人知时舍，　不为火所焚。
乐著生死者，　灾炎常炽然；
若能觉舍离，　不为火所焚。
譬诸恐怖处，　亦如被烧舍，
蚖蛇毒𠻲聚，　生死畏过是。
譬犹空聚落，　又如彼虚器，
诸法空无我，　真实性亦然。
此三恶道中，　如是苦无量，
虽天有喜乐，　是亦为大苦。
譬彼盛火然，　贪爱炽如是，
久处在天上，　常为欲火焚。
自忆忉利天，　安处善法坐；
天女侍供养，　无量极快乐。
四园列宝树，　花果妙庄严；
随意五所欲，　一切曾悉受。
时乘白龙象，　游观诸浴池；
纵意林流间，　回顾弥日夕。
食必须陀味，　饮则甘曼陀；
充实无疑患，　受乐如大海。
又处内胜堂，　天女进音乐，
妖艶极姿态，　光色曜心目；
妙音六万种，　常闻美软声；
耳目随彼转，　令我心醉冥。
诸天发微歌，　声与弦管谐，
偃卧听音乐，　寤寐皆憘悦，
诸根回五欲，　犹如旋火轮。
须弥山王顶，　安处快自在，
百一众杂宝，　间错庄严地；
诸天共娱乐，　经历甚久长。
触彼五境界，　发动五情根，
一切悉奇特，　皆是快乐因。
诸天共器食，　随福有差别；
见此异色时，　心则生忧恼。
如是极愁惨，　犹如地狱苦。
食此不净饭，　低头内惭耻，
悔责本宿业，　令我致此苦。
诸天阿修罗，　自守贪彼利，
由是兴诤怒，　畏死大恐惧。
或为天给使，　或复极贫窭，
我虽生天上，　无异恶道苦。
于彼恒乐处，　衰死二五相；
是相及命终，　尔时最大苦。
方欲恣所乐，　五衰忽然至；
若见是相时，　愁怖不自安。
天眼卒便瞬，　浴已水著身，
一切妙境界，　其心不喜乐。
千种乐自然，　加陵频伽音；
今则寂无声，　当知七日死。
玉女悉舍去，　余天共从事；
见已生热恼，　命终入地狱。
唯有贤圣人，　了达无常变，
解脱生死苦。　凡夫为烧然，
腋下流汗出，　衣服卒垢腻；
见已大恐怖，　是则净业尽；
华冠常鲜严，　而今忽萎熟；
身体本光泽，　一朝顿枯悴；
常所爱乐坐，　今恶不复乐；
是五恶瑞现，　当知死时至。
唯有见谛者，　无此诸恶相，
我今说比丘，　于是增厌患（梵本中无此一偈）。
诸天及天处，　衰变不久住；
明智修行者，　见斯无常变。
四宝须弥王，　真金山围绕，
修行慧眼净，　见此悉融消。
又诸大铁围，　周匝四天下，
消坏非常相，　行者见明了。
修行于天上，　如是观察己，
复于人道中，　思惟正忆念。
或时犯王法，　斩截身手足，
拷掠极楚毒，　我悉遍经历。
亲戚永别离，　悲恋为堕泪；
设集著一处，　过于四大海。
计我从本来，　人中所受生，
白骨悉积聚，　高广喻须弥；
流回三恶道，　楚毒无过者。
人天所受苦，　是亦多无量，
欲广分别说，　穷劫不能尽。
三昧境界地，　思惟所生果，
观察善明了，　修行深忧厌。
我虽舍家业，　不能成道果；
自谓为出家，　未出生死狱。
我虽弃恩爱，　名曰舍所生，
而不能免离，　痴爱业父母。
徒自为人子，　不从佛法生；
外假圣法衣，　力不离痴惑。
舍彼五欲利，　依止出家业，
而于佛法中，　不获少功德。
虽舍内贪著，　而不得出要；
四念未成就，　何从得心乐？
剃发毁形好，　而不舍憍慢，
空失欲味欢，　不得禅悦乐。
于五无间业，　未能定不起；
譬如无舟梁，　而欲越深水。
未入决定聚，　复无生天业，
无明复心眼，　永没生死渊。
应勤业所务，　无有无作果，
作者终不丧，　修行宜善思。
常受人信施，　侵彼肌体分；
谓我有功德，　自顾空无实。
由此利养心，　翳我善功德；
深思克骨苦，　即时兴厌离。
未脱诸恶趣，　颠倒见所缚，
不向平等路，　牟尼一乘道。
得生难得趣，　诸根悉具足，
值佛兴于世，　又得闻正法，
而不舍苦器，　未渡贪欲海，
拔刀五恶贼，　是亦未摧灭。
如是正观时，　修行向解脱；
作是忧厌相，　则便生决定。
身为不净器，　三十六充满；
譬如大地种，　生育众杂类。
身为隐覆聚，　亦常假澡浴，
聚沫撮摩法，　不久必当灭。
譬如毒蛇箧，　四大箧亦然，
八万虫中舍，　常共竞侵食。
是身为灾宅，　四百四病恼；
种种苦不净，　一切内充满。
譬如故空舍，　亦如丘冢间，
坏器无坚固，　说身亦复然。
无量众恶聚，　虚妄非真实，
颠倒起贪著，　长夜婴楚毒。
将复处胞胎，　数数受生苦，
不见真实法，　生死轮常转。
始受迦罗逻，　次生泡肉段，
渐厚成肢节，　五种胞胎苦。
幽闭无日狱，　生熟藏所迫；
长养于行厕，　臭闷不净苦。
出胎受生苦，　轮转老病死，
一切诸阴起，　三相所迫切。
观色如聚沫，　受如水上泡，
想如春时炎，　众行如芭蕉，
识种犹如幻，　虚妄无真实。
逼迫是苦相，　因缘是集相，
寂静灭尽相，　出要是道相。
于此四圣谛，　修行渐观察，
思惟十六行，　解脱生死苦。
略说一切法，　自相及共相，
明知决定义，　修行正观察。
修行然慧灯，　正观四真谛，
能断恶趣分，　离诸受胎苦，
不复乐受身，　婴世之苦恼。
舍除利养行，　独处修远离。
已能修厌离，　不味生天乐；
况复著人间，　忍受诸苦痛。
观种如毒蛇，　阴为五怨贼；
自觉贪欲患，　长夜密侵害。
六根如空聚，　尘贼竞来集，
于此内外入，　修行真实观。
见爱如大河，　涅槃如彼岸；
修行慧眼净，　观法空无我。
如是知真实，　不乐处三有。
明见诸法者，　略说三成相，
及前说三坏，　方便勤修习，
次第相行义，　是今当更说。
一色种种观，　一一四种因，
决定知因果，　究竟身念处。
受与心相应，　观时惟自体，
因缘果无量，　其相同种性，
修行思惟起，　悉依所依现。
心犹不调马，　如幻如猨猴，
无量因缘相，　一切现所依。
二阴空无我，　次合观想色，
想合受与识，　行二亦如是。
次第想色受，　想色识亦然，
分别想受识，　行三同想说。
四五渐和合，　思惟坏自相，
总缘五盛阴，　七处三种观。
悦乐广境界，　还灭观生灭，
一念见真实，　具足法念处。
正观阴种相，　如化梦水月，
定慧转增广，　彼则煖法生。
其心极寂静，　总见五阴相，
自身欲火烧，　三界尽炽然。
诸相三三昧，　正向解脱门，
初观四圣谛，　真实十六行。
成就煖法已，　增进真实观，
见佛身相好，　无量诸功德，
第一寂灭法，　清净离烦恼。
圣众功德海，　甚深无崖底，
种种微妙相，　现身及境界。
见已心欢喜，　顶法具足相。
增进生法忍，　五趣现境界。
恶道炽然灭，　游息清凉处，
中住经生死，　最上唯一心。
先观无量苦，　次见苦种生，
种转增广大，　渐见苦集灭，
灭已然后观，　八圣平等道。
变灭无常相，　麁澁逼迫苦，
空寂无众生，　不自在无我。
苦种是因缘，　众缘合为集；
种生故说起，　兴果名为缘。
苦集尽故灭，　灭静说寂止；
清净离三有，　觉说为妙出。
径路是道相，　平直说正义；
进向谓之趣，　乘出故说乘。
四谛十六行，　具足真实观，
忍法次第生，　世间第一法。
圣行正受地，　得是三决定，
见道思惟道，　次第渐究竟。
一切微妙相，　各各随地起，
成就实智慧，　具足诸功德。
当知上所说，　修行决定分，
诸有明智者，　应作正方便，
信勤勿懈怠，　常起欲惭愧。
于诸梵行者，　常当爱恭敬；
自守修净戒，　威仪令安谛。
假使得利养，　少欲知止足；
易满亦易养，　适身知量食；
亦如人膏车，　不为贪味故。
晓了一切有，　所生悉过患；
思惟善观察，　三有如火然。
如彼重病人，　信受医方疗；
闻善知识说，　观察谛思惟。
常以清净心，　系身莫放逸；
寂嘿少言说，　宴坐思实义。
丘圹林树间，　闲居修远离；
无事乐山岩，　窟中露地坐，
树下敷草叶，　如是清净住，
修行内思惟，　勤习无休懈。
专精求己利，　远离退住过，
必能得升进，　决定功德分，
修行勤方便，　具足诸善根。
我以少慧力，　略说诸法性，
如其究竟义，　十力智境界。`,"修行方便道不净观退分第九",`如我力所能，　已说安般念，
修行不净观，　次第应分别。
不净方便观，　思惟念退减，
明智所知相，　是今我当说。
修行初方便，　自于身少分，
背净开皮色，　观其所起相。
虽暂坏皮色，　不力勤方便；
净想还复生，　说名修行退。
不能起所应，　重令皮色坏；
净想仍不除，　亦名修行退。
修行爱欲增，　应往至冢间，
取彼不净相，　还来本处坐。
所见诸死尸，　我身亦复然；
一心内观察，　如彼冢间相。
彼为我作证，　由是得真实，
已得真实相，　不复起邪想。
如是方便修，　慧眼犹不净；
当知是颠倒，　无智痴冥聚。
若于足指缘，　暗乱心不住，
当于上系念，　观察求升进。
于上坏色处，　其心复驰乱；
当力勤精进，　方便离退过。
勿为烦恼染，　令不至解脱，
自勉勤方便，　疾得到涅槃。
自于身坏相，　系念无分散，
日夜勤修习，　莫令烦恼起。
修行微妙想，　世尊之所说，
常能守护想，　是终不退减。
具足观内身，　其念已坚固；
次应观外缘，　渐习令增广。
于外已周满，　坚固三摩提，
当知是不久，　次第尽诸漏。
如王无器甲，　安足不坚固，
而欲御怨敌，　必为彼所害。
修行于自身，　愚痴未决定，
而欲观外缘，　是必于行退。
我已说比丘，　无黠故修退，
更有余退过，　今当说善听。
当知修行退，　没在痴冥故，
或为盛烦恼，　业行所障蔽。
有人因色欲，　而起烦恼退，
于彼美艶色，　痴爱覆正念。
种种上衣服，　文彩发光泽，
璎珞庄严具，　金银众妙宝，
于先俗所乐，　修行还顾恋，
因此动欲想，　当知是必退。
形相计端严，　处处著姿好；
一切身肢节，　妄想起贪欲；
身体诸肢节，　细滑柔软触；
忆此本所更，　欲火还复炽。
或泣或言笑，　歌舞相顾盻；
彩服贯珠环，　文绣庄严具；
来去若容止，　流转行者心；
顾念是威仪，　欲起令退转。
有人情欲深，　不专在四种，
愚痴增烦恼，　遇形起婬乱，
是则极恶欲，　疾令修行退。
由是诸爱欲，　迷乱失正念；
相与想明了，　是终不退转。
谛自见内身，　次外善观察，
境界广增满，　周匝见崄岸，
不识究竟处，　修行疾退没。
于身染爱著，　怖畏不能进；
修行生疑怖，　是必疾退减。
若欲离疑怖，　于身修厌患，
厌患想已生，　其心犹驰乱；
当知修行者，　是必复还退。
已说诸修行，　不净方便退；
若于胜道中，　退亦如前说。`,"方便不净退分竟。","修行方便不净观住分第十",`我已略分别，　不净退减分，
如其住过相，　今当次第说。
修行烦恼业，　增长内充满，
不晓知度法，　愚痴缚令住。
自于身少分，　背净坏皮色，
不知升进法，　烦恼增故住。
或有渐升进，　遍身见坏相，
不能求外缘，　乐观内身住。
若于外境界，　修行心乐进，
欲去应随去，　方便勿令住。
未见究竟处，　而便中路止，
痴冥住所缚，　犹如象系树。
骨想有坚相，　其体密无间，
不次行众想，　亦不求升进。
又无厌离心，　亦不能决定，
修行虽成就，　不净奇特道。
不能起胜想，　令其身柔软；
若不柔软身，　流觉则不生；
不能生流觉，　是说修行住。`,"不净观方便道住分竟。","修行方便道不净观升进分第十一",`已说不净观，　方便道住过；
若于胜道中，　住应如前说；
今当次第说，　不净升进法。
先总相思惟，　系念不净缘；
次住身少分，　正观察自相。
自在及外缘，　二种说无量。
行者于内身，　自在三摩提，
勤习正方便，　周满究竟处。
外缘无量者，　境界普周遍，
而于彼正受，　不能数自在。
又自观内身，　是亦说无量。
谓于自身处，　种种众多色，
筋连与肉段，　其数各五百；
提赖与揵大，　是皆有六种。`,"提赖似果，揵大似痈，尽在腹内。",`三十六种物，　三百二十骨；
节解九百分，　九十千种脉；
宣气通诸味，　三万六千道；
身中诸毛孔，　九十九万数；
身内侵食虫，　户有八十千；
内血外精气，　是二共和合。
先得迦罗逻，　身根与命根，
是身不净起，　出自迦罗逻。
结业之所起，　愚惑生乐著；
二种重烦恼，　爱恚痴冥心。
谓初受生时，　兴二颠倒想：
于内生爱欲，　于外起瞋恚。
男有如是想，　女则上相违。
不净迦罗逻，　迦罗逻起泡，
从泡生肉段，　渐厚成支节，
出胎名婴儿，　转次为童子，
如是渐增长，　盛壮谓中年，
年逝形枯悴，　朽耄日衰老，
识灭寿命终，　身坏白骨现，
青毁节节离，　消碎尽磨灭，
如是十五种，　修行观自相。
始从迦罗逻，　次第衰老死；
七日渐毁变，　乃至灰灭尽。
宿世曾修行，　先从迦罗逻；
出生至老死，　次第谛观察。
白骨青赤相，　肢节皆离散，
骨琐及羸朽，　腐坏尽磨灭。
彼诸修行者，　思惟不净念，
有从因观察，　或果方便学；
成就深妙慧，　能了是相义。
观察迦罗逻，　乃至一切分，
四大和合净，　造色五情根。
无量极微种，　一切从彼起；
当复更观察，　死后次第相。
日日渐变异，　乃至于七日，
无复有来去，　视瞻笑语言，
容止悉已灭，　舍离威仪姿。
死尸渐渐异，　其色日毁变；
青等诸不净，　如是次第现。
膖胀脓烂溃，　流漫极臭处，
种种诸虫出，　见已离色欲。
观察本所著，　已坏食不尽；
离散在处处，　能灭全具欲。`,"上言端正非其本，亦应言全具。",`自见枯朽骨，　无复滋润相，
久故极麁澁，　能离细滑欲；
腐碎若尘塺，　磨灭无所有。
成就如是相，　远离有形欲（有形不必患是众生）；
五欲亦五坏，　随病而对治，
相对真实相，　修行正观察。
色变若离散，　威仪容止灭，
羸朽及磨碎，　是名五种坏。
此则自身中，　无量诸境界；
修行正忆念，　悉能得自在。
已说二无量，　自在及境界；
修行不自在，　亦已分别说。
于是不净念，　闻思与修慧，
正观开慧眼，　是说有三种。
作想有二种，　时复不想住；
俱开解思惟，　或时非开解（解即开也）。
第三性无垢，　离垢清净住；
不想不开解，　是慧修禅起。
起身寂止乐，　余二则不能；
心亦寂静乐，　是名为修慧。
滋润身柔软，　此则寂静相；
二俱不柔软，　当知非寂静。
彼二不寂静，　一则安隐住；
是说色有中，　修禅所起慧。
不净观一智，　依止十地起；
根本及未至，　亦说欲中间。
依住一界身，　境界于欲色；
化生既命终，　即灭无不净。
身净无余秽，　不能起厌患，
唯观彼生灭，　变易无常相。
胞胎所生身，　则有死尸形；
于身起净想，　不净观对治。
不求止贪欲，　思惟习厌患；
更有净对治，　不作厌患想。
方便净解脱，　智者开慧眼，
谓于不净缘，　白骨流光出。
从是次第起，　青色妙宝树，
黄赤若鲜白，　枝叶花亦然。
上服珠璎珞，　种种微妙色，
是则名修行，　净解方便相。
于彼不净身，　处处庄严现，
阶级次第上，　三昧然慧灯。
从彼一身出，　高广普周遍，
一切余身起，　庄严亦如是。
此则净解脱，　方便不净观，
若能须臾顷，　修习此胜观，
是则顺佛教，　堪受一切施，
世尊所称叹，　三界良福田。
说余一切相，　功德亦复然，
白骨青瘀想，　成就心厌离；
因是不净念，　方便度诸地。
所谓身念止，　受心法念处，
煖来及顶忍，　世间第一法，
见道及修道，　乃至漏尽智，
因是方便度，　一切功德地。
从初身念观，　乃至究竟处，
佛说不净念，　一切诸种子。
世尊说贪欲，　利入深无底，
正受对治药，　当修厌离想，
一切余烦恼，　悉能须臾治。
我已说不净，　方便升进法，
余有胜道进，　相行如前说。`,"不净念升进分第十一竟。","修行方便道不净决定分第十二",`不净升进分，　相义我已说，
今当说修行，　不净决定分。
不为恶戒缚，　亦非业烦恼，
心不背解脱，　欢喜常志乐。
如是随顺生，　麁澁四大灭。
柔软寂止乐，　三昧于中起，
从定生智慧，　修行能厌患。
厌想已修起，　则能离有爱；
思惟离有爱，　解脱实智生。
已生解脱智，　于缚得解脱，
从是得无为，　究竟离三有，
是说名修行，　成就决定分。
天王五威相，　观相坏烦恼，
漏过渐衰薄，　由是究竟灭。
人王有五相，　兽王相亦然；
诸地相明了，　说名为决定。
动身四顾视，　奋威畅大音，
自在独游步，　师子王威相。
于此十五相，　修行生决定，
能令彼地中，　一切诸垢灭。
系念三摩提，　出诸烦恼缚；
恶露不净想，　能生厌离心。
青瘀等诸想，　修行善决了；
更有余三想，　明想及观想，
第三说空想，　修习寂灭慧。
净色及自身，　所起诸烦恼，
贪欲瞋恚痴，　从是正观灭。
此一一诸想，　各三想眷属，
能除贪欲等，　结缚使恼缠。
是诸一切想，　明审善观察；
是名修行者，　决定不净想。
久故朽白骨，　踈瘠羸相现，
破碎若尘塺（音昧），　一切悉磨灭。
从下次第起，　方便坏所依，
净慧之所说，　修行决定相。
无量深妙种，　一切普周遍，
彼决定真实，　生如金翅鸟，
次起清净地，　平坦极庄严。
勇猛宝师子，　牛王若龙象，
此诸未曾类，　处处决定相。
始因不净生，　亦从不净长；
初起迦罗逻，　住于不净中。
观彼七日住，　念顷不暂停，
修行善明了，　是则说决定。
如是一切分，　悉能知相义，
明见彼真实，　念念有生灭。
因习诸骨想，　修行觉意生；
能起觉支想，　说名为决定。
彼诸修行者，　分别三种想：
或有始习行，　或已少习行，
或有久修习，　是悉近决定。
随彼智慧力，　趣向有差别。
初业者始起，　少习心已住，
久学能趣缘，　是说三种修。
初业名始种，　第二为长养，
最后能舍离，　说名为决定。
不净有二种，　或共或非共，
如前三眷属，　是离共不净。
闻思与修慧，　三种不净念，
于此一切种，　修行谛明了；
善分别离欲，　是说名决定。`,"不净决定分第十二竟。","修行观界第十三",`安般不净念，　退住与升进，
决定真实相，　悉已分别说；
修行界方便，　广略差别相，
甚深微妙义，　今当次第说。
有因先修习，　安般不净念，
然后观诸界，　安乐速究竟；
自以方便度，　此苦难成就。
顶上两眉间，　系念令不乱；
寂止润泽生，　三摩提增长。
所依已柔软，　三昧安不动；
扰乱不净心，　智者悉调伏。
已随调伏心，　安住修行处；
是处起明想，　一切身分现。
初从一发始，　如其相忆念；
于一见自相，　然后总众发。
次第三十六，　自相总亦然；
佛说三十六，　各各有住处。
或时彼诸界，　合聚内观察；
犹如明眼人，　开仓见五谷。
时复有逆顺，　超越次第观。
一界藉其下，　余种悉处上，
次第相连持，　一一知其相，
杂色不杂色，　周满悉观察。
止心在一处，　境界遍十方；
处处安置已，　依是勤修习。
一发为百分，　思惟正忆念；
复于一分中，　分别五种界。
次于空界上，　识相别观察。
修行见无垢，　清净妙相生，
譬如水上泡，　明净无障翳。
是处观诸界，　各各见自相，
水湿地坚强，　风动火烧热；
虚空无障碍，　别知是识相。
青黄赤白绿，　及与颇梨色，
于此众杂色，　修行具足观。
虚空坚固相，　弥广周遍住，
难沮喻金刚，　金刚慧能坏；
于上曼荼罗，　则有熟相现。
譬如火炽然，　能破彼坚固。
或见生疑怪，　其心大恐怖；
明者能决定，　增益诸功德。
已坏虚空界，　能起升进相，
融坏若流注，　复碎如尘塺；
修行见真实，　则生解脱相。
空界既已坏，　上诸界亦然；
是则坏相上，　有余坏相起。
若复余一种，　于上观诸界，
次第普周遍，　俱坏如前说。
观察六六种，　六三及四二；
如是六十二，　世尊略说界。
色坏有三种，　刹那世极微；
无色唯二种，　无为无坏相。
修界不净念，　则能舍贪欲；
顺界方便观，　是治我慢药。
观界四无量，　除灭瞋恚毒（一无常顷名刹那）。
阿难说是言：　当修五念处。
世尊告之曰：　更有第六念。
发毛爪齿骨、　筋肉厚薄皮、
肪𦙽髓脑膜、　脾肾心肝肺、
胞胃大小肠、　屎尿脓涕唾、
垢污诸血泪、　黄白及痰癊，
三十六不净。　观察三种界，
是中湿相水，　火热地坚强，
诸有形色处，　内外飘动相。
出入息语言，　通利等回转；
一切总说五，　是相名风界。
眼耳鼻舌身，　毛孔咽喉空，
山岩室宅中，　内外无障碍；
如是一切种，　悉名为空界。
于彼六情根，　所生诸识种；
如是多无量，　总说名识界。
佛言应当知，　六界非有我。
不观阴界相，　计我及我所，
一切内外界，　是处意回转。
从是意行处，　三受十八种，
六触及四处，　世尊之所说。
爱慢诸烦恼，　悉于是中起；
是身众微合，　虚妄空无主；
非我非众生，　迷惑计真实。
佛告罗睺罗，　观界悉无常；
如是六种界，　说从六处起。
修习六巧便，　六时各观一；
色处悉具足，　无色唯识界。
彼种所依处，　相行地境界；
对治与所治，　如实知分数。
身中诸界种，　还自生苦恼；
譬如养毒蛇，　终为彼所害。
四大生造色，　即共造色住；
和合相间错，　还为四大坏。
不净方便观，　先于造色起；
安般方便念，　要从四大始。
若彼修行者，　增广二方便，
四大及造色，　和合等观察。
始入根本处，　彼先坏造色；
入已然后观，　所因四大坏。
定慧渐增广，　念处具成就；
和合总观察，　一切悉寂灭。
彼三十六物，　臭秽坏磨灭；
此三与十想，　修行增厌离。
佛说是根本，　能及一切恶。
四十九种法，　三昧于中起，
修行谛观察，　自身及欲界，
无量不净种，　秽恶悉充满。
众苦所逼迫，　盛火极炽然；
无常变坏相，　见已生厌离。
色界相似种，　微妙相显现；
深乐求出离，　增进厌患想。
有觉亦有观，　离欲生喜乐；
寂然入初禅，　内外悉清净。
所依及境界，　如练真金像；
自身处梵世，　于中极娱乐。
又见五支相，　身及境界现；
第二灭觉观，　内净心一处。
从定生喜乐，　四支身内现；
所依及境界，　譬如真珊瑚。
第三处离喜，　行舍念慧除；
身受乐三昧，　五支相明了。
所依青琉璃，　清净甚微妙；
缘少身无量，　诸相次第起。
第四断苦乐，　忧喜先已灭；
不苦不乐舍，　念净三摩提。
如是四支相，　现身及境界；
出息入息灭，　所依极淳白。
过色灭有对，　是说入空处；
过空相识定，　过识无所有。
过是无所有，　非想非非想；
善知诸界相，　不味亦不缚。
清净四梵行，　高广无有量；
慈悲普周遍，　喜舍亦复然。
根本四禅中，　修起五神通；
三昧现在前，　系心观自身。
作轻及软想，　渐举不令动；
境界现在前，　离地如胡麻；
稍进如大麦，　转次高四指。
此床至彼床，　渐渐能随意；
飞行及变化，　自在无障碍；
是名修行者，　微妙神通力。
系心于自身，　禅定现在前；
谛取外音声，　如其实皆闻。
系心于自身，　禅定现在前；
观他心所念，　一切皆悉知。
系心于自身，　禅定现在前；
自忆念此生，　从胎及中阴；
渐见前身事，　乃至百千劫；
一切诸所更，　如实忆念知。
系心于自身，　禅定现在前；
观察众生类，　生死及形色，
随其业果报，　中阴五道生。
修行天眼净，　一切如实见；
根本诸地中，　无量余功德；
修行心自在，　一切悉具足。
所谓八背舍，　胜处一切入，
背舍相有五，　不净与净相、
色相、烦恼、识，　略说是五相。
胜处先自身，　内色外少色；
若好若丑一，　外多二亦然。
内无有色想，　外观少多色；
二俱若好丑，　是前四胜处。
后四内无色，　外青黄赤白，
一切入四大。　四色与空识，
观外及内身，　一相无差别。
诸辩妙愿智，　无诤三摩提；
逆顺与超越，　无量三昧门。
明智决定观，　具足五种满。
一身二境界，　定相普周遍；
第三忆念满，　修行喜厌舍；
第四诸地满，　十处相明了；
三乘根具足，　是说第五满。
界方便成就，　久远痴冥灭，
能令意清净，　无垢如虚空。
如是诸功德，　一切悉究竟。`,"观界第十三竟。","修行四无量三昧第十四","修行者若欲广修慈心，先当系心所缘，渐习令无量。灭除过恶心，不诤竞，亦无怨结，无恚清净。谓于亲、中、怨三种，九品众生，无量无数，安处十方，尽三分际，淳一乐行。唯除国土世界，于众生世界周普总缘，成就游行者，修慈方便，先等心思惟，总缘一切众生，令心坚固，灭除瞋恚而起慈心，是名总观慈无量三昧。","如是总观，犹为瞋恚所缚者，当于上亲修别相慈，次于中亲、下亲、中人、怨家，次第修习九品慈心，渐离瞋恚，心生爱念，与种种乐具。与是乐已，然后于一切众生起法饶益心，修三种慈：广大慈、极远慈、无量慈。舍除瞋碍，住仁爱心，随其所应功德善根，一切佛法皆悉与之，谓与种种法乐，修种种慈，先与出家乐，次与禅定正受乐，次与菩提乐，次与寂灭乐。彼修行者本曾所更及所未更，种种乐具，自得、他得，清净善根，乃至无上寂灭，究竟无为，随其修行，意所想念，无量法乐等，与众生相现在前。乐想起已，一一观察，以相自证，便得决定。犹如明镜，因物像现；慈三昧镜，亦因乐事，种种乐相，悉现在前。","或时修行为瞋恚所乱，作是思惟：「我从本来，由是瞋恚，多所杀害，兴诸罪逆，入于恶道，于大地狱，还受苦毒；或作蜂虿、蜈蚣、毒蛇、恶龙、害鬼、罗刹，如是种种毒害之类，今不除灭，复见烧迫。」以是方便，能止瞋恚。又复思惟：「骂者、受者，彼我无常，须臾不住，二俱过去。恶声已灭，后起二人无故共诤。又今二人念念即灭，虚妄无实，谁骂谁受？何为颠倒与空共鬪？计我耳根，从虚妄颠倒烦恼业起，彼人舌根，亦复如是，因缘生灭，谁骂谁闻？」修行如是思惟时，瞋恚缚解，能修慈心，离垢清净。如佛说：「修慈者于四念处能得决定，修习增广，成就无量法门，胜妙道果，不复退还。」是则三种方便大慈。若已离欲，更修净妙离欲慈心，深心饶益，增广无量，得真实果。因此功德具足，所愿究竟涅槃。所以者何？一切诸佛说慈为无畏，慈为一切功德之母，慈为一切功德钻燧，慈能消灭凶暴诸恶，是故修行当勤方便，修离欲大慈。","悲无量者，如慈境界怨亲中人，悲亦如是，次第修习。如佛言曰：「饶益众生，说名慈心；除不饶益，说名悲心。」若先于众生起饶益心，以种种乐，具悉施与之，然后观众生，唯见受乐，是名慈心；若先观众生受无量苦，起除不饶益心，然后见众生除不饶益；除不饶益已，受种种乐，非与乐也，是名悲心。见净相是慈，见虚空相是悲；乐行是慈，苦行是悲，是则差别。谓修行者见诸众生凶暴诤怒、残贼杀害，共相逼迫，无有覆护。如是见已，而起悲心，为作覆护。又见众生，斩截身、首、耳、鼻，肢体苦痛无量，无能救者，修行见已，而起悲心。又修行住悲心时，见五趣众生苦痛炽然，无量烧迫，深起悲心，兴救护想。如是修行悲无量善根生时，无量功德相现。若见此众生受无量苦而不起悲，是则极恶无善根人。如是大悲，一切诸佛，本所修习，由是究竟一切智海；行者若能具足修习，当知不久，必到是处。","喜无量者，谓修行于慈境界，以六思念等诸善功德，无量佛法，及自身成就戒定智慧，一切功德，饶益众生，自乐他乐，尽皆与之。见一切众生得法乐已，其心欢喜；其心欢喜，则忧戚灭；忧戚灭已，一向欣悦，踊跃欢喜，念言快哉，永使安乐。于一切众生欢喜时，见有乐相，轻微明净，成就此相，名为喜无量三昧。如佛说：「修集喜等，乃至识处。」","舍无量者，舍怨亲已，等缘中品，此唯是众生，无有差别。离慈悲喜，唯作众生行近、境界近相，是故世尊说舍。种种舍各自有相，舍无量不与彼同，谓平等清净，离苦乐相。舍相似相现，是名舍无量三昧。世尊说修舍无量，乃至无所有处。已略说四无量相，余种种甚深相，行者应次第修习。","修行观阴第十五","若修行者，久积功德，曾习禅定，少闻开示，发其本缘，即能思惟，观察五阴，了达深法，灭除生死；犹如大风飘散重云，亦断一切魔所乐法。观五阴义，今当说。修行者，内自思惟，欲渡烦恼海，起离欲，生润泽，自身快乐，麁澁四大灭。随顺四大生，摄诸乱意，能趣究竟，成就智慧。若根本观处，坚固明净，能起三昧，离诸乱想，灭除烦恼，诸微妙相，于是悉现。如净妙瑠璃，如水净泡。行者见此明净无垢相起，善念守持，心不放逸；既不放逸，则熟相起；熟相起已，坏相现；坏相现已，唯起法想，一切寂灭。如是修行法相，具足成就，得增上厌离意；坚固精进，不可动转，得甚深三昧、坚固三昧、不动三昧。修行住是三昧，能起五种明净三昧，遍照五道：月光三昧、日光三昧、净瑠璃三昧、练金光三昧、无垢颇梨三昧。因此五种明净三昧，复生光耀三昧、遍光耀三昧、无量光耀三昧。","复次，修行者因五种坏相能坏诸缘：一曰穿、二曰剥、三曰裂、四曰坏、五曰灭。以是五坏相，坏一切法。修行五种三昧坏境界，悉清净已，次复生五种三昧相：师子王三昧、龙王三昧、金翅鸟王三昧、牛王三昧、象王三昧。心无放逸故，起此雄相。修行住此兽王三昧，各随其类，一切悉摄。又三昧力、男女十相起，随类相摄，一切众生，于是悉现。若能分别此诸三昧相而不恐怖，是则名曰于一切诸法自在功德。","复次，修行者于明净境界观察阴流从一处出，分为二分。如是观已，还合为一。一一流中，复见五相；相各别异，布列境界；布列境界已，还合为一。色如聚沫，受如水泡，观想如炎，行如芭蕉，观识如幻，是五虚妄，欺诳之相。修行如是观已，其身安隐，柔软快乐。复观流所起处，无垢相现，如水净泡，渐渐增长，充满其身。修行心不放逸，专念受持；持已，净相增广，周遍覆身，如明净泡，离诸过恶。更胜妙智生，乃坏是相；是相既坏，彼流流下，远注无量，如净颇梨，极知境界；极知境界已，从彼摄还，成曼荼罗。更有异相，充满本处，然后流至十方无量世界，至十方已，各住自相。尔时修行明见无量色种，犹如山水漂积聚沫；一切受相，如大雨渧泡；种种诸想，如春时焰；行如芭蕉，无有坚实；观六识种，犹如幻化。如是种种虚妄，但欺诳愚夫，是名修行观阴自相。观阴自相已，复以智慧，自照其身，专念观察。观察时，见周匝炽然，相起身处，其内有种种杂华、净妙、珍宝，周匝绕身；又自见身种种杂宝、诸功德相，微妙庄严。修行见是诸相已，慧眼开广，自顾其身，周遍观察；观察已，复外观阴相，盛火炽然，即生厌心，勇猛精进，欲度生死无边苦海。修行于五阴炽然相厌离已，离欲相、解脱相、涅槃相、一切功德相，次第起现。","复次，修行者具七处观，观五阴、苦、集、灭、道。复观因爱生五阴，厌患出离，如是于真谛中，方便种子慧生。于是七处，善修三种观义，自相观成；成就决定坚固已，然后得无垢息止修慧；是慧起已，境界平正，淳一无杂。复次，得胜妙无垢思慧决定观，五阴兴衰，念念磨灭，见真实相。譬如毒饭，食者必死；修行观五阴三相，所杂亦复如是。一念生，一念苦，即一念时，亦生、亦住、亦灭。彼念生时，即与苦俱生。是故一念，一念即坏。修行观五阴如是，生灭破坏，虚伪无常过恶，即起无常行、苦行、空寂行、无我行、穿漏法、不实法、速朽法、破坏法。如是无常义，如修多罗广说，乃至百句。修行尽行如是诸相，知诸法真实，便得解脱。以贤圣地三昧想行，观此非常相，便起深忧厌，见有为过患，不乐三有。","复次，修行者若观生则非灭，若观灭则非生，如是则不生圣行；要一心一相，正向解脱，然后智生，是决定圣行。圣行既起，一切法相寂灭无余，痴爱烦恼及诸罪垢，能转苦阴者，皆悉除灭。灭已，其心调伏，是见五阴无我亦无我所。以无常诸行观察苦阴，观察苦阴有八苦逼迫，于八苦相成就八行。所谓如病、如痈、如刺、如杀、无常、苦、空、无我，四是圣行，四非圣行，于苦阴决定，观其真实。如是四谛十六圣行，是则修行煖法初相，于真谛地，得真实慧。观察苦阴如烧铁丸，亦无坚固，向涅槃，背生死；不贵有，不乐生。譬如群兽，猎师围逼，以怖急力故，超勇奔出。修行如是，见生死炽然，大苦围迫，以厌智力，超出无碍。","复次，修行者思慧生时，煖法种起；息止修慧生时，煖种增长，到煖自地，煖相满足。息止修慧生时，顶法种起；煖法生时，顶种增长；到顶自地，顶相满足。煖法生时，忍法种起；顶法生时，忍种增长；到忍自地，忍相满足。","复次，于五阴悦可，名为煖法。煖法观五阴，于三宝悦可，名为顶法。顶法观十八界，于四谛悦可，名为忍法。忍法观十二入，俱观三种，随彼善根，一增上故，说有差别。是一切尽观真谛，但忍于真实观增，煖法想增，顶法信观喜增，忍法智慧增。","复次，修行有三种缘，谓上、下、诸方。三种善根，依此三缘，各一增上，故说（悦可本云出设）。","复次，三种修煖依厌离顶，依观喜忍，依平等舍，亦随彼善根一增上，故说当知一种修尽，成就三法。","复次，修行当知！譬如有人有五怨贼，拔刀随逐，常欲加害；前后五阴转相煎逼，亦复如是。佛言：「欲求阿鼻三磨耶（此是见道名也），当作达磨摩那斯伽逻。」常观真实义，以圣行刀断除阴贼，莫如劣夫，不能执杖，为彼所害。乃至一切贤圣，皆应勤修如是正观，为现法乐故，为后世作大明故，断一切苦本故，饶益众生故。况于凡夫，空无所得，而自放逸，不勤修习。","观五阴竟。","达磨摩那斯伽逻：达磨，法，谓世间第一法也。摩那斯伽逻，谓一经心，译者义言思惟。","修行观入第十六","六入各于境界缚无智众生，贪欲心故，常起净想。修行当知，于诸根境界，防制非法，摄心所缘，系令不动，正观六入。譬如空村，离我我所不定义，是入处义、牵下义，是入处义能将众生入恶道。又内入相，如烧铁锵，如极利剑，亦如利刀。佛言：「若观此相，则能舍离。」复次，观外入恶贼劫善珍宝。若修行舍正念，开诸入门，驰纵六境；六境恶贼劫夺净戒，失诸功德。如鸟无两翼而欲飞空，人无两足而欲远游。修行如是，毁净戒功德故，止、观两翅永不复生，欲出生死是终不能。如破瓶盛水，须臾不住，破戒比丘，亦复如是，三昧法水，念顷不住。如天德瓶守护不坏，常出珍宝，随意无尽；修行如是，不毁净戒，则常出生圣功德宝。轻坏德瓶，珍宝即灭；若破戒瓶，则永失法宝。譬人截鼻，照镜不自喜乐，破戒比丘，亦复如是，内省其身，心不自悦。百谷药木，依地而生，诸善功德，悉依净戒。如栴檀涂身，能除热恼；净戒清凉，能止欲火。如如意宝珠，随所著处，热时清凉；净戒如是，于烦恼火中，能息炽然。犯戒比丘自惟罪深，身逝命终，必入恶道，心常忧悔，死时恐怖；净戒之人，心常欢喜，生无忧悔，死时安乐。净戒为梯，能升慧堂。戒为庄严具，亦为善戍卫；戒能将人至于涅槃；戒为良地，生十善种子。教诫师水，随时溉灌，信根则生，无漏阴为干，四如意为芽，慈心为枝条，少欲知足为柯叶，七觉意为华，解脱智为果，寂灭法为甘露。戒香流出，一切普熏。贤圣鸟王，栖宿其间；悲为重阴，清凉广覆；辩才法师为蜜蜂王，和声相顾，甞采精味。其树修直，坚固贞实，无有虚伪、谄曲、腐病，是则名曰功德大树。诸修行者欲趣涅槃，背三世苦，向解脱城，渐次发行诸善功德，息彼树下，饮法甘露，止三渴患，其身安隐，能至涅槃。","复次，戒有众多数，或一、二、三、四，或七，或十二，或二十一。若念念须臾顷，则有无量戒种。道共、定共、俱生戒，正语、正业、正命，与心回转。观此诸戒，其相各别，或淳净无垢，或轻薄明净；如是无垢戒相，现于境界。修行于依缘念三处观察戒相，若涂香柔软，离垢悦乐，明净洁白，是所依中相；若其地平广，妙华宝器，严饰之具，众宝滑泽，是名修行境界中相。譬如牦牛护尾，一毛著树，守树而死，不令毛断。比丘护戒，亦复如是，一微之戒，守死不犯；妙相严身，众好具足，犹如秋月，停照虚空。修行三昧，观此净相已，乃至命终，无复忧悔，亦无热恼，不复恐怖，安悦欢喜，踊跃增长，生寂止乐，麁澁四大灭，如是等名修行忆念中相。复次，三种中更有杂相，娆乱障碍，失念意不住。请求悔过，不善恶业，守死不为，梦中无犯，增益持戒。佛说：「戒为花鬘涂香，庄严众具；香风一方来是世界香，诸方来是戒德香。」或身无手、足、眼、耳、鼻、舌，一切肢节，悉不皃具；或身没尘埃；或观察自身，离诸尘垢，澡浴涂身，名衣上服，是名修行。于依缘忆念观察，尸罗种种，杂相威仪。定共、道共三种戒，悉已于中说此三种戒，更有无量诸深妙相，明智者当广演说。","修行已观净戒，欲破诸入山者，当修二法，所谓止、观。先当观离恶悦乐，充满其身，麁澁四大灭，柔顺四大生，趣寂止乐，一心不乱。自于内身系心于入相，当善守护入相所起处。观察时，白净相起，比丘见此相，当善守护，如佛所说。譬如伏鸡善护其子，必得成就；比丘修行，亦复如是，专精守护，乃得成就；十二修果，相现分明。修行善守护时，离诸放逸；修果成就，境界净妙，离诸垢污。明如宝珠，亦如悬水，境界广满，身处少分，周遍远流，然后来还。还已，一相现，复分为二分，还合为一，成曼荼逻境界。安住平正，普现众相，犹如众星光耀布列，然后乃坏。坏已，各各流出，还合为一；复周遍远流，充满诸方；充满诸方已，复还安隐坚住；住已，熟相现；熟相现已，有种种众相，周遍弥广，微妙器服，诸奇特相悉现。境界内入空聚，外色、声、香、味、触及三世三种法，善、不善、无记，一切悉现，观其真实。","复次，外六入如贼，内六入如空聚，亦说内外入为此彼岸。此十二入诸胜妙相，增广无量，佛说修多罗中广说。","复次，修行者，于此境界熟相起，起已复坏，间间有断离相，断离相流注极远，停住一处。如宝瓶盛水，然后还开，渐见寂灭；寂灭已，复有诸余一切功德相生。诸入门中常杂相流出，各各出已，复于一处，成曼荼逻。曼荼逻上，复有自相起；起已复熟，熟已不久寂灭。然后修行复加专精，更现清净微妙禅相，现已如前，次第寂灭。","复次，修行于诸入中更有种种妙相，于系心处决定相起，名髻中明珠喻三昧。修行自观身作二分，众宝藏上有宝莲花；修行自见身在莲花上，众宝妙花，庄严围绕。复次，如世尊修多罗说六众生喻，行者于此具足观察。所谓眼为狗，走逐五色村；耳为鸟，随空声起；鼻为毒蛇；随逐香穴；舌为野干，贪五味死尸；身为输收磨罗，常乐入触海；意为猨猴，常乐游纵三世法林。若六种众生，系著一处，不能自在，各游所乐。修行如是，以三昧正念，系缚六根，不令自在驰散所缘，然后以清净智观法真实。痴冥凡夫六境中，贪著悕望无量恶法，如是正观，悉能除灭一切众生乐著境界，自起障碍，不至涅槃。是故修行欲坏生死、趣涅槃者，当降伏诸根，远离境界。","修行观十二因缘第十七","已说诸对治及所治，愚痴对治，是应分别。一切诸佛所说缘起，灭除痴冥，生如实智。有甚深微妙随顺功德，今当略说，令诸修行功德增益，灭除愚痴。观察缘起，远离断、常二边诸想，知因缘和合，有为法生；亦能降伏迷醉外道，牵令随顺，第一空法，慧眼明净，无明悉灭。修行观缘起有四种：一名连缚、二名流注、三名分段、四名刹那。","连缚有六种：一曰生、二曰分、三曰趣、四曰生门、五曰刹那、六曰成坏。生者从死阴，次起中阴；中阴次起生阴。中阴众生，无明昏乱，愚痴所盲，造作有业。中阴众生，见男女和合，无明增故，生颠倒想，或生害想，或生爱想；欲与女俱者，于男生害心，然后自见与彼和合。尔时欲心迷醉，是名爱起身；见和合不净，谓为己有，是名慢起身；因母饮食而得增长，令身敷起，是名食起身；四大与迦罗逻俱生得报身，是名四大起身。","结业为方便，二支既过，次第识种生，是名种子识。始处迦罗逻时，其心沉没，少所识知，识不明利，是名为生得迦罗逻。已识明利故，是名为识，是名生连缚也。分段者，从迦罗逻，次起疱、肉段、坚厚、肢节、婴儿、童子、盛、壮、衰分、老分次第生，是名分连缚也。趣者，谓遍至诸趣，修行观诸趣相，是名趣连缚也。生门者，谓四生相续，轮回不绝，是名生门连缚也。刹那者，观五阴，念念相续，生灭不断，是名刹那连缚也。成坏者，一切境界起灭，劫数始终，修行观此成坏相续，名为成坏连缚也。是则修行观缘起连缚也。","流注者，谓修行观刹那流至怛刹那，乃至罗婆摩睺路妬，是名流注迦罗逻分。流注七日，疱、肉段、坚厚，乃至衰老分，是名流注。起分、住分、起缘分、入分、出分、方便分，一切正受，巧便流注，次第起尽，名流注。诸趣回转，如旋火轮，是名流注。如是一切无量流注，是则修行观缘起。流注分段者，修行观察，从分至分，故说分段能如是知，则于缘起成就。","谓无明增上，犹如盲人无有见相，如大黑冥，远离光明；或于前无见，或于后无见，是则偏盲；若前后无见，是二俱盲；若离二盲，则舍痴冥，得明净慧眼。如是苦集灭道，佛法僧宝无知，是名十种痴；十种痴灭，名为十种慧。佛说无明为初因，种三种业。若修行不知无明过患，则种三种业。业起已，从是生识，诸识如幻，种种悉现；从识相续，起名色，于彼一身，而有二相。譬如虚软沮烂之物，内有诸虫，令外动摇；亦如野蚕，初作茧膜；名色二相，亦复如是。乃至诸根未成，说为名色二相；诸根既开，名为六入。诸根始开，未有所作，于触愚痴，不知适与不适。如雨渧注水，水则泡起；情尘生触，亦复如是，外刺刺身，触从中起。亦如然灯油炷所成，是名修行观尔炎触相。触相起已，次第生受。譬如水泡，三种相现，若分别诸根，则有五受。受起已，次生渴爱。譬如舌舐蜜涂刀刃，爱增诸烦恼名为取。取次生有，有三种业，业起当来果，故名为有。已种生而未受，名为未来生，生已熟，谓为老死。二支说未来生时，生相增上。佛说识分、未来识生时，名为生；名色、六入、触、受，名为老死。前生爱、取、有能集今有故，于此生为过去。爱取是烦恼分，故说为无明；有则是行。现在三支能种来生、过去二枝，转生死轮。彼众生轮转，以无明复故。八现在，二过去，二未来世差别故，如是分别，当知转时，一切皆十二。","复次，更有余分因缘，今当说。从迦罗逻、疱、肉段、坚厚、肢节、婴儿、童子、壮年、衰分、老死分，于是十种分观察缘起。复次，于起住起缘入出方便分，乃至余一切分，悉观缘起。复次，是事起故是事起，谓彼眼色能起眼识，三事和合，触生受、想、思，是名修行异种观缘起。复次，修行方便，观诸入缘起，以明净境界，自向观诸入门；如是见已，各观自相处，破诸入山，无量积聚；熟相现已，流注十方。极智境界，到彼观察，明智升进者，修住巧便。尔时闻、思、修慧，熟相、坏相，次第而起，诸余升进，义如前入处说。复次，是事有故是事有；是事起故是事起。谓修行者，先坏内身，次观外色；犹如照镜，因物像现。如是所依相起，外相亦起也。","复次，修行于诸不净观其缘起，先于方便处，系念令坚固，然后于肢节分解，观其缘起。起明相已，无明相坏。依脚骨、有𨄔骨、髀骨、跨骨、肩骨、颈骨、头骨，充满十方，有漏业相普现，于下诸杂不净相，阶级次第起。","复次，修行观四因能生众苦：展转因、隣近因、周普因、不共因。复次，修行观果从生因、生从有因、有从取因，如是乃至行从无明因。行是果，亦是因；从因推果，还至老死亦如是。若于无明求因，必大恐怖，而起断见。无智暗冥，余明甚微，犹如萤火。如是犹复求因不已，自见唯与大黑暗俱。世尊说言：「由不正思惟，众生若与是俱，则轮转生死。」无明缚故，有轮常转。无明为本，余支所作，各有相现。一切有支轮，无明最自在。自在力所转，如奴属其主，是无故是不作，是灭故是不转，当知余枝皆如是说。","死有四种：渐渐死、顿死、行尽死、刹那死。又说三种无常：一、刹那无常，二、分段无常，三、种类无常。修行了此无常，则远离四魔，破坏无明，明相显现。如明净灯，能消众冥，乃至老死灭，诸明相起，亦复如是。破坏无明，诸积聚已，成就一相，净妙境界。行者身体柔软光泽，光泽已，身极明净，如明镜像；如是相现明净，观己身内众物，各各自相，一切显现。如是观成就，名曰于界得度。何以故？有五种痴，五种对治相。一、界，二、入，三、阴，四、卑贱，五、垢污，是名五种痴。或观界得度，或复观阴、观入、观彼增功德、观第一义而得度者，是名五种对治也。","复次，修行者入快净琉璃三昧，于明净境界观缘起支。观缘起枝时，便生易见想如说。阿难白佛言：「缘起易见？」佛告阿难：「十二缘起甚深无底，难见难知。汝欲毁坏我三阿僧祇劫甚深微妙难得之果，云何欣悦而说是言是深妙观？我今当度，汝当随我观佛境界。佛境界海浮漂，外道无智暗冥，二边愚痴，离尔炎境界所不能入。声闻、辟支佛虽能少入，不得其底。」尔时世尊说是语已，即入甚深微妙尔炎住三昧自在正受。正受境界有三师子王，师子王上各有七宝池，七宝池中各有七宝莲华，七宝莲花上皆有坐佛，放大光明，极声闻境界，然后乃住。是诸声闻从初发心至最后身，所种善根及诸缘起一切悉现。从是复起三师子王，师子王上各有七宝池，七宝池中各有七宝莲花，七宝莲花上皆有坐佛，放大光明，极辟支佛境界，然后乃住。诸辟支佛从初发心乃至究竟，所种善根及诸缘起一切悉现。从是复起无量师子王，师子王上各有七宝池，七宝池中各有七宝莲花，一一花上皆有坐佛，普放光明，极菩萨境界，然后乃住。是诸菩萨从初发心至金刚座，所修善根、一切功德、若业、若果及诸缘起，一切悉现。从是复起无量师子王，师子王上各有七宝池，七宝池中各有七宝莲花，一一花上皆有坐佛，放大光明，普照佛法，甚深缘起，一切悉现。","尔时佛以神力示阿难佛之境界已，语阿难言：「尔炎中更有无量无边诸佛境界，佛智所行，如是甚深微妙境界，云何欣悦而言易见？汝智浅不及，谓为易见耳。如上尔炎境界无量诸法现在前已，然后乃坏，一切皆空，清净寂灭；寂灭已，复观胜妙。尔炎起佛法身，渐渐广大，周满十方；无量法宝，充满法身。法身光明，无有边际，不共智慧，所行境界。一切佛法甚深缘起，悉现在前，然后乃坏，一切皆空，清净寂灭，无有处所；犹如虚空，无所依止。如宝入手，名为得宝；修果如是，名决定相。阿难！如来境界不可思议，我今为汝示少少耳。」阿难见佛境界，欢喜踊跃，白佛言：「甚深。世尊！世尊尔炎境界，难得其底。若我先知如来境界如是深妙者，宁使我身碎如胡麻，要当究竟佛法彼岸。」","如是一切名修行观缘起。分叚刹那者，三世一刹那，一刹那三世。法未起名未来，起时名现在，已起名过去。一刹那生即一刹那，苦与无常俱故。当知众行，刹那顷不住，亦无所从来去，亦无所至，虽转亦无所去，去亦无积聚。一刹那起，一刹那灭；刹那如一念，一念如刹那。前刹那聚已灭，灭时与后起。随顺四缘具足；后刹那起，修行境界。观一刹那间，有无量微尘；无量微尘，一一刹那，次第相续，犹如连珠。譬如四善射人，俱放四箭。有一人健行，箭未至地，能就空中接取四箭，不令落地。地神迅疾复过于是，虚空神疾过于地神，日月天疾过虚空天，如是健行天疾倍过日月。当知诸行无常，迅过于是，不可譬喻。如修行观迦罗逻七日住分有无量刹那，当知余一切分亦如是。如是观已，离诸愚痴，增益明慧，如是无量，名修行观缘起刹那。","复次，修行初入正受，名为连缚境界，增长名为流注方便境界，安住名为分段境界，渐灭名为刹那。","复次，已说四种别相观缘起，佛说总缘起，今当说二支种、二支熟、二支起、二支牵、所种二支、生长二支、成就二支、受二支、作人二支、田二支、寄者二支、所寄二支。受寄者是说名有支。修行观缘起，或五阴，或四阴。五阴欲色界，四阴无色界。无常、空等诸行，于阴决定真实。决定真实已，决定相现在前。是事有故是事有，是事起故是事起，是事无故是事无，是灭故是不作。譬如有钻有燧，有人方便烟火，乃出因薪炽然。亦如因树有荫，因日有光，因灯有焰，皆从缘起。无明不言，我能生行；行亦不言，我从无明生。当知一切有支皆如是，是空法、寂灭法、无所有法，作者不可得。但有无明诸行和合，有漏法生。受为轴，转有支轮，生诸结缚。诸结中爱支增，诸缚中取支增，诸使中识支增，诸缠中无明增。向生结增，受生缚增，诸识漂利使增，于境界愚痴烦恼增。如是烦恼业缚能转生果，有轮常转漂。无智众生随义增故，说有差别，当知诸分皆有结缚使缠。","复次，修行六种观十二缘起，于十二支随顺义说。谓安般念观业支、有支，以出息、入息是身行，觉观是口行，想思是意行，是故安般念是彼对治。界方便观，观识支、生支，识增上故处胎，识于诸界增上说七识界，是故界方便观是彼对治。阴方便观，观名色支、老死支，是故阴方便观是彼对治。破诸入出方便观，观六入支、触支，是故入方便观是彼对治。缘起方便观，观无明支、受支，是故缘起方便观是彼对治。何以故？受及无明是诸烦恼根本，是故智慧是彼对治；爱、取二支染著净故，不净是对治。","复次，修行观十二缘，或时从因度，或时从果度，或从无明行乃至老死，或观识乃至老死，或三事和合生触、触生受、受生爱、爱生取乃至老死，或从爱、取、有、生、老死，或从老死乃至无明，或观老死乃至识，如《佛城喻经》说。","复次，修行于四念处观十二支各增上：身念处观六入支，受念处观受支，心念处观识名色支，法念处总观余支。说此义已，而说赞偈曰：",`方便治地行，　乃至究竟处，
无上法施主，　说是传至今。
我从彼胜闻，　撰说深妙义，
章句庄严集，　欲令法久住。
佛法深无底，　修行亦无边，
以我少智力，　宣扬无量法。
是深非所测，　如蚊尝大海；
唯彼已度者，　然后乃究竟。`,"六十二界：六种、六情、六尘、六识、六界、六觉，谓贪、恚、痴三不净觉；反是，三净觉也，苦、乐、不苦不乐、忧、喜、舍六。","三：欲、色、无色界，又色、无色、灭界三世法，软、中、上法，善、不善、无记法，学、无学、非学、非无学四。二者：食非食、漏无漏，依欲、依出要，有为、无为。","三十六不净次第：发、毛、爪、齿、薄皮、厚皮、筋、肉、骨、髓、脾、肾、心、肝、肺、小肠、大肠、胃、胞、屎、尿、垢污、泪、涕、唾、脓、血、黄白痰、癊、肪、𦙽脑、膜。","刹那数：百二十刹那名一怛刹那，六十怛刹那名一罗婆，三十罗婆名一摩睺路妬，三十摩睺路妬名一日一夜。一岁中唯二时二日，三十摩睺路妬昼夜等。","谓羯提月白分，八日八月名羯提，后半月名为白分。陛舍佉月白分，八日二月名陛舍佉，后半月名白分。此二时二日，昼夜各十五摩睺路妬；从是后，罗婆流，或昼减夜增，或夜减昼增，名为流昼夜等，各三十摩睺路妬。"],source:"https://cbetaonline.dila.edu.tw/zh/T15n0618",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T15/T15n0618.xml",sourceLabel:"CBETA T15n0618",scope:"全2卷正文（不含序跋、目录、附录）",originalTitle:"達摩多羅禪經",juan:[1,2]},{id:"cbeta-t16n0666",title:"大方等如来藏经",subtitle:"大方等如来藏经 · 东晋 佛陀跋陀罗译",paragraphs:["如是我闻：","一时佛在王舍城耆阇崛山中，宝月讲堂栴檀重阁，成佛十年与大比丘众百千人俱，菩萨摩诃萨六十恒河沙，皆悉成就大精进力，已曾供养百千亿那由他诸佛，皆悉能转不退法轮，若有众生闻其名者，于无上道终不退转，其名曰：法慧菩萨、师子慧菩萨、金刚慧菩萨、调慧菩萨、妙慧菩萨、月光菩萨、宝月菩萨、满月菩萨、勇猛菩萨、无量勇菩萨、无边勇菩萨、超三界菩萨、观世音菩萨、大势至菩萨、香象菩萨、香上菩萨、香上首菩萨、首藏菩萨、日藏菩萨、幢相菩萨、大幢相菩萨、离垢幢菩萨、无边光菩萨、放光菩萨、离垢光菩萨、喜王菩萨、常喜菩萨、宝手菩萨、虚空藏菩萨、离憍慢菩萨、须弥山菩萨、光德王菩萨、总持自在王菩萨、总持菩萨、灭众病菩萨、疗一切众生病菩萨、欢喜念菩萨、餍意菩萨、常餍菩萨、普照菩萨、月明菩萨、宝慧菩萨、转女身菩萨、大雷音菩萨、导师菩萨、不虚见菩萨、一切法自在菩萨、弥勒菩萨、文殊师利菩萨，如是等六十恒河沙菩萨摩诃萨，从无量佛刹，与无央数天、龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽俱，悉皆来集尊重供养。","尔时世尊于栴檀重阁，正坐三昧而现神变，有千叶莲华大如车轮，其数无量，色香具足而未开敷，一切花内皆有化佛，上升虚空弥覆世界犹如宝帐，一一莲花放无量光，一切莲花同时舒荣。佛神力故，须臾之间皆悉萎变，其诸花内一切化佛结加趺坐，各放无数百千光明，于时此刹庄严殊特，一切大众欢喜踊跃，怪未曾有咸有疑念：「今何因缘，无数妙花忽然毁变？萎黑臭秽甚可恶餍。」","尔时世尊，知诸菩萨大众所疑，告金刚慧：「善男子！于佛法中诸有所疑，恣汝所问。」","时金刚慧菩萨知诸大众咸有疑念，而白佛言：「世尊！以何因缘，无数莲花中皆有化佛，上升虚空弥覆世界，须臾之间皆悉萎变？一切化佛各放无数百千光明，众会悉见合掌恭敬。」","尔时金刚慧菩萨，以偈颂曰：",`「我昔未曾覩，　神变若今日，
见佛百千亿，　坐彼莲花藏，
各放无数光，　弥覆一切刹。
离垢诸导师，　庄严诸世界，
莲花忽萎变，　莫不生恶餍。
今以何因缘，　而现此神化？
我覩恒沙佛，　及无量神变，
未曾见如今，　愿为分别说。」`,"尔时世尊，告金刚慧及诸菩萨言：「善男子！有大方等经名如来藏，将欲演说故现斯瑞，汝等谛听，善思念之。」咸言：「善哉！愿乐欲闻。」","佛言：「善男子！如佛所化无数莲花忽然萎变，无量化佛在莲花内，相好庄严结加趺坐，放大光明，众覩希有靡不恭敬。如是善男子！我以佛眼观一切众生，贪欲恚痴诸烦恼中，有如来智、如来眼、如来身，结加趺坐俨然不动。善男子！一切众生虽在诸趣，烦恼身中有如来藏，常无染污、德相备足，如我无异。又善男子！譬如天眼之人观未敷花，见诸花内有如来身结加趺坐，除去萎花便得显现。如是善男子！佛见众生如来藏已，欲令开敷为说经法，除灭烦恼显现佛性。善男子！诸佛法尔，若佛出世若不出世，一切众生如来之藏常住不变，但彼众生烦恼覆故。如来出世广为说法，除灭尘劳净一切智。善男子！若有菩萨信乐此法，专心修学便得解脱成等正觉，普为世间施作佛事。」","尔时世尊以偈颂曰：",`「譬如萎变花，　其花未开敷，
天眼者观见，　如来身无染。
除去萎花已，　见无碍导师，
为断烦恼故，　最胜出世间。
佛观众生类，　悉有如来藏，
无量烦恼覆，　犹如秽花缠。
我为诸众生，　除灭烦恼故，
普为说正法，　令速成佛道。
我已佛眼见，　一切众生身，
佛藏安隐住，　说法令开现。`,"「复次善男子！譬如淳蜜在岩树中，无数群蜂围绕守护。时有一人巧智方便，先除彼蜂乃取其蜜，随意食用惠及远近。如是善男子！一切众生有如来藏，如彼淳蜜在于岩树，为诸烦恼之所覆蔽，亦如彼蜜群蜂守护。我以佛眼如实观之，以善方便随应说法，灭除烦恼开佛知见，普为世间施作佛事。」","尔时世尊以偈颂曰：",`「譬如岩树蜜，　无量蜂围绕，
巧方便取者，　先除彼群蜂。
众生如来藏，　犹如岩树蜜，
结使尘劳缠，　如群蜂守护。
我为诸众生，　方便说正法，
灭除烦恼蜂，　开发如来藏。
具足无碍辩，　演说甘露法，
普令成正觉，　大悲济群生。`,"「复次善男子！譬如粳粮未离皮糩，贫愚轻贱谓为可弃，除荡既精常为御用。如是善男子！我以佛眼观诸众生，烦恼糠糩覆蔽如来无量知见，故以方便如应说法，令除烦恼净一切智，于诸世间为最正觉。」","尔时世尊，以偈颂曰：",`「譬一切粳粮，　皮糩未除荡，
贫者犹贱之，　谓为可弃物。
外虽似无用，　内实不毁坏，
除去皮糩已，　乃为王者膳。
我见众生类，　烦恼隐佛藏，
为说除灭法，　令得一切智。
如我如来性，　众生亦复然，
开化令清净，　速成无上道。`,"「复次善男子！譬如真金堕不净处，隐没不现经历年载，真金不坏而莫能知。有天眼者语众人言：『此不净中有真金宝，汝等出之随意受用。』如是善男子！不净处者无量烦恼是，真金宝者如来藏是，有天眼者谓如来是。是故如来广为说法，令诸众生除灭烦恼，悉成正觉施作佛事。」","尔时世尊以偈颂曰：",`「如金在不净，　隐没莫能见，
天眼者乃见，　即以告众人：
『汝等若出之，　洗涤令清净，
随意而受用，　亲属悉蒙庆。』
善逝眼如是，　观诸众生类，
烦恼淤泥中，　如来性不坏。
随应而说法，　令办一切事，
佛性烦恼覆，　速除令清净。`,"「复次善男子！譬如贫家有珍宝藏，宝不能言：『我在于此。』既不自知又无语者，不能开发此珍宝藏，一切众生亦复如是。如来知见力无所畏，大法宝藏在其身内，不闻不知耽惑五欲，轮转生死受苦无量。是故诸佛出兴于世，为开身内如来法藏，彼即信受净一切智，普为众生开如来藏，无碍辩才为大施主。如是善男子！我以佛眼观诸众生有如来藏，故为诸菩萨而说此法。」","尔时世尊以偈颂曰：",`「譬如贫人家，　内有珍宝藏，
主既不知见，　宝又不能言，
穷年抱愚冥，　无有示语者，
有宝而不知，　故常致贫苦。
佛眼观众生，　虽流转五道，
大宝在身内，　常在不变易。
如是观察已，　而为众生说，
令得智宝藏，　大富兼广利。
若信我所说，　一切有宝藏，
信勤方便行，　疾成无上道。`,"「复次善男子！譬如庵罗果内实不坏，种之于地成大树王。如是善男子！我以佛眼观诸众生，如来宝藏在无明壳，犹如果种在于核内。善男子！彼如来藏清凉无热，大智慧聚妙寂泥洹，名为如来、应供、等正觉。善男子！如来如是观众生已，为菩萨摩诃萨净佛智故显现此义。」","尔时世尊以偈颂曰：",`「譬如庵罗果，　内实不毁坏，
种之于大地，　必成大树王。
如来无漏眼，　观一切众生，
身内如来藏，　如花果中实。
无明复佛藏，　汝等应信知，
三昧智具足，　一切无能坏。
是故我说法，　开彼如来藏，
疾成无上道，　如果成树王。`,"「复次善男子！譬如有人持真金像，行诣他国经由险路惧遭劫夺，裹以弊物令无识者。此人于道忽便命终，于是金像弃捐旷野，行人践蹈咸谓不净。得天眼者见弊物中有真金像，即为出之一切礼敬。如是善男子！我见众生种种烦恼，长夜流转生死无量，如来妙藏在其身内，俨然清净如我无异。是故佛为众生说法，断除烦恼净如来智，转复化导一切世间。」","尔时世尊以偈颂曰：",`「譬人持金像，　行诣于他国，
裹以弊秽物，　弃之在旷野。
天眼者见之，　即以告众人，
去秽现真像，　一切大欢喜。
我天眼亦然，　观彼众生类，
恶业烦恼缠，　生死备众苦。
又见彼众生，　无明尘垢中，
如来性不动，　无能毁坏者。
佛既见如是，　为诸菩萨说，
烦恼众恶业，　覆弊最胜身。
当勤净除断，　显出如来智，
天人龙鬼神，　一切所归仰。`,"「复次善男子！譬如女人贫贱丑陋，众人所恶而怀贵子，当为圣王王四天下；此人不知经历时节，常作下劣生贱子想。如是善男子！如来观察一切众生，轮转生死受诸苦毒，其身皆有如来宝藏，如彼女人而不觉知。是故如来普为说法，言：『善男子！莫自轻鄙，汝等自身皆有佛性，若勤精进灭众过恶，则受菩萨及世尊号，化导济度无量众生。』」","尔时世尊以偈颂曰：",`「譬如贫女人，　色貌甚庸陋，
而怀贵相子，　当为转轮王，
七宝备众德，　王有四天下，
而彼不能知，　常作下劣想。
我观诸众生，　婴苦亦如是，
身怀如来藏，　而不自觉知。
是故告菩萨，　慎勿自轻鄙，
汝身如来藏，　常有济世明，
若勤修精进，　不久坐道场，
成最正觉道，　度脱无量众。`,"「复次善男子！譬如铸师铸真金像，既铸成已倒置于地，外虽焦黑内像不变，开摸出像金色晃曜。如是善男子！如来观察一切众生，佛藏在身众相具足。如是观已广为显说，彼诸众生得息清凉，以金刚慧搥破烦恼，开净佛身如出金像。」","尔时世尊以偈颂曰：",`「譬如大冶铸，　无量真金像，
愚者自外观，　但见焦黑土；
铸师量已冷，　开摸令质现，
众秽既已除，　相好画然显。
我以佛眼观，　众生类如是，
烦恼淤泥中，　皆有如来性。
授以金刚慧，　搥破烦恼摸，
开发如来藏，　如真金显现。
如我所观察，　示语诸菩萨，
汝等善受持，　转化诸群生。」`,"尔时世尊告金刚慧菩萨摩诃萨：「若出家若在家，善男子善女人，受持读诵书写供养，广为人说如来藏经，所获功德不可计量。金刚慧！若有菩萨为佛道故，勤行精进修习神通，入诸三昧欲殖德本，供养过恒河沙现在诸佛，造过恒河沙七宝台阁，高十由旬、纵广正等各一由旬，设七宝床敷以天缯，为一一佛日日造立过恒河沙七宝台阁，以用奉献一一如来及诸菩萨声闻大众。以如是事普为一切过恒河沙现在诸佛，如是次第乃至过五十恒沙众宝台阁，以用供养过五十恒沙现在诸佛及诸菩萨声闻大众，乃至无量百千万劫。金刚慧！不如有人乐喜菩提，于如来藏经受持读诵书写供养乃至一譬喻者。金刚慧！此善男子，于诸佛所种诸善根福虽无量，比善男子善女人所得功德，百分不及一千分不及一，乃至算数譬喻所不能及。」尔时世尊重说偈言：",`「若人求菩提，　闻持此经者，
书写而供养，　乃至于一偈，
如来微妙藏，　须臾发随喜，
当听此正教，　功德无有量。
若人求菩提，　住大神通力，
欲供十方佛，　菩萨声闻众，
其数过恒沙，　亿载不思议，
为一一诸佛，　造立妙宝台，
台高十由旬，　纵广四十里，
中施七宝座，　严饰备众妙，
敷以天缯褥，　随座各殊异，
无量过恒沙，　献佛及大众，
悉以此奉献，　日夜不休息，
满百千万劫，　所获福如是。
慧者闻此经，　能持一譬喻，
而为人解说，　其福过于彼，
乃至于算数，　譬喻所不及。
众生之所依，　速成无上道，
菩萨谛思惟，　甚深如来藏，
知众生悉有，　疾成无上道。」`,"尔时世尊，复告金刚慧菩萨言：「过去久远无量无边，不可思议阿僧祇劫，复过是数。尔时有佛，号常放光明王如来、应供、等正觉、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。金刚慧！何故名曰常放光明王？彼佛本行菩萨道时，降神母胎常放光明，彻照十方千佛世界微尘等刹。若有众生见斯光者一切欢喜，烦恼悉灭色力具足，念智成就得无碍辩。若地狱、饿鬼、畜生、阎罗王、阿修罗等见光明者，皆离恶道生天人中。若诸天人见光明者，于无上道得不退转，具五神通。若不退转者，皆得无生法忍五十功德旋陀罗尼。金刚慧！彼光明所照国土，皆悉严净如天琉璃，黄金为绳以界八道，种种宝树花果茂盛香气芬馨，微风吹动出微妙音，演畅三宝菩萨功德，根、力、觉、道、禅定、解脱。众生闻者皆得法喜，信乐坚固永离恶道。金刚慧！彼十方刹一切众生蒙光明故，昼夜六时合掌恭敬。金刚慧！彼菩萨处胎出生，乃至成佛、无余泥洹常放光明，般泥洹后舍利塔庙亦常放光。以是因缘诸天世人，号曰常放光明王。","「金刚慧！常放光明王如来、应供、等正觉初成佛时，于其法中有一菩萨名无边光，与二十亿菩萨以为眷属。无边光菩萨摩诃萨于彼佛所，问如来藏经，佛为演说，在于一坐经五十大劫，护念一切诸菩萨故，其音普告十佛世界微尘等百千佛刹，为诸菩萨无数因缘百千譬喻，说如来藏大乘经典。诸菩萨等闻说此经，受持读诵如说修行，除四菩萨皆已成佛。金刚慧！汝莫异观，彼无边光菩萨岂异人乎？即我身是。彼四菩萨未成佛者，文殊师利、观世音、大势至、汝金刚慧是，金刚慧！如来藏经能大饶益，若有闻者皆成佛道。」","尔时世尊重说偈曰：",`「过去无数劫，　佛号光明王，
常放大光明，　普照无量土。
无边光菩萨，　于佛初成道，
而启问此经，　佛即为演说。
其有遇最胜，　而闻此经者，
皆已得成佛，　唯除四菩萨：
文殊、观世音、　大势、金刚慧。
此四菩萨等，　皆曾闻此法，
金刚慧为彼，　第一神通子，
时号无边光，　已曾闻此经。
我本求道时，　师子幢佛所，
亦曾受斯经，　如闻说修行，
我因此善根，　疾得成佛道。
是故诸菩萨，　应持说此经，
闻已如说行，　得佛如我今。
若持此经者，　当礼如世尊，
若得此经者，　是名佛法主，
则为世间护，　诸佛之所叹。
若有持是经，　是人名法王，
是为世间眼，　应赞如世尊。」`,"尔时世尊说此经已，金刚慧及诸菩萨，四众眷属，天、人、乾闼婆、阿修罗等，闻佛所说，欢喜奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T16n0666",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T16/T16n0666.xml",sourceLabel:"CBETA T16n0666",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"大方等如來藏經",juan:[1]},{id:"cbeta-t16n0693",title:"佛说造立形像福报经",subtitle:"佛说造立形像福报经 · 阙译",paragraphs:["佛至拘罗惧国，有诸树园主名拘翼。","时国王名优填，年始十四，闻佛当来，王即勅傍臣左右皆悉严驾。王行迎佛，遥见世尊，心中踊跃，极大欢喜，止车下步，罢却左右傍臣侍从及持盖者，即前迎趣，便以头面著地作礼，起复前行，如是至三。","佛言：「来前。」","王复前到，以头面著佛足，起绕三匝，长跪叉手，白佛言：「天上、天下诸天人民无及佛者！今佛面目、身体、行步，光明巍巍好乃如是。我今视佛无有厌极，佛是天上、天下诸天人民之大师也，佛所慈心哀救甚多。」佛默然不应。","王复白佛言：「人作善者，此之福祐，当何所获？佛去已后，我恐不复见佛。今欲作佛形像，恭敬承事，得何福报？愿佛哀愍，为我说之，我欲闻知。」","尔时，佛告年少王：「汝所问，大善！谛听吾说，以著心中。」","王即稽首言：「受教。」","佛告王曰：「若有作佛形像，所得福祐，我今悉当为汝说之。」","王言：「诺！受恩。」","佛言：「天下人民能作佛形像者，其后世世所生之处，眼目净洁、面貌端政，身体手足常好柔濡，生于天上亦复净洁诸天中胜，眼目面貌甚好无比。作佛形像其福如是。","「作佛形像所生之处，无有诸恶身体具足，死后得生第七梵天上，复诸天中，形貌端政绝好无比，为诸天所敬。作佛形像其福如是。","「作佛形像，后世常生势尊贵家，受其气力与世绝异，在所生处不堕贫家。作佛形像其福如是。","「作佛形像，后世所生身形殊妙，紫磨金色端政无比，常为众人所共敬爱。作佛形像其福如是。","「作佛形像，后世生处常在富贵之家，财产珍宝不可称数，常为父母、兄弟、宗族之所爱重。作佛形像其福如是。","「作佛形像，后世若生阎浮提中，常生帝王、公侯、贤善之家。作佛形像其福如是。","「作佛形像，后世得作帝王，特尊胜诸国王，当为诸王之所归仰。作佛形像其福如是。","「作佛形像，后世得作遮迦越王，四天下诸王皆臣属之。作佛形像其福如是。","「作佛形像，后世得作遮迦越王，飞行天上复下自恣，在所施为无所不至。作佛形像其福如是。","「作佛形像，后世生于第七梵天，寿一劫余，智慧尊胜无上无能及者。作佛形像其福如是。于梵天寿尽当复来下，生于孝顺有道法家。作佛形像其福如是。","「作佛形像，后所生处常为父母之所爱重，寿终复得生于天上。作佛形像其福如是。","「作佛形像，死后不复堕三恶道，当自守意常欲求佛。","「作佛形像，后世生处尊重于经，意欲常持杂好香华、杂好缯彩、灯火光明、诸天下中名好珍宝奉上佛塔，后无数劫，会当得佛涅槃之道。人有出意持妙珍宝、所爱重物奉上佛者，非余凡人，皆是前世作佛形像者、习菩萨道者。作佛形像其福如是。","「作佛形像，其福无量，无穷尽时，不可称数。如是四天下江河海水尚可升量，作佛形像其福甚多，多四天下江河海水过出十倍，后世所生常护佛道。","「作佛形像，譬如天雨，人有好舍无所忧畏。","「作佛形像，死后不复入于地狱、畜生、饿鬼诸恶道中。其有众生见佛形像生恭敬心，叉手自归佛塔舍利者，死后百劫不复入于地狱、畜生、饿鬼道中。死即生天，天上寿终，复生世间势富之家，如是受福不可称数，会当得佛涅槃之道。」","佛告优填王：「人作善者作佛形像，其福祐功德如是，终不唐苦。」","尔时，优填王以偈赞佛：",`「佛者大圣人，　为众生说法。
拘深瞿师园，　优填叉手问，
闻梵音审谛，　不动百福成，
作佛形像者，　得何等福报？」`,"尔时，世尊说偈答曰：",`「王谛听吾说，　福地恢上土，
福德无过者，　作佛形像报。
恒生大富家，　尊贵无极珍，
眷属常恭敬，　作佛形像报。
世世身无患，　常得天眼报，
无比绀青色，　作佛形像报。
父母见欢忻，　端政威德重，
爱乐终无厌，　作佛形像报。
金色身焰光，　犹妙师子像，
众生见欢喜，　作佛形像报。
阎浮提大姓，　刹利、婆罗门，
福人于中生，　作佛形像报。
不生边地国，　不盲不丑陋，
六情常完具，　作佛形像报。
临终识宿命，　见佛在其前，
不觉死时苦，　作佛形像报。
作大名闻王，　金轮飞行帝，
典主四天下、　作佛形像报。
作释天名因，　神足典第二，
三十三天奉，　作佛形像报。
此过出欲界，　作梵梵天王，
迦夷众梵恭，　作佛形像报。
受福正如是，　若能刻画作，
天地尚可称，　此福不可量。
是故供养佛，　华香香汁涂，
供养大士者，　得漏尽无为。」`,"佛说经竟，王大欢喜，即起，前以头面著佛足而起，比丘、比丘尼、优婆塞、优婆夷，及其五百傍臣左右，皆起欢喜为佛作礼，后皆往生阿弥陀佛国，作大菩萨最尊第一。优填王闻其所说，欢喜受解，即得须陀洹道。"],source:"https://cbetaonline.dila.edu.tw/zh/T16n0693",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T16/T16n0693.xml",sourceLabel:"CBETA T16n0693",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說造立形像福報經",juan:[1]},{id:"cbeta-t16n0700",title:"右绕佛塔功德经",subtitle:"右绕佛塔功德经 · 唐 实叉难陀译",paragraphs:["如是我闻：","一时，佛在舍卫国祇树给孤独园，与大比丘僧及余无量众俱，前后围绕。","尔时，长老舍利弗即从坐起，偏袒右肩，右膝著地，合掌向佛，以偈请曰：",`「大威德世尊，　愿为我等说，
右绕于佛塔，　所得之果报。」`,"尔时世尊以偈答曰：",`「右绕于佛塔，　所得诸功德，
我今说少分，　汝等咸善听。
一切诸天龙、　夜叉、鬼神等，
皆亲近供养，　斯由右绕塔。
在在所生处，　远离于八难，
常生无难处，　斯由右绕塔。
于一切生处，　念慧常无失，
具足妙色相，　斯由右绕塔。
往来天人中，　福命悉长远，
常获大名称，　斯由右绕塔。
在于阎浮提，　常生最尊胜，
清净种姓中，　斯由右绕塔。
仪貌常端正，　富贵多财宝，
恒食大封邑，　斯由右绕塔。
财宝常盈积，　而无悭悋心，
勇猛广惠施，　斯由右绕塔。
色相净微妙，　见者皆欣仰，
所住常安乐，　斯由右绕塔。
或为忉利王，　妻子悉具足，
威势力自在，　斯由右绕塔。
或作婆罗门，　持戒善通达，
呪术、围陀典，　斯由右绕塔。
或作大长者，　豪贵多财产，
仓廪常丰足，　斯由右绕塔。
或作正法王，　自在王阎浮，
率土咸归化，　斯由右绕塔。
或为具七宝，　大势转轮王，
十善御群生，　斯由右绕塔。
从此生天上，　常有大威德，
净信于佛法，　斯由右绕塔。
净信速成已，　于法无迷惑，
见诸行皆空，　斯由右绕塔。
从天上舍命，　下生于人中，
入胎不迷乱，　斯由右绕塔。
在于母胎中，　垢秽所不染，
如净摩尼珠，　斯由右绕塔。
在胎及生时，　令母常安乐，
饮乳亦复然，　斯由右绕塔。
父母及亲戚，　一切共鞠养，
乳母常不离，　斯由右绕塔。
眷属皆爱念，　超过于父母，
资财自增长，　斯由右绕塔。
夜叉诸恶鬼，　不能暂惊怖，
所须自然得，　斯由右绕塔。
经于百千劫，　其身转清净，
妙色相成满，　斯由右绕塔。
净眼修且广，　犹如青莲花，
兼得净天眼，　斯由右绕塔。
妙色常圆满，　诸相自庄严，
成就大势力，　斯由右绕塔。
或生帝释宫，　大威势自在，
忉利天中尊，　斯由右绕塔。
或生须夜摩、　兜率陀天宫、
化乐及他化，　斯由右绕塔。
或复生梵天，　梵世最自在，
诸天常供养，　斯由右绕塔。
亿那由他劫，　常为诸智人，
恭敬而供养，　斯由右绕塔。
其身及衣服，　亿劫常无垢，
具足白净法，　斯由右绕塔。
具大精进力，　勤修种种行，
未尝有疲懈，　斯由右绕塔。
勇猛常精进，　坚固不可坏，
所作速成就，　斯由右绕塔。
深远微妙音，　闻者皆欢喜，
安乐常无病，　斯由右绕塔。
如我所演说，　厌舍三有苦，
成就出世智，　斯由右绕塔。
常在四念处，　及以四正勤，
四如意神足，　斯由右绕塔。
了达四真谛、　根、力、七觉分，
正道及圣果，　斯由右绕塔。
灭一切烦恼，　具足大威德，
无漏六神通，　斯由右绕塔。
永离贪、恚、痴，　及一切障碍，
证独觉菩提，　斯由右绕塔。
得妙紫金色，　相好庄严身，
现作天人师，　斯由右绕塔。
皆由以身业，　及语业赞叹，
右绕于佛塔，　获此大利益。
右绕诸佛塔，　所得诸功德，
我今随所闻，　略说讵能尽？」`,"尔时世尊说此偈已，舍利弗等一切众会，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T16n0700",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T16/T16n0700.xml",sourceLabel:"CBETA T16n0700",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"右繞佛塔功德經",juan:[1]},{id:"cbeta-t16n0707",title:"佛说出家功德经",subtitle:"佛说出家功德经 · 失译",paragraphs:["如是我闻：","一时佛在毘舍离国，食时到，入城乞食。时毘舍离城中，有一梨车，名鞞罗羡那（秦言勇军）。譬如天与诸天女共相娱乐，时此王子与诸婇女在阁上共相娱乐，耽于色欲亦复如是。","尔时世尊以一切智闻彼乐音，告阿难言：「我知此人贪五欲乐者，不久命终。却后七日，当舍如是眷属快乐，决定当死。阿难！如此人若当不舍欲乐、不出家者，命终或能堕于地狱。」","尔时阿难顶奉佛教，欲利益此王子故，次至其舍。尔时王子闻阿难在外，即出奉见，以敬念故，请阿难入坐。坐已未久，尔时王子起恭敬心，白阿难言：「善哉！好亲友来，今正是时。我今见汝，踊跃欢喜。汝字欢喜，汝今当教，告我佛所教法，令我欢喜。」尔时王子如是三请。阿难为欲作大利益，默然无言。","王子又言：「鞞陀呵牟尼大仙，利益一切众生。有何嫌恨，默然无所说？不见少告！」","时第三师——持佛法藏、利世间者——惨然告言：「汝今善听！却后七日，汝当命终。汝若于此五欲乐中不能觉悟、不出家者，命终或当堕地狱中。佛一切智人，正语正说，记汝如是。譬火烧物，终不虚发。汝谛思惟！」","时彼王子闻此语已，甚大忧怖，愁愦不乐，受阿难教：「我当出家，定且听更六日受乐，第七日中，我辞家眷属，定必出家。」阿难可之。","第七日畏生死故，求佛出家，佛即听之。一日一夜，修持净戒，即便命终。烧香毕已，尊者阿难与其眷属，往白佛言：「世尊！此鞞罗羡那比丘，今已命终，神生何处？」","时佛、世尊、天人之师、一切智人，以大梵音，胜出雷鼓迦陵频伽众妙音声，以八种音告阿难言：「此鞞罗羡那比丘，畏于生死、地狱苦故，舍欲出家。一日一夜持净戒故，舍此世已，生四天王天，为北方天王毘沙门子，恣心受于五欲快乐，贪受五欲，与诸婇女共相娱乐，寿五百岁。五百岁已，命终转生三十三天，为帝释子，具受五欲极天之乐，天妙婇女恣意千岁。寿尽，生焰天，为焰天王子，自恣受天色、声、香、味、触，快心欲乐。受天二千岁已，命终生于兜率天王子，恣心受于五欲快乐，目视相欲，心自厌足，常谈法语、解脱智慧，寿天中寿。满四千岁已，命终往生自在天上，为天王子，受种种五欲妙乐，于婇女中化应恣意八千岁。八千岁已，命终生他化自在天，为天王子。此第六天其中欲乐，下五天中所不能及。生此中已，受最妙乐，众乐之藏。受此乐时，心极迷醉。具足受于诸妙胜乐，万六千岁。如是受乐，于六欲天，往来七反。此毘罗羡那，以一日一夜出家故，满二十劫不堕地狱、饿鬼、畜生，常生天人，受福自然。最后人中，生富乐家，财富珍宝具足。壮年已过，诸根熟时，畏恶生、老、病、死患故，厌世出家，剃除须发故，身披法服，勤修精进，持四威仪，常行正念，观于五阴苦、空、无我，解法因缘，成辟支佛，名毘流帝。于是时，放大光明，多有人、天，生于善根，令诸群生种于三乘解脱因缘。」","尔时阿难叉手，白佛言：「世尊！若当有人放人出家；若有出家者，任其所须，得几所福？若复有人毁破他人出家因缘，受何罪报？唯愿世尊具尽告示！」","佛告阿难：「汝若具满于百岁中，问我此事，我以无尽智慧，除饮食时，满百岁中，广为汝说此人功德，犹不能尽。是人恒生天上、人中，常为国王，受天、人乐。若有于此沙门法中使人出家，若复营佐出家因缘，于生死中常受快乐。我满百岁说其福德，不可穷尽。是故阿难！汝满百岁尽寿问我，我至涅槃说此功德，亦不能尽。」","佛告阿难：「若复有人破坏他人出家因缘，即为劫夺无尽善财福藏，坏三十七助菩提法、涅槃之因。设有欲坏出家因缘者，应善观察如是之事。何以故？缘此罪业，堕地狱中，常盲无目，受极处苦；若作畜生，亦常生盲；若生饿鬼中，亦常生盲。在三恶苦，久乃得脱。若生为人，在母腹中，受胎便盲。汝于百岁常问是义，我百岁以无尽智说是罪报，亦不可尽。于四道中，生而常盲，我终不记此人当有得脱时。所以者何？皆由毁出家故。","「或成就无边功德，以破如是善因缘故，受无量罪，由障出家故，于此清净智慧镜中，为于解脱诸善法故。若见出家修持净戒，趣解脱处，破他出家，为作留难；以是因缘故，生便常盲，不见涅槃，由毁出家故。常观痴等十二因缘，应得解脱；以毁破他智慧眼故，破出家缘覆慧眼故，从生至生，常盲无目，不见三界，缘障出家故。出家应见五阴、二十我见，人趣正道；破出家因，坏正见故，所生常盲，不见正道。出家应见一切法聚、善法住处，应观诸佛清净法身；以破出家善因缘故，所生常盲，不能覩见佛法身。以因出家应具沙门形貌，及与持戒，清净福田，种佛道因；破出家故，于善法中断一切望，由是罪缘，生生常盲，由毁出家故。出家应善观察一切身心，皆苦、无常、无我、不净；破他出家，为作留难，则破此眼。破此眼故，不见四道、四念处、四正勤、四如意足、五根、五力、七觉分、八正道，趣涅槃城。是罪缘故，所生常盲，乃至不见空、无相、无作清净善法，向涅槃城。","「是以智慧之人知出家者，应当成就如是善法，不应破坏善法因缘，获如是罪。谁毁破他人如是出家沙门正见因缘者，终不能得见涅槃城，所生常盲。","「若复有人满百劫中，余方出家，修持净戒；若复有人于此阎浮提，出家持戒，一日一夜，乃至须臾，清净出家，于十六分彼百劫出家持戒，十六分中不及其一。","「若有颠倒，婬姊妹女，不应婬处，强生悭嫉，此中罪报，不可计限。若有一人能正思惟有出家心，欲舍诸恶；若复有人破坏此人出家因缘，不令愿满，是罪因缘增长于前复倍百劫。」","尔时阿难复白佛言：「世尊！此毘罗羡那所种善根，生尊贵处当受福乐，为过去世亦有善行？为但齐今一日一夜出家功德，受尔许福？」","佛告阿难：「汝不应观过去因缘！于此一日一夜清净出家故，此善根，六欲天中七反受福，二十劫中常受生死世间之乐。最后人中，生福乐家，壮年已过，诸根熟时，畏于生、老、病、死、苦故，出家持戒，成辟支佛。」","佛告阿难：「我今说喻，汝当善听！譬四天下——东弗婆提、南阎浮提、西瞿耶尼、北欝单越——满中阿罗汉，若稻麻丛林。若有一人满百岁中，尽心供养此诸罗汉衣服饮食、病瘦医药、房舍卧具，乃至涅槃后若起塔庙，种种珍宝、花香、璎珞、幡盖、伎乐，悬诸宝铃，扫洒香水，以诸偈颂，赞叹供养；所得功德，若有人为涅槃故，出家受戒乃至一日一夜所作功德，比前功德，十六分中不及其一。以是因缘，善男子当应出家，修持净戒。诸善男子！诸须功德者、求善法者、自受法者，不应留难出家因缘，应勤方便劝作令成。」","时诸大众闻佛所说，莫不厌世，出家持戒。有得须陀洹乃至阿罗汉者，有种辟支佛善根者，有发无上菩提心者，皆大欢喜，顶戴奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T16n0707",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T16/T16n0707.xml",sourceLabel:"CBETA T16n0707",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說出家功德經",juan:[1]},{id:"cbeta-t17n0735",title:"佛说四愿经",subtitle:"佛说四愿经 · 吴 支谦译",paragraphs:["闻如是：","一时佛在拘夷那竭国，与五百比丘僧，坐于尼延树下，为数千万人说法。于是城中有豪长者，财富无数，名曰纯陀。纯陀有子，厥年十四，时得重病，不免所疾，遂便丧亡。父母、兄弟、宗亲中外莫不爱重，啼哭忧愁，安可言乎！","尔时纯陀闻佛来化，心大欢喜，便告其妻言：「今佛在此，宜当往见。闻佛说经法者，莫不解悦，忘忧除患！」即与其妻、亲族、仆使俱到佛所，为佛作礼，却坐一面。长者纯陀长跪叉手，前白佛言：「人在世间，积聚钱财，思虑勤苦，不敢衣食，不知布施、奉持经戒，无尊无卑。获得如愿者，或时命尽，父母、兄弟、妻子、亲属啼哭愁毒，为其棺殓遣送财宝、衣被、饮食，宁有益于死者不？」","佛告纯陀及诸会弟子：「听我所说，善思念之！」纯陀眷属、诸会弟子皆各叉手，一心受教而听。","佛言：「人有四愿，不可常保。何等为四？","「第一愿者，是人身。沐浴、庄饰、饭食、五乐常先与之，疾病卒至，不能止之。命尽，躯强在地，不随人魂神去，空爱重之，复何益也！","「第二愿者，谓有财产、官爵、俸禄。得之者喜，不得愁忧。疾病，死至命尽，所有财物、官爵、俸禄，故在世间，不随人魂神去，空为愁苦。","「第三愿者，谓有父母、兄弟、妻子、中外亲属、朋友、知识、恩爱、荣乐。疾病，至死命尽，复不能救我命，亦不能随我魂神去。空啼哭，送我到城外深冢间，以弃我去，各疾还归。虽追念我，愁苦忧思，不过十日，诸家宗族、男女聚会，相向歌舞，快共饮食，相对谈笑，捐忘死人。虽有父母、兄弟、妻子、中外亲属、朋友、知识，不能共追我命，空悲之，复何益也！","「第四愿者，是人意。天下人少有能守护其意者，皆放心恣意，婬于五乐，贪利疾妬，忿怒鬪诤，不信道德。至于身死寿尽，魂神去矣，三者相追逐，不得相离，譬如雀飞，意随其两翅，意为身神，两翅为魂魄。人不能守护其意，皆从恶念所为，杀、盗、贪、婬，以生时所为罪，死入太山地狱中，为饥饿鬼。罪竟，乃出为畜生，当为人所屠割。作人放心快意故，入三恶道。」","佛告纯陀及诸弟子：「当端汝心，守护汝意！谛自思惟：知身非我身，所有财物，亦非我许。当谛计校所有——父母、兄弟、妻子、五种亲属、朋友、知识，官爵、俸禄——念欲得之，无有厌足，谓有益于我身，老、病、死来，皆不能益于我身，亦不能为我却之。人不能自拔为道，如鹦鹉鸟爱其毛尾，为射猎者所得。贤者谛知，是四愿不随人魂神去，空为之困苦。因拔恩爱之根，绝三恶之道，得三善道：一者、不复老；二者、不复病；三者、不复死。坚守护其意，乃可得度！」","诸弟子闻经欢喜，为佛作礼。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0735",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0735.xml",sourceLabel:"CBETA T17n0735",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說四願經",juan:[1]},{id:"cbeta-t17n0758",title:"佛说诸行有为经",subtitle:"佛说诸行有为经 · 宋 法天译",paragraphs:["如是我闻：","一时，世尊在舍卫国祇树给孤独园，与大苾刍众千二百五十人俱。","尔时，世尊告苾刍众言：「苾刍！一切行迁流，如幻不实、不得久住、无有定相、是颠倒法；苾刍！乃至一切行，垢尽无染离一切垢。一切众生乃至蠕动及部多等，至寿命尽决定殒灭；若彼无生即当无灭。若彼长者、婆罗门、刹帝利种族，殊胜豪贵自在财富，无量金银珍宝及诸受用，无所乏少；虽有父母眷属、亲姻知识、吏民僮仆皆悉具足，至寿命尽亦无能免。又复刹帝利授灌顶已，为大国王得大自在，有大力势，人民无量，大地国土皆悉降伏，至寿命尽亦复无免。又彼仙人林中诸修行者，不贪于味，食诸菓实；又复远离菓实修诸苦行，至寿命尽亦复无免。","「又彼修诸十善，得生四大王天、忉利天、夜摩天、覩史多天、乐变化天、他化自在天；又复修行禅定，得梵身天、梵辅天、大梵天，得少光天、无量光天、极光净天，得少净天、无量净天及遍净天，得无云天、福生天、广果天、无想有情天；又彼阿那含得无烦天、无热天、善现天、善见天、色究竟天；又彼厌碍色身，修无边虚空三昧等，得生空无边处、识无边处、无所有处、非想非非想处：彼等诸天，虽复殊胜，非彼不生，亦复殒灭。","「若彼三界漏尽，已作所作，远离重担，逮得己利，尽诸有结，得阿罗汉，虽复此身亦当弃舍；又彼刀兵劫，自修一身处于寂静，悟诸因缘得中乘证，号辟支佛；虽复此身亦当弃舍；乃至如来、应、正等觉，十力广大，四智圆明，说法无畏，正师子吼，历无数勤劳得那罗延身，亦复弃舍。","「诸苾刍！所谓如彼窑师造作坏器、盆瓮之类，虽复有成，定从破坏；又如菓熟自当堕落，生灭之法亦复如是。诸苾刍！一切有情乃至部多，一切含识至寿命尽，无免斯者。如无有生，即当无灭。」复说偈言：",`「如来天中天，　说是无常法，
如坏器不坚，　终趣于破坏。
同菓熟自落，　有情命如是，
苾刍今当知，　生灭宜应怖。」`,"尔时，世尊说是经已，诸苾刍众一心信受，欢喜奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0758",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0758.xml",sourceLabel:"CBETA T17n0758",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說諸行有為經",juan:[1]},{id:"cbeta-t17n0780",title:"佛说十力经",subtitle:"佛说十力经 · 唐 勿提提犀鱼译",paragraphs:["佛说十力经","如是我闻：","一时，佛在舍卫国祇树给孤独园。","尔时，世尊告诸苾刍：「汝等当知诸佛、如来、应正等觉具足十力，具十力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。何等为十？所谓如来、应、正等觉，于是处如实知是处，于非处如实知非处，皆如实知。若诸如来、应、正等觉，于是处如实知是处，于非处如实知非处，以如实知处非处故，是名第一处非处智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉于诸有情过去未来现在诸业，及诸法互触应异熟，皆如实知。若诸如来、应正等觉，于诸有情过去未来现在诸业，及诸法互触应异熟如实知故，是名第二业异熟智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来应正等觉，于诸有情于一切静虑解脱等持，杂染清净解脱清净，建立刹别皆如实知。若诸如来、应、正等觉，于诸有情于一切静虑解脱等持，杂染清净解脱清净，建立刹别如实知故，是名第三静虑解脱等持智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸有情诸根胜劣皆如实知。若诸如来、应、正等觉，于诸有情诸根胜劣如实知故，是名第四根上下智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸有情种种乐欲胜解刹别皆如实知。若诸如来、应正等觉，于诸有情种种乐欲胜解刹别如实知故，是名第五种种乐欲胜解刹别智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸有情于一切世间，非一种种诸界种性刹别皆如实知。若诸如来、应、正等觉，于诸有情于一切世间，非一种种诸界种性刹别如实知故，是名第六种种诸界智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸有情于遍趣行皆如实知。若诸如来、应、正等觉，于诸有情于遍趣行如实知故，是名第七遍趣行智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸有情过去无量诸宿住事，假使一生乃至十生，或二十生乃至百生千生，或无量生或一增减劫，乃至百千无量诸增减劫皆如实知。诸有情类若干名字，如是方所、如是种姓、如是饮食、如是苦乐、如是寿命住时修短，彼处寿命尽彼处受生，此处命尽此处受生，彼处寿命所有诸行诸识诸想如实知故，是名第八宿住智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸有情以净天眼超过于人，见诸有情死时生时，善不善色胜劣等行，行善不善感善不善皆如实知。复见有情起身恶行及口意业，毁谤贤圣起大邪见，作邪见业具此业缘，身坏命终堕三恶道。复见有情起身善行及口意业，不谤贤圣不毁正信，心为正见，起正见业具此业缘，身坏命终得生天上如实知故，是名第九死生智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。","「复次，如来、应、正等觉，于诸漏尽静虑，心解脱慧解脱，自证通慧而住，我生已尽、梵行已立、所作已办、不受后有，皆如实知。若诸如来、应、正等觉，于漏尽静虑，心解脱慧解脱，自证通慧而住，我生已尽、梵行已立、所作已办、不受后有，如实知故，是名第十漏尽智力。具此力故得名如来、应、正等觉，尊胜殊特雄猛自在，能转无上清净梵轮，于大众中正师子吼。」","尔时，世尊说是经已，诸苾刍众，天、龙、药叉、乾闼婆、阿素洛等，皆大欢喜，信受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0780",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0780.xml",sourceLabel:"CBETA T17n0780",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說十力經",juan:[1]},{id:"cbeta-t17n0837",title:"佛说出生菩提心经",subtitle:"佛说出生菩提心经 · 隋 阇那崛多译",paragraphs:["如是我闻：","一时婆伽婆在王舍城迦兰陀竹园，与大比丘众百千人俱，复与无量阿僧祇不可说大菩萨众所谓十方来集。","尔时王舍大城有婆罗门姓大迦叶，于睡眠中梦见阎浮提内有大莲华，其华千叶，光明遍照三千大千世界，微妙最胜七宝所成。于莲华内见有月轮，彼月轮内又见丈夫，放大光明普照一切，此四天下所有众生见斯光者，生大欢喜踊跃无量，皆受快乐。","尔时迦叶婆罗门睡觉已，念所梦事心喜生疑：「此何因缘？竟有何事？于先现此未曾有相，昔所未闻，如我梦见？」作是念已，生大欢喜未曾见有，复作如是念：「此有沙门瞿昙，我从他闻六年苦行，降伏魔众证大菩提，转妙法轮摧诸外道，为诸智人之所赞叹，聪明善巧知诸事相。我今应往诣彼沙门瞿昙问此梦相。」","尔时迦叶婆罗门，夜既过已，从王舍城往诣迦兰陀竹园，往到佛所，到已顶礼佛足却住一面。住一面已，如梦所见而向佛说。","时婆罗门具说梦已，尔时世尊告迦叶婆罗门言：「汝善男子！有四种善梦得于胜法。何等为四？所谓于睡眠中梦见莲华，或见繖盖，或见月轮，及见佛形。如是见已，应自庆幸我遇胜法。」","尔时世尊欲重宣此义，而说偈言：",`「若有睡梦见莲华，　及以梦见于繖盖；
或复梦里见月轮，　应当获得大利益；
若有梦见佛形像，　诸相具足庄严身，
众生见者应欢喜，　念当必作调御人。」`,"尔时迦叶婆罗门闻此偈已，复白佛言：「世尊！何者是大利，诸众生等若为能得此利益求菩提道？」","尔时佛告迦叶婆罗门言：「大利者所谓一切智者是其利也。」","时迦叶婆罗门复白佛言：「世尊！所言一切智利者，有何因缘而可得也？」","尔时世尊为迦叶婆罗门而说偈言：",`「我今说大利，　婆罗门善听。
若有利和合，　当作两足尊。
若作转轮王，　自在四天下，
众生欲作者，　须发菩提心。
若作梵天王，　于众得自在，
众生欲作者，　须发菩提心。
欲界及色界、　无色及上界，
众生欲作者，　须发菩提心。
若有众生等，　若欲作商主，
为商主导师，　须发菩提心。
若有众生等，　欲作大光明，
破灭诸黑暗，　须发菩提心。
若有众生等，　欲灭诸颠倒，
及以三有等，　须发菩提心。
若有众生等，　欲灭诸盖障，
及诸恶法者，　须发菩提心。
若有众生等，　欲灭于无明，
及断贪爱网，　须发菩提心。
若有众生等，　欲灭有及爱，
及灭垢无垢，　须发菩提心。
若有众生等，　欲灭于我慢，
及色使我慢，　须发菩提心。
若有众生等，　欲离于贡高，
无病、命我慢，　须发菩提心。
若有众生等，　欲灭老我慢，
无常、常住慢，　须发菩提心。
若有众生等，　欲灭多闻慢，
及以持戒慢，　须发菩提心。
若有众生等，　欲灭兰若慢，
乞食等诸慢，　须发菩提心。
若有众生等，　欲灭知识慢，
爱粪扫衣慢，　须发菩提心。
若有众生等，　欲灭神通慢，
一食以为净，　须发菩提心。
若有众生等，　欲灭一切慢、
所有有为慢，　须发菩提心。
若有众生等，　当欲供养佛、
于先灭度者，　须发菩提心。
若有众生等，　当欲供养佛、
所有诸如来，　须发菩提心。
若有众生等，　欲得转法轮，
世间无能转，　须发菩提心。
若有众生等，　欲灭应当灭，
当思所多思，　须发菩提心。
若有众生等，　当欲行梵行，
初、中、后最上，　须发菩提心。
若有众生等，　欲摄诸精进，
往来诸有中，　须发菩提心。
若有众生等，　欲说诸行苦，
见众生受苦，　须发菩提心。
若有众生等，　诸法无有我，
欲为众生说，　须发菩提心。
若有众生等，　欲转于法轮，
欲触上菩提，　须发菩提心。
若有众生等，　欲说寂涅槃，
当证胜菩提，　须发菩提心。
如是等功德，　发心者能得，
梵志当闻已，　应行菩提道。」`,"尔时迦叶婆罗门闻此偈已，复白佛言：「世尊！发菩提心者应摄几许福聚？」","尔时世尊即以偈颂向迦叶婆罗门说如是言：",`「若此佛刹诸众生，　令住信心及持戒，
如彼最上大福聚，　不及道心十六分。
若此佛刹诸众生，　令住信心于法行，
如彼最上大福聚，　不及道心十六分。
若诸佛刹恒河沙，　皆悉造寺求福故，
复造诸塔如须弥，　不及道心十六分。
若有佛刹如恒沙，　皆悉遍施诸七宝，
如彼最上大福聚，　不及道心十六分。
如铁围山高广大，　造塔无量为诸佛，
如是求福众生等，　不及道心十六分。
若诸众生具满劫，　若头若髆常担戴，
如彼最胜福德聚，　不及道心十六分。
如是人等得胜法，　若求菩提利众生，
彼等众生最胜者，　此无比类况有上？
是故得闻此诸法，　智者常生乐法心，
当得无边大福聚，　速得证于无上道。」`,"尔时迦叶婆罗门复白佛言：「世尊！如是发菩提心者有退转不？」","是时佛告迦叶婆罗门言：「如是发菩提心者，于解脱中无有退也。但就事别，有三种菩提。何等为三？所谓声闻菩提、辟支佛菩提、阿耨多罗三藐三菩提。","「大婆罗门！何者是声闻菩提？若善男子善女人发阿耨多罗三藐三菩提，而不教他发菩提心、不令他住，亦不为说如是经典，不自受持亦不为人广说其义，亦有亲近是富伽罗，而不承事供养所须；若有来者及不来者亦不恭敬，而于彼所不生随喜，以此因缘心得解脱——婆罗门！——是则名为声闻菩提。","「复次，何者是辟支佛菩提？若善男子善女人自发菩提心，而不教他发菩提心、不令他住，亦不为说如是经典，不自受持亦不广为他人解说，亦不亲近如是富伽罗，而不承事供养所须；若有来者及不来者，亦不恭敬亦不随喜，以此因缘心证辟支菩提，是故名为辟支佛道。","「复次，何者是阿耨多罗三藐三菩提？若善男子善女人自发阿耨多罗三藐三菩提心，亦复教他发阿耨多罗三藐三菩提心，既令彼住，复为人说如是经典，悉令受持，亲近如是富伽罗等，承事供养；若有来者及不来者，亦悉恭敬亦生随喜，如此解脱自利利他，为多人利益故、为多人安乐故、怜愍世间利益安乐诸天人等故，名阿耨多罗三藐三菩提也。以何义故名阿耨多罗三藐三菩提？于上更无有胜可求，是故名为阿耨多罗三藐三菩提。」","尔时世尊欲重宣此义，以偈颂曰：",`「自发菩提心，　不教他受持，
因自心力故，　于后般涅槃。
为自利勤劬，　不教他受持，
是故名沙门，　佛子最胜师。
彼发菩提心，　教化生欢喜；
是故自得道，　果报如是知。
自成不成他，　诸仙中福田，
得名为缘觉，　婆罗门当知。
自发菩提心，　复脱多众生，
为世作利益，　故名佛导师。
成就自利益，　复令他解脱，
此彼无差别，　故名不思议。」`,"尔时迦叶婆罗门白佛言：「世尊！解脱解脱有差别不？」","佛言：「婆罗门！解脱于解脱无有差别；道于道无有差别；乘于乘而有差别。譬如王路，有象舆者、有马舆者、有驴舆者，彼等次第行于彼路同至一城。婆罗门！于汝意云何？如是等乘有差别不？」","婆罗门言：「大德世尊！然彼诸乘实有差别。」","佛言：「如是如是。婆罗门！声闻乘、辟支佛乘、阿耨多罗三藐三菩提乘有差别，道与解脱无有差别。婆罗门！譬如恒河，有三种人有从此岸至于彼岸。其初人者，以草为筏倚之而度；第二人者若以皮囊、若以皮船倚之而度；第三人者，造作大船乘之入河，于此船中载百千人。其第三人，复勅长子安置守护如此船舫：『所有众生来者，汝从此岸度至彼岸，为多人等作利益故。』婆罗门！于意云何？夫彼岸者有差别不？」","婆罗门言：「不也。世尊！」","佛复问言：「婆罗门！于汝意云何？彼乘之乘有差别不？」","婆罗门言：「所乘之乘实有差别。」","佛言：「如是如是。婆罗门！然声闻乘、辟支佛乘、阿耨多罗三藐三菩提乘实有差别。婆罗门！如第一人，依倚草筏从于此岸至于彼岸，独一无二，声闻菩提应如是知；第二人者，若倚皮囊及以皮船，从于此岸度至彼岸，辟支佛菩提应如是知；婆罗门！如第三人，成就大船共多人众，从于此岸至于彼岸，如来菩提应如是知。」","尔时世尊欲重宣此义，而说偈言：",`「路及解脱无有上，　诸乘皆悉有差别；
智者如是应挍量，　当取最胜最上乘。
诸法教如是，　正觉说此言；
简择诸法已，　胜者应当学。」`,"尔时迦叶婆罗门复白佛言：「世尊！菩萨摩诃萨当云何行，云何念住，得至摩诃衍？」","尔时佛告迦叶婆罗门作如是言：「婆罗门！汝听是义：若诸菩萨摩诃萨如念修行，至摩诃衍。婆罗门！若善男子善女人自发菩提心，亦教他人发菩提心；自乐修行，劝他令修亦令他住，复为解释如是修多罗义；如是等富伽罗人，不来亲近承受接事，当以四摄而摄取之。何等为四？所谓布施、爱语、利益、同事。」","尔时世尊欲重宣此义，而说偈言：",`「种种大布施，　一切所有物，
欲摄受他故，　菩萨无畏者。
示现引接道，　众生不依来，
能以妙善语，　数数当安慰。
为自他安乐，　彼所生善处，
昼夜常随顺，　如是众生等。
不信教令信，　破戒令住戒，
悭悋令布施，　一切巧利益。
教人行菩提，　牢固常精进，
同于利益事，　智者如教行。
如此智慧者，　菩萨之导师；
智慧所行者，　常乐大乘法。
勇猛是最胜，　智者应当学，
以彼胜法故，　最胜到彼岸。」`,"尔时迦叶婆罗门复以偈颂而白佛言：",`「大德示彼行，　菩萨诸导师，
当学彼所行，　得至两足尊。
为我说彼行，　及行行所依，
菩提深广大，　慈愍愿为说。」`,"尔时世尊告迦叶婆罗门言：「善哉婆罗门！诸菩萨有三种行。何等为三？所谓天行、梵行、圣行。婆罗门！于中何者名为天行？若有善男子善女人，以慈身业、以慈意业、以慈口业，遍满东方无量世界慈行充满；行此遍已，复能善入南、西、北方，四维上下，皆以慈身业、慈意业、慈口业普遍充满，是名天行。于中何者名为梵行？所谓四无量——何等为四？慈、悲、喜、舍——是名梵行。婆罗门！于中何者名为圣行？所谓三解脱门——何者为三？空、无相、无愿——是名圣行。」","尔时世尊欲重宣此义，而说偈言：",`「勇猛行精进，　菩萨之导师，
若有具天行，　是人乐菩提。
圣行及梵行，　是行圣所说，
若有修行者，　是人得不动。」`,"尔时迦叶婆罗门复以此偈而白佛言：",`「我乐深菩提，　今问大导师，
此等当来世，　如何集诸行？
为后众生等，　故我问世尊，
于佛菩提中，　我意无分别，
令我发道心，　利益众生故。」`,"尔时世尊复以偈颂报彼迦叶婆罗门言：",`「说此修多罗，　令发大菩提，
梵志！佛菩提，　未曾有分别。
说此修多罗，　令发大菩提，
能断一切疑，　随顺众生问。
说此修多罗，　令发大菩提，
能断一切疑，　称彼众生欲。
得闻此经者，　彼于未来世，
能行大布施，　至于檀彼岸。
得闻此经者，　彼于未来世，
护持戒无缺，　至于戒彼岸。
得闻此经者，　彼于未来世，
行忍为众生，　至于忍彼岸。
得闻此经者，　彼于未来世，
精进为众生，　至于精进岸。
得闻此经者，　彼于未来世，
常入诸禅定，　至于禅彼岸。
得闻此经者，　彼于未来世，
为众求胜智，　至于智彼岸。
已曾作供养，　怜愍众生者，
得闻此经典，　后世到其手。
比丘住兰若，　意欲佛菩提，
得闻此经者，　于后最先得。
过去数亿佛，　已持此经典，
为利诸菩萨，　发起意欲故。
若有婆罗门，　欲乐佛菩提，
彼时得信已，　是经至其手。
我见彼众生，　悉知彼所行；
亦知彼名字，　我见悉无碍。
一切颇具说，　恐迷未来人；
惧彼起诸过，　是故少分说。」`,"尔时迦叶婆罗门复以此偈而白佛言：",`「大德此善持，　令生广大意，
此世大丈夫，　不久我当作。
过去及未来，　导师之所说，
为彼生善利，　故住于菩提。」`,"尔时世尊复以偈报婆罗门言：",`「彼等住此智，　为谁之所说？
已知彼心行，　我今当记彼。
所闻此经者，　今现在我前，
彼等于后世，　此经当现前。
若有诸女人，　抄写此经典，
此经当在手，　能生大菩提。
我于先已说，　比丘乐兰若，
手得此经典，　于后当现前。
比丘闻此经，　悲泣而雨泪：
『我先作何业，　今世得此利？
我于如是经，　未曾善思惟，
我已得受记，　何业获此果？
我昔婆罗门，　依于比丘活，
时比丘放逸，　说此修多罗。
梵志于彼闻，　时至而乞食，
泣泪已行出，　是时心作愿。
我于修多罗、　钞义及文字，
后世作证明，　亦复作拥护。』
以彼善业果，　于后后末世，
得此修多罗，　执持在其手。
彼时有比丘，　悲泣泪满目，
当时作忏悔，　后得此经法。
于先业灭尽，　彼时有相现，
于其睡梦中，　得此修多罗。
生死诸流转，　欺诳大恐怖，
斯由阿弥陀，　愿力如是果。
破戒诸比丘，　为他所轻贱，
如是多诸过，　流转大恐怖。
如是多诸恶，　由得闻此经，
当至彼边际，　于后常显曜。」`,"尔时迦叶婆罗门复以此偈而白佛言：",`「此大修多罗，　令发大道心，
为我及未来，　分别广宣说。」`,"尔时世尊复以偈告迦叶种姓婆罗门言：",`「未来诸音声，　乃至我所说，
此是广经典，　是故汝当知。
说此大经典，　此当作《阿含》，
当作秘密藏，　声闻所修学。
此处之所说，　及余得道者，
此是诸经母，　梵志如此知。
彼时诸比丘！　于我灭度后，
《杂》及《长阿含》，　复名《中阿含》，
彼时有《阿含》，　具数名《增一》；
复说杂经典，　箧藏声闻说，
复当作毘尼，　亦作阿毘昙；
或于三箧藏，　得名诸比丘！
八万有四千，　法聚我已说，
一切从此出，　名为最胜经。
于此说声闻，　及说独一觉，
诸智之根本，　不思议经典。
世间之所有，　三界未现者，
诸福之根本，　由发菩提心。
施、戒等功德，　忍辱、精进行，
禅定胜功德，　此经中善说；
智慧胜功德，　解脱忍寂灭，
一切皆示现，　此经中善说；
苦、集及以道、　寂灭于此现，
诸法皆佛法，　此经之所说；
说诸苦无常，　亦说无我法，
说寂静涅槃，　在此修多罗。
此处说声闻，　所住诸因缘，
大乘此经典，　摄受一切法。
诸法甚广大，　在于菩提心，
此为最胜典，　普说修多罗。
现前见诸佛，　及为彼说法，
当时现前闻，　斯由此经典。
三界诸众生，　少有闻此经，
闻已生爱乐，　为求佛乘故。」`,"尔时迦叶婆罗门复白佛言：「希有世尊！若诸众生无有智慧，若闻如是无上无边——乃至如是等众生当无有智慧——若如是等无边无上修多罗闻已，不能于此法中不生坚固乐欲。大德世尊！有何因缘既有如是妙法，然彼众生而当虚过也？」","尔时佛告彼婆罗门言：「此三千大千世界，有百俱致（凡言俱致者，隋数千万）诸魔宫殿，彼一一魔有俱致数魔众眷属围绕彼诸魔辈，常勤方便欲灭此经，作种种因缘，因彼因缘随所在处作诸障碍。所以者何？若以三千大千世界所有众生，皆悉得于阿罗汉果；若有善男子善女人闻此修多罗已，当发阿耨多罗三藐三菩提心。婆罗门！以是因缘，令俱致数诸魔勤求方便欲灭此经，所以者何？婆罗门！此修多罗是一切诸法种性根本，以是义故，俱致诸魔勤求方便欲灭此经。」","尔时佛告婆罗门：「今有修多罗，名曰『破魔众会』。汝等受持读诵，即得破彼魔天众会。婆罗门！譬如日轮既出现时，能灭一切幽冥黑暗。如是如是，婆罗门！说破魔众会修多罗时，一切诸魔隐没不现。婆罗门！何者名为破魔众会修多罗？」尔时世尊即说陀罗尼曰：","「多（上）致他（一）　阿㝹謩大那（上）（二）　菩提三摩陀波那多（三）　伏哆（四）　纡伏哆（五）　怛怛罗伏哆（六）　尼兴（蜎蝇反）伽魔（七）　波罗破（八）　多罗破（九）　哆嘘（十）　哆隆（洛中反）伽磨伽魔那（十一）　毘唎磨（十二）　磨素磨（十三）　系（上声）履婆伽磨（十四）　毘达啰魔（十五）　大啰曲磨（十六）　阿逻弥逻（十七）　伊迦叉逻那喻（十八）","「婆罗门！此陀罗尼是。过去、未来、现在诸佛世尊同说此破魔众会修多罗。婆罗门！说此破魔众会修多罗时，一切魔宫皆悉震、动、大动、摇、大摇，一切诸魔各各从彼本座颠倒堕落，不能语言。所以者何？彼等常为多人作不利益，常为多人作苦恼事，令失利益，以是事故，现得如是恐怖果报。如佛世尊常与一切众生乐故，乃至慈、悲、喜、舍，是故令彼诸波旬等皆生恐怖。婆罗门！若复有人当能转此发菩提修多罗者，于彼人所无有障碍，若诸天、龙、夜叉，若人非人，若魔、魔子、若魔眷属，若水、火、刀杖，若恶行者，若诸恶兽，若身所恼、若意所苦，而有受者无有是处。何以故？彼善男子善女人常为多人作利益事安乐故、常为多人作怜愍故、为诸天人等作覆护故，彼等诸善男子善女人慈行力故，应如是知。婆罗门！彼善男子善女人，不作身恶行、不作口恶行、不作意恶行故，彼等诸苦事不逼其身，亦不逼心。婆罗门！此因缘故能灭一切苦。」","尔时世尊重宣此义，而说偈言：",`「魔勤于此经，　当欲坏灭之，
是故此经典，　调御今为说。
令魔悉迷乱，　丛聚坐战栗，
相视不能言，　此恶行果报。
恐怖众生故，　常怀作恶心，
颠倒而堕落，　是故得现报。
慈悲和合者，　喜心有所说，
平等说法时，　恶心意悉散。
降伏诸魔王，　及散魔军众，
夜叉诸鬼等，　自然皆堕落。
彼力杖不害，　水、火不漂、然，
言说呪诅毒，　不能有伤害。
逼身及逼心，　彼等不曾有，
常当所作誓，　身口如是住。
闭塞诸恶道，　远离一切难，
诸魔悉摧灭，　为说此经故。
一切法巧智，　若欲度彼岸，
须闻此经典，　闻已即能学。
若能学此经，　无畏诸菩萨，
最上觉菩提，　是向菩提句。」`,"佛说此经时，迦叶婆罗门及诸大会众，乾闼婆、天人、阿修罗等，闻佛所说，欢喜奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0837",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0837.xml",sourceLabel:"CBETA T17n0837",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說出生菩提心經",juan:[1]},{id:"cbeta-t17n0841",title:"说妙法决定业障经",subtitle:"说妙法决定业障经 · 唐 智严译",paragraphs:["如是我闻：","一时佛在法界藏殿诸佛所会无边道场，与大比丘众、菩萨摩诃萨俱。时此道场有一夫人，名曰功德庄严开敷花，合掌向佛退坐一面。","尔时夫人白佛言：「若有初修行菩萨，何等之人非善知识不应共住？」","佛告夫人：「若三界中梵、释、四王、沙门、婆罗门，皆与修行菩萨为善知识，惟除声闻非善知识（恐声闻退修行菩萨大乘道行）。何以故？声闻、缘觉为己利故，劝引初修行菩萨回入小乘，是以声闻乘人非善知识。夫人当知，初修行菩萨不应与声闻比丘同居房舍，不同坐床、不同行路。若初修行菩萨智慧弥广，无二分别悟大乘法，而为方便劝引声闻令入大乘，方许同住；若声闻比丘福智狭劣，则修行菩萨不应为说甚深大乘，恐其诽谤。复次修行菩萨不应数览小乘经论。何以故？为障佛道故。夫人当知，修行菩萨宁舍身命，不弃菩提而入声闻求罗汉道。菩萨劝请一切众生已，尔时若舍菩提之心，别起异道入于声闻罗汉道果，因恼乱故菩萨而退菩提，二人俱堕无间地狱。」","佛告夫人：「修行菩萨宁犯杀等五种大罪，不学须陀洹果，不退菩提修行；菩萨宁于一劫百劫乃至千劫受地狱苦，不学斯陀含果，不退菩提修行；菩萨宁堕畜生，不学阿那含果，不退菩提修行；菩萨宁杀害众生堕于地狱，不修阿罗汉果，不退菩提。罗汉独证私入涅槃，譬如小贼密入他舍。修行菩萨菩提心故摄诸众生，宁同火坑不住声闻寂灭涅槃，不退菩提，以是义故，为摄众生令入佛道故。如是修行菩萨，一切世间天、人、阿修罗之所尊重，堪任供养超越声闻，则邪魔眷属无能娆恼。」","尔时夫人白佛言：「何者邪魔眷属？」","佛告夫人：「敷演大乘经典之处，若有众生闻说大乘，心不乐闻、调弄诽谤，当知则是邪魔眷属。诽谤大乘经典心故，死堕阿鼻受苦无量，复生饿鬼食火屎尿，无量劫中受苦毕已，后生人中，盲聋、瘖痖、病癞、不具。此等众生命终之后，经无量生方得值遇如来亲承供养，于诸佛所还复得闻大乘经典，纯一无杂。」","尔时如来于诸毛孔普出言音，一一毛孔出无量亿百千法光，复生无量法音偈赞。时此会中若有声闻则闻声闻乘法；若有缘觉乘人则闻缘觉乘法；若有大乘行人则闻大乘妙法；鸟狩之类各随其音而闻佛法。于此会中所有众生，过去未曾耳闻佛法，皆见如来默然不语；其余众生过去曾谤大乘经故，虽于多劫堕在地狱、饿鬼受苦，由谤法时大乘入耳，是故佛所亲闻大乘心生欢喜，而发无上菩提之心，究竟成就阿耨多罗三藐三菩提。","尔时夫人白佛言：「所说大乘，何故名为大乘？何故说为大乘？」","佛言：「夫人！善哉善哉！夫人深乐大乘，以是义故，善思念之，当为汝说大乘名号。所谓：一者、令人深乐，是名大乘。二者、不动，是名大乘。三者、无过，是名大乘。四者、无量，是名大乘。五者、如四大海，是名大乘。六者、金翅及紧那罗、摩睺罗伽杂类所敬，是名大乘。七者、乾闼婆所赞，是名大乘。八者、诸天恭敬，是名大乘。九者、梵天归依，是名大乘。十者、天帝所敬，是名大乘。十一者、四王所摄，是名大乘。十二者、龙王供养，是名大乘。十三者、菩萨奉持，是名大乘。十四者、成就佛性，是名大乘。十五者、贤圣归依，是名大乘。十六者、一切普堪所受，是名大乘。十七者、如药树王，是名大乘。十八者、断诸烦恼，是名大乘。十九者、能转法轮，是名大乘。二十者、无言无说，是名大乘。二十一者、如虚空相，是名大乘。二十二者、三宝种性无断，是名大乘。二十三者、钝根众生不信，是名大乘。二十四者、超过一切，是名大乘。」","尔时佛说大乘威力名号之时，此三千大千世界六种震动，百千乐器不鼓自鸣，则于空中诸天雨花，无量百千天子皆发无上菩提之心；无量百千声闻皆发阿耨多罗三藐三菩提心。复有初戒菩萨未悟法者，皆已悟解。","尔时阿难白佛言：「世尊！此法何名？如何奉持？」","佛言：「是经名为『大乘巨拏胜斯』，受持；又名『说妙法决定业障』，受持」。","如来说此经已，阿难及功德庄严开敷花夫人，及诸天龙八部，皆大欢喜，持受奉行。"],source:"https://cbetaonline.dila.edu.tw/zh/T17n0841",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T17/T17n0841.xml",sourceLabel:"CBETA T17n0841",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"說妙法決定業障經",juan:[1]},{id:"cbeta-t32n1666",title:"大乘起信论",subtitle:"大乘起信论 · 马鸣菩萨造　梁 真谛译",paragraphs:[`归命尽十方，　最胜业遍知，
色无碍自在，　救世大悲者，
及彼身体相，　法性真如海，
无量功德藏，　如实修行等。
为欲令众生，　除疑舍邪执，
起大乘正信，　佛种不断故。`,"论曰：有法能起摩诃衍信根，是故应说。说有五分。云何为五？一者、因缘分，二者、立义分，三者、解释分，四者、修行信心分，五者、劝修利益分。","初说因缘分。","问曰：「有何因缘而造此论？」","答曰：「是因缘有八种。云何为八？一者、因缘总相，所谓为令众生离一切苦得究竟乐，非求世间名利恭敬故。二者、为欲解释如来根本之义，令诸众生正解不谬故。三者、为令善根成熟众生于摩诃衍法堪任不退信故。四者、为令善根微少众生修习信心故。五者、为示方便消恶业障善护其心，远离痴慢出邪网故。六者、为示修习止观，对治凡夫二乘心过故。七者、为示专念方便，生于佛前必定不退信心故。八者、为示利益劝修行故。有如是等因缘，所以造论。」","问曰：「修多罗中具有此法，何须重说？」","答曰：「修多罗中虽有此法，以众生根行不等、受解缘别。所谓如来在世众生利根，能说之人色心业胜，圆音一演异类等解，则不须论。若如来灭后，或有众生能以自力广闻而取解者；或有众生亦以自力少闻而多解者；或有众生无自心力因于广论而得解者；自有众生复以广论文多为烦，心乐总持少文而摄多义能取解者。如是此论，为欲总摄如来广大深法无边义故，应说此论。」","已说因缘分。","次说立义分。","摩诃衍者，总说有二种。云何为二？一者、法，二者、义。所言法者，谓众生心，是心则摄一切世间法、出世间法。依于此心显示摩诃衍义。何以故？是心真如相，即示摩诃衍体故；是心生灭因缘相，能示摩诃衍自体相用故。所言义者，则有三种。云何为三？一者、体大，谓一切法真如平等不增减故。二者、相大，谓如来藏具足无量性功德故。三者、用大，能生一切世间、出世间善因果故。一切诸佛本所乘故，一切菩萨皆乘此法到如来地故。已说立义分。","次说解释分。","解释分有三种。云何为三？一者、显示正义，二者、对治邪执，三者、分别发趣道相。显示正义者，依一心法，有二种门。云何为二？一者、心真如门，二者、心生灭门。是二种门，皆各总摄一切法。此义云何？以是二门不相离故。心真如者，即是一法界大总相法门体。所谓心性不生不灭，一切诸法唯依妄念而有差别，若离妄念则无一切境界之相。是故一切法从本已来，离言说相、离名字相、离心缘相，毕竟平等、无有变异、不可破坏。唯是一心故名真如，以一切言说假名无实，但随妄念不可得故。言真如者，亦无有相。谓言说之极因言遣言，此真如体无有可遣，以一切法悉皆真故；亦无可立，以一切法皆同如故。当知一切法不可说、不可念故，名为真如。","问曰：「若如是义者，诸众生等云何随顺而能得入？」","答曰：「若知一切法虽说，无有能说可说，虽念，亦无能念可念，是名随顺。若离于念，名为得入。」","复次，真如者，依言说分别有二种义。云何为二？一者、如实空，以能究竟显实故。二者、如实不空，以有自体，具足无漏性功德故。所言空者，从本已来一切染法不相应故，谓离一切法差别之相，以无虚妄心念故。当知真如自性，非有相、非无相、非非有相、非非无相、非有无俱相，非一相、非异相、非非一相、非非异相、非一异俱相。乃至总说，依一切众生以有妄心念念分别，皆不相应故说为空，若离妄心实无可空故。所言不空者，已显法体空无妄故，即是真心常恒不变净法满足，故名不空，亦无有相可取，以离念境界唯证相应故。心生灭者，依如来藏故有生灭心，所谓不生不灭与生灭和合，非一非异，名为阿梨耶识。此识有二种义，能摄一切法、生一切法。云何为二？一者、觉义，二者、不觉义。所言觉义者，谓心体离念。离念相者，等虚空界无所不遍，法界一相即是如来平等法身，依此法身说名本觉。何以故？本觉义者，对始觉义说，以始觉者即同本觉。始觉义者，依本觉故而有不觉，依不觉故说有始觉。又以觉心源故名究竟觉，不觉心源故非究竟觉。此义云何？如凡夫人觉知前念起恶故，能止后念令其不起，虽复名觉，即是不觉故。如二乘观智、初发意菩萨等，觉于念异，念无异相，以舍麁分别执著相故，名相似觉；如法身菩萨等，觉于念住，念无住相，以离分别麁念相故，名随分觉；如菩萨地尽，满足方便一念相应，觉心初起心无初相，以远离微细念故得见心性，心即常住，名究竟觉。是故修多罗说：「若有众生能观无念者，则为向佛智故。」又心起者，无有初相可知，而言知初相者，即谓无念。是故一切众生不名为觉，以从本来念念相续未曾离念故，说无始无明。若得无念者，则知心相生住异灭。以无念等故，而实无有始觉之异，以四相俱时而有皆无自立，本来平等同一觉故。","复次，本觉随染，分别生二种相，与彼本觉不相舍离。云何为二？一者、智净相，二者、不思议业相。智净相者，谓依法力熏习，如实修行，满足方便故，破和合识相，灭相续心相，显现法身，智淳净故。此义云何？以一切心识之相皆是无明，无明之相不离觉性，非可坏非不可坏。如大海水因风波动，水相风相不相舍离，而水非动性，若风止灭动相则灭，湿性不坏故。如是众生自性清净心，因无明风动，心与无明俱无形相、不相舍离，而心非动性。若无明灭相续则灭，智性不坏故。不思议业相者，以依智净能作一切胜妙境界，所谓无量功德之相常无断绝，随众生根自然相应，种种而见，得利益故。","复次，觉体相者，有四种大义，与虚空等，犹如净镜。云何为四？一者、如实空镜。远离一切心境界相，无法可现，非觉照义故。二者、因熏习镜。谓如实不空，一切世间境界悉于中现，不出不入、不失不坏，常住一心，以一切法即真实性故；又一切染法所不能染，智体不动，具足无漏熏众生故。三者、法出离镜。谓不空法，出烦恼碍、智碍，离和合相，淳净明故。四者、缘熏习镜。谓依法出离故，遍照众生之心，令修善根，随念示现故。所言不觉义者，谓不如实知真如法一故，不觉心起而有其念，念无自相不离本觉，犹如迷人依方故迷，若离于方则无有迷。众生亦尔，依觉故迷，若离觉性则无不觉，以有不觉妄想心故，能知名义为说真觉。若离不觉之心，则无真觉自相可说。","复次，依不觉故生三种相，与彼不觉相应不离。云何为三？一者、无明业相。以依不觉故心动，说名为业；觉则不动。动则有苦，果不离因故。二者、能见相。以依动故能见；不动则无见。三者、境界相。以依能见故境界妄现；离见则无境界。以有境界缘故，复生六种相。云何为六？一者、智相。依于境界，心起分别爱与不爱故。二者相续相。依于智故生其苦乐，觉心起念相应不断故。三者、执取相。依于相续缘念境界，住持苦乐，心起著故。四者、计名字相。依于妄执，分别假名言相故。五者、起业相。依于名字，寻名取著，造种种业故。六者、业系苦相。以依业受果不自在故。当知无明能生一切染法，以一切染法皆是不觉相故。","复次，觉与不觉有二种相。云何为二？一者、同相，二者、异相。同相者，譬如种种瓦器皆同微尘性相，如是无漏无明种种业幻皆同真如性相。是故修多罗中依于此真如义故，说一切众生本来常住入于涅槃，菩提之法非可修相、非可作相，毕竟无得，亦无色相可见；而有见色相者，唯是随染业幻所作，非是智色不空之性，以智相无可见故。异相者，如种种瓦器各各不同，如是无漏无明随染幻差别，性染幻差别故。","复次，生灭因缘者，所谓众生依心，意、意识转故。此义云何？以依阿梨耶识说有无明不觉而起，能见、能现、能取境界，起念相续，故说为意。此意复有五种名。云何为五？一者、名为业识，谓无明力不觉心动故。二者、名为转识，依于动心能见相故。三者、名为现识，所谓能现一切境界，犹如明镜现于色像；现识亦尔，随其五尘对至，即现无有前后，以一切时任运而起常在前故。四者、名为智识，谓分别染净法故。五者、名为相续识，以念相应不断故，住持过去无量世等善恶之业令不失故，复能成熟现在未来苦乐等报无差违故，能令现在已经之事忽然而念，未来之事不觉妄虑。是故三界虚伪唯心所作，离心则无六尘境界。此义云何？以一切法皆从心起妄念而生，一切分别即分别自心，心不见心无相可得。当知世间一切境界，皆依众生无明妄心而得住持，是故一切法，如镜中像无体可得，唯心虚妄。以心生则种种法生，心灭则种种法灭故。","复次，言意识者，即此相续识，依诸凡夫取著转深计我我所，种种妄执随事攀缘，分别六尘名为意识，亦名分离识。又复说名分别事识，此识依见爱烦恼增长义故。依无明熏习所起识者，非凡夫能知，亦非二乘智慧所觉。谓依菩萨，从初正信发心观察，若证法身得少分知，乃至菩萨究竟地不能知尽，唯佛穷了。何以故？是心从本已来自性清净而有无明，为无明所染，有其染心。虽有染心而常恒不变，是故此义唯佛能知。所谓心性常无念故名为不变，以不达一法界故心不相应，忽然念起名为无明。染心者有六种。云何为六？一者、执相应染，依二乘解脱及信相应地远离故。二者、不断相应染，依信相应地修学方便渐渐能舍，得净心地究竟离故。三者、分别智相应染，依具戒地渐离，乃至无相方便地究竟离故。四者、现色不相应染，依色自在地能离故。五者、能见心不相应染，依心自在地能离故。六者、根本业不相应染，依菩萨尽地得入如来地能离故。不了一法界义者，从信相应地观察学断，入净心地随分得离，乃至如来地能究竟离故。言相应义者，谓心念法异，依染净差别，而知相缘相同故。不相应义者，谓即心不觉常无别异，不同知相缘相故。又染心义者，名为烦恼碍，能障真如根本智故。无明义者，名为智碍，能障世间自然业智故。此义云何？以依染心能见、能现、妄取境界，违平等性故。以一切法常静无有起相，无明不觉妄与法违故；不能得随顺世间一切境界种种智故。","复次，分别生灭相者，有二种。云何为二？一者、麁，与心相应故。二者、细，与心不相应故。又麁中之麁，凡夫境界；麁中之细及细中之麁，菩萨境界；细中之细，是佛境界。此二种生灭，依于无明熏习而有，所谓依因、依缘。依因者，不觉义故；依缘者，妄作境界义故。若因灭则缘灭，因灭故不相应心灭，缘灭故相应心灭。","问曰：「若心灭者，云何相续？若相续者，云何说究竟灭？」","答曰：「所言灭者，唯心相灭，非心体灭。如风依水而有动相。若水灭者，则风相断绝无所依止。以水不灭，风相相续，唯风灭故动相随灭，非是水灭。无明亦尔，依心体而动，若心体灭，则众生断绝无所依止。以体不灭，心得相续，唯痴灭故心相随灭，非心智灭。」","复次，有四种法熏习义故，染法、净法起不断绝。云何为四？一者、净法，名为真如。二者、一切染因，名为无明。三者、妄心，名为业识。四者、妄境界、所谓六尘。熏习义者，如世间衣服实无于香，若人以香而熏习故则有香气。此亦如是，真如净法实无于染，但以无明而熏习故则有染相。无明染法实无净业，但以真如而熏习故则有净用。云何熏习起染法不断？所谓以依真如法故有于无明，以有无明染法因故即熏习真如；以熏习故则有妄心，以有妄心即熏习无明。不了真如法故，不觉念起现妄境界。以有妄境界染法缘故，即熏习妄心，令其念著造种种业，受于一切身心等苦。此妄境界熏习义则有二种。云何为二？一者、增长念熏习，二者、增长取熏习。妄心熏习义则有二种。云何为二？一者业识根本熏习，能受阿罗汉、辟支佛、一切菩萨生灭苦故。二者、增长分别事识熏习，能受凡夫业系苦故。无明熏习义有二种。云何为二？一者、根本熏习，以能成就业识义故。二者、所起见爱熏习，以能成就分别事识义故。云何熏习起净法不断？所谓以有真如法故能熏习无明，以熏习因缘力故，则令妄心厌生死苦、乐求涅槃。以此妄心有厌求因缘故，即熏习真如。自信己性，知心妄动无前境界，修远离法，以如实知无前境界故，种种方便起随顺行，不取不念，乃至久远熏习力故，无明则灭。以无明灭故心无有起，以无起故境界随灭，以因缘俱灭故心相皆尽，名得涅槃成自然业。妄心熏习义有二种。云何为二？一者、分别事识熏习，依诸凡夫二乘人等，厌生死苦，随力所能，以渐趣向无上道故。二者、意熏习，谓诸菩萨发心勇猛速趣涅槃故。真如熏习义有二种。云何为二？一者、自体相熏习，二者、用熏习。自体相熏习者，从无始世来，具无漏法，备有不思议业，作境界之性。依此二义恒常熏习，以有力故，能令众生厌生死苦、乐求涅槃，自信己身有真如法，发心修行。","问曰：「若如是义者，一切众生悉有真如，等皆熏习，云何有信、无信，无量前后差别？皆应一时自知有真如法，勤修方便等入涅槃。」","答曰：「真如本一，而有无量无边无明，从本已来自性差别厚薄不同故。过恒沙等上烦恼依无明起差别，我见爱染烦恼依无明起差别。如是一切烦恼，依于无明所起，前后无量差别，唯如来能知故。又诸佛法有因有缘，因缘具足乃得成办。如木中火性是火正因，若无人知，不假方便能自烧木，无有是处。众生亦尔，虽有正因熏习之力，若不值遇诸佛菩萨善知识等以之为缘，能自断烦恼入涅槃者，则无是处。若虽有外缘之力，而内净法未有熏习力者，亦不能究竟厌生死苦、乐求涅槃。若因缘具足者，所谓自有熏习之力，又为诸佛菩萨等慈悲愿护故，能起厌苦之心，信有涅槃，修习善根。以修善根成熟故，则值诸佛菩萨示教利喜，乃能进趣，向涅槃道。」","用熏习者，即是众生外缘之力。如是外缘有无量义，略说二种。云何为二？一者、差别缘，二者、平等缘。差别缘者，此人依于诸佛菩萨等，从初发意始求道时乃至得佛，于中若见若念，或为眷属父母诸亲，或为给使，或为知友，或为怨家，或起四摄，乃至一切所作无量行缘，以起大悲熏习之力，能令众生增长善根，若见若闻得利益故。此缘有二种。云何为二？一者、近缘，速得度故。二者、远缘，久远得度故。是近远二缘，分别复有二种。云何为二？一者、增长行缘，二者、受道缘。平等缘者，一切诸佛菩萨，皆愿度脱一切众生，自然熏习恒常不舍。以同体智力故，随应见闻而现作业。所谓众生依于三昧，乃得平等见诸佛故。此体用熏习，分别复有二种。云何为二？一者、未相应，谓凡夫、二乘、初发意菩萨等，以意、意识熏习，依信力故而能修行；未得无分别心与体相应故，未得自在业修行与用相应故。二者、已相应，谓法身菩萨得无分别心，与诸佛智用相应，唯依法力自然修行，熏习真如，灭无明故。","复次，染法从无始已来熏习不断，乃至得佛后则有断。净法熏习则无有断，尽于未来。此义云何？以真如法常熏习故，妄心则灭、法身显现，起用熏习，故无有断。","复次，真如自体相者，一切凡夫、声闻、缘觉、菩萨、诸佛，无有增减，非前际生、非后际灭，毕竟常恒。从本已来，性自满足一切功德。所谓自体有大智慧光明义故，遍照法界义故，真实识知义故，自性清净心义故，常乐我净义故，清凉不变自在义故。具足如是过于恒沙不离、不断、不异、不思议佛法，乃至满足无有所少义故，名为如来藏，亦名如来法身。","问曰：「上说真如，其体平等离一切相，云何复说体有如是种种功德？」","答曰：「虽实有此诸功德义，而无差别之相，等同一味，唯一真如。此义云何？以无分别离分别相。是故无二。复以何义得说差别？以依业识，生灭相示。此云何示？以一切法本来唯心，实无于念，而有妄心，不觉起念，见诸境界故说无明。心性不起，即是大智慧光明义故。若心起见，则有不见之相。心性离见，即是遍照法界义故。若心有动，非真识知，无有自性，非常、非乐、非我、非净，热恼衰变则不自在，乃至具有过恒沙等妄染之义。对此义故，心性无动则有过恒沙等诸净功德相义示现。若心有起，更见前法可念者则有所少。如是净法无量功德，即是一心，更无所念，是故满足。名为法身如来之藏。」","复次，真如用者，所谓诸佛如来，本在因地发大慈悲，修诸波罗蜜，摄化众生。立大誓愿，尽欲度脱等众生界。亦不限劫数尽于未来，以取一切众生如己身故，而亦不取众生相。此以何义？谓如实知一切众生及与己身真如平等、无别异故，以有如是大方便智，除灭无明、见本法身，自然而有不思议业种种之用，即与真如等，遍一切处，又亦无有用相可得。何以故？谓诸佛如来唯是法身智相之身，第一义谛无有世谛境界，离于施作，但随众生见闻得益故说为用。此用有二种。云何为二？一者、依分别事识，凡夫、二乘心所见者，名为应身。以不知转识现故见从外来，取色分齐不能尽知故。二者、依于业识，谓诸菩萨从初发意，乃至菩萨究竟地，心所见者，名为报身。身有无量色，色有无量相，相有无量好，所住依果亦有无量种种庄严随所示现，即无有边不可穷尽离分齐相，随其所应，常能住持不毁不失。如是功德，皆因诸波罗蜜等无漏行熏，及不思议熏之所成就，具足无量乐相故，说为报身。又为凡夫所见者，是其麁色，随于六道各见不同，种种异类非受乐相故，说为应身。","复次，初发意菩萨等所见者，以深信真如法故，少分而见，知彼色相庄严等事，无来无去、离于分齐，唯依心现、不离真如。然此菩萨犹自分别，以未入法身位故。若得净心，所见微妙其用转胜，乃至菩萨地尽见之究竟。若离业识则无见相，以诸佛法身无有彼此色相迭相见故。","问曰：「若诸佛法身离于色相者，云何能现色相？」","答曰：「即此法身是色体故，能现于色。所谓从本已来色心不二，以色性即智故色体无形，说名智身；以智性即色故，说名法身遍一切处。所现之色无有分齐，随心能示十方世界，无量菩萨、无量报身、无量庄严各各差别，皆无分齐而不相妨。此非心识分别能知，以真如自在用义故。」","复次，显示从生灭门即入真如门。所谓推求五阴色之与心，六尘境界毕竟无念，以心无形相，十方求之终不可得。如人迷故谓东为西，方实不转。众生亦尔，无明迷故谓心为念，心实不动。若能观察知心无念，即得随顺入真如门故。","对治邪执者，一切邪执皆依我见，若离于我则无邪执。是我见有二种。云何为二？一者、人我见，二者、法我见。人我见者，依诸凡夫说有五种。云何为五？一者、闻修多罗说如来法身毕竟寂寞犹如虚空，以不知为破著故，即谓虚空是如来性。云何对治？明虚空相是其妄法、体无不实，以对色故有，是可见相令心生灭。以一切色法本来是心，实无外色。若无色者，则无虚空之相。所谓一切境界唯心妄起故有，若心离于妄动则一切境界灭，唯一真心无所不遍。此谓如来广大性智究竟之义，非如虚空相故。二者、闻修多罗说世间诸法毕竟体空，乃至涅槃真如之法亦毕竟空，从本已来自空离一切相。以不知为破著故，即谓真如、涅槃之性唯是其空。云何对治？明真如法身自体不空，具足无量性功德故。三者、闻修多罗说如来之藏无有增减，体备一切功德之法。以不解故，即谓如来之藏有色心法自相差别。云何对治？以唯依真如义说故，因生灭染义示现说差别故。四者、闻修多罗说一切世间生死染法皆依如来藏而有，一切诸法不离真如。以不解故，谓如来藏自体具有一切世间生死等法。云何对治？以如来藏从本已来唯有过恒沙等诸净功德，不离、不断、不异真如义故。以过恒沙等烦恼染法，唯是妄有，性自本无，从无始世来未曾与如来藏相应故。若如来藏体有妄法，而使证会永息妄者，则无是处故。五者、闻修多罗说依如来藏故有生死，依如来藏故得涅槃。以不解故，谓众生有始。以见始故，复谓如来所得涅槃，有其终尽，还作众生。云何对治？以如来藏无前际故，无明之相亦无有始。若说三界外更有众生始起者，即是外道经说。又如来藏无有后际，诸佛所得涅槃与之相应则无后际故。法我见者，依二乘钝根故，如来但为说人无我。以说不究竟，见有五阴生灭之法，怖畏生死、妄取涅槃。云何对治？以五阴法自性不生则无有灭，本来涅槃故。","复次，究竟离妄执者，当知染法、净法皆悉相待，无有自相可说，是故一切法从本已来，非色非心、非智非识、非有非无，毕竟不可说相。而有言说者，当知如来善巧方便，假以言说引导众生，其旨趣者皆为离念归于真如，以念一切法令心生灭不入实智故。","分别发趣道相者，谓一切诸佛所证之道，一切菩萨发心修行趣向义故。略说发心有三种。云何为三？一者、信成就发心，二者、解行发心，三者、证发心。信成就发心者，依何等人、修何等行，得信成就堪能发心？所谓依不定聚众生，有熏习善根力故，信业果报，能起十善，厌生死苦、欲求无上菩提，得值诸佛，亲承供养修行信心，经一万劫信心成就故，诸佛菩萨教令发心；或以大悲故，能自发心；或因正法欲灭，以护法因缘，能自发心。如是信心成就得发心者，入正定聚，毕竟不退，名住如来种中正因相应。若有众生善根微少，久远已来烦恼深厚，虽值于佛亦得供养，然起人天种子，或起二乘种子。设有求大乘者，根则不定，若进若退。或有供养诸佛未经一万劫，于中遇缘亦有发心，所谓见佛色相而发其心；或因供养众僧而发其心；或因二乘之人教令发心；或学他发心。如是等发心悉皆不定，遇恶因缘，或便退失堕二乘地。","复次，信成就发心者，发何等心？略说有三种。云何为三？一者、直心，正念真如法故。二者、深心，乐集一切诸善行故。三者、大悲心，欲拔一切众生苦故。","问曰：「上说法界一相、佛体无二，何故不唯念真如，复假求学诸善之行？」","答曰：「譬如大摩尼宝体性明净，而有鑛秽之垢。若人虽念宝性，不以方便种种磨治，终无得净。如是众生真如之法体性空净，而有无量烦恼染垢。若人虽念真如，不以方便种种熏修，亦无得净。以垢无量遍一切法故，修一切善行以为对治。若人修行一切善法，自然归顺真如法故。略说方便有四种。云何为四？一者、行根本方便。谓观一切法自性无生，离于妄见，不住生死。观一切法因缘和合，业果不失，起于大悲修诸福德，摄化众生不住涅槃，以随顺法性无住故。二者、能止方便。谓惭愧悔过，能止一切恶法不令增长，以随顺法性离诸过故。三者、发起善根增长方便。谓勤供养、礼拜三宝，赞叹、随喜、劝请诸佛，以爱敬三宝淳厚心故，信得增长，乃能志求无上之道。又因佛法僧力所护故，能消业障，善根不退，以随顺法性离痴障故。四者、大愿平等方便。所谓发愿尽于未来，化度一切众生使无有余，皆令究竟无余涅槃，以随顺法性无断绝故，法性广大，遍一切众生，平等无二，不念彼此，究竟寂灭故。菩萨发是心故，则得少分见于法身。以见法身故，随其愿力能现八种利益众生。所谓从兜率天退，入胎，住胎，出胎，出家，成道，转法轮，入于涅槃。然是菩萨未名法身，以其过去无量世来有漏之业未能决断，随其所生与微苦相应，亦非业系，以有大愿自在力故。如修多罗中，或说有退堕恶趣者，非其实退，但为初学菩萨未入正位而懈怠者，恐怖令使勇猛故。又是菩萨一发心后，远离怯弱，毕竟不畏堕二乘地。若闻无量无边阿僧祇劫勤苦难行乃得涅槃，亦不怯弱，以信知一切法从本已来自涅槃故。解行发心者，当知转胜。以是菩萨从初正信已来，于第一阿僧祇劫将欲满故，于真如法中，深解现前，所修离相。以知法性体无悭贪故，随顺修行檀波罗蜜；以知法性无染，离五欲过故，随顺修行尸波罗蜜；以知法性无苦，离瞋恼故，随顺修行羼提波罗蜜；以知法性无身心相，离懈怠故，随顺修行毘梨耶波罗蜜；以知法性常定，体无乱故，随顺修行禅波罗蜜；以知法性体明，离无明故，随顺修行般若波罗蜜。证发心者，从净心地乃至菩萨究竟地，证何境界？所谓真如，以依转识说为境界，而此证者无有境界，唯真如智名为法身。是菩萨于一念顷能至十方无余世界，供养诸佛、请转法轮，唯为开导利益众生。不依文字，或示超地速成正觉，以为怯弱众生故；或说我于无量阿僧祇劫当成佛道，以为懈慢众生故。能示如是无数方便不可思议，而实菩萨种性根等，发心则等，所证亦等，无有超过之法。以一切菩萨皆经三阿僧祇劫故，但随众生世界不同，所见所闻根欲性异，故示所行亦有差别。又是菩萨发心相者，有三种心微细之相。云何为三？一者、真心，无分别故。二者、方便心，自然遍行，利益众生故。三者、业识心，微细起灭故。又是菩萨功德成满，于色究竟处示一切世间最高大身。谓以一念相应慧，无明顿尽，名一切种智，自然而有不思议业，能现十方利益众生。」","问曰：「虚空无边故世界无边，世界无边故众生无边，众生无边故心行差别亦复无边。如是境界不可分齐，难知难解。若无明断无有心想，云何能了，名一切种智？」","答曰：「一切境界，本来一心离于想念，以众生妄见境界故心有分齐，以妄起想念不称法性故不能决了。诸佛如来离于见想无所不遍，心真实故，即是诸法之性。自体显照一切妄法，有大智用无量方便，随诸众生所应得解，皆能开示种种法义，是故得名一切种智。」","又问曰：「若诸佛有自然业，能现一切处利益众生者，一切众生若见其身、若覩神变、若闻其说，无不得利。云何世间多不能见？」","答曰：「诸佛如来法身平等遍一切处，无有作意故。而说自然，但依众生心现。众生心者犹如于镜，镜若有垢，色像不现。如是众生心若有垢，法身不现故。」","已说解释分。","次说修行信心分。","是中依未入正定众生故，说修行信心。何等信心？云何修行？略说信心有四种。云何为四？一者、信根本，所谓乐念真如法故。二者、信佛有无量功德，常念亲近供养恭敬，发起善根，愿求一切智故。三者、信法有大利益，常念修行诸波罗蜜故。四者、信僧能正修行自利利他，常乐亲近诸菩萨众，求学如实行故。","修行有五门，能成此信。云何为五？一者、施门，二者、戒门，三者、忍门，四者、进门，五者、止观门。","云何修行施门？若见一切来求索者，所有财物随力施与，以自舍悭贪令彼欢喜。若见厄难恐怖危逼，随己堪任施与无畏。若有众生来求法者，随己能解方便为说。不应贪求名利恭敬，唯念自利利他回向菩提故。云何修行戒门？所谓不杀、不盗、不婬、不两舌、不恶口、不妄言、不绮语，远离贪嫉、欺诈、谄曲、瞋恚、邪见。若出家者为折伏烦恼故，亦应远离愦閙、常处寂静，修习少欲知足头陀等行。乃至小罪心生怖畏，惭愧改悔，不得轻于如来所制禁戒。当护讥嫌，不令众生妄起过罪故。云何修行忍门？所谓应忍他人之恼，心不怀报；亦当忍于利、衰、毁、誉、称、讥、苦、乐等法故。云何修行进门？所谓于诸善事心不懈退，立志坚强远离怯弱。当念过去久远已来，虚受一切身心大苦无有利益，是故应勤修诸功德，自利利他速离众苦。","复次，若人虽修行信心，以从先世来多有重罪恶业障故，为魔邪诸鬼之所恼乱，或为世间事务种种牵缠，或为病苦所恼。有如是等众多障碍，是故应当勇猛精勤，昼夜六时礼拜诸佛，诚心忏悔、劝请、随喜、回向菩提，常不休废，得免诸障、善根增长故。云何修行止观门？所言止者，谓止一切境界相，随顺奢摩他观义故。所言观者，谓分别因缘生灭相，随顺毘钵舍那观义故。云何随顺？以此二义，渐渐修习不相舍离，双现前故。若修止者，住于静处端坐正意，不依气息、不依形色、不依于空、不依地水火风，乃至不依见闻觉知。一切诸想随念皆除，亦遣除想，以一切法本来无相，念念不生、念念不灭，亦不得随心外念境界，后以心除心。心若驰散，即当摄来住于正念。是正念者，当知唯心，无外境界。即复此心亦无自相，念念不可得，若从坐起去来进止有所施作，于一切时常念方便随顺观察，久习淳熟其心得住。以心住故渐渐猛利，随顺得入真如三昧，深伏烦恼信心增长，速成不退。唯除疑惑、不信、诽谤、重罪、业障、我慢、懈怠，如是等人所不能入。","复次，依如是三昧故，则知法界一相。谓一切诸佛法身与众生身平等无二，即名一行三昧。当知真如是三昧根本，若人修行，渐渐能生无量三昧。或有众生无善根力，则为诸魔外道鬼神之所惑乱，若于坐中现形恐怖，或现端正男女等相，当念唯心，境界则灭，终不为恼。或现天像、菩萨像，亦作如来像相好具足，若说陀罗尼，若说布施、持戒、忍辱、精进、禅定、智慧，或说平等、空、无相、无愿、无怨无亲、无因无果、毕竟空寂是真涅槃。或令人知宿命过去之事，亦知未来之事，得他心智辩才无碍，能令众生贪著世间名利之事。又令使人数瞋数喜，性无常准。或多慈爱多睡多病，其心懈怠。或卒起精进后便休废，生于不信多疑多虑。或舍本胜行更修杂业。若著世事种种牵缠，亦能使人得诸三昧少分相似，皆是外道所得，非真三昧。或复令人若一日若二日若三日，乃至七日住于定中，得自然香美饮食，身心适悦不饥不渴，使人爱著。或亦令人食无分齐，乍多乍少颜色变异。以是义故，行者常应智慧观察，勿令此心堕于邪网。当勤正念不取不著，则能远离是诸业障。应知外道所有三昧，皆不离见爱我慢之心，贪著世间名利恭敬故。真如三昧者，不住见相、不住得相，乃至出定亦无懈慢，所有烦恼渐渐微薄。若诸凡夫不习此三昧法，得入如来种性，无有是处。以修世间诸禅三昧多起味著，依于我见系属三界，与外道共。若离善知识所护，则起外道见故。","复次，精勤专心修学此三昧者，现世当得十种利益。云何为十？一者、常为十方诸佛菩萨之所护念。二者、不为诸魔恶鬼所能恐怖。三者、不为九十五种外道鬼神之所惑乱。四者、远离诽谤甚深之法，重罪业障渐渐微薄。五者、灭一切疑诸恶觉观。六者、于如来境界信得增长。七者、远离忧悔，于生死中勇猛不怯。八者、其心柔和，舍于憍慢，不为他人所恼。九者、虽未得定，于一切时一切境界处，则能减损烦恼、不乐世间。十者、若得三昧，不为外缘一切音声之所惊动。","复次，若人唯修于止，则心沉没或起懈怠，不乐众善、远离大悲，是故修观。修习观者，当观一切世间有为之法，无得久停须臾变坏，一切心行念念生灭，以是故苦。应观过去所念诸法恍惚如梦，应观现在所念诸法犹如电光，应观未来所念诸法犹如于云忽尔而起，应观世间一切有身悉皆不净，种种秽污无一可乐。如是当念：「一切众生从无始世来，皆因无明所熏习故令心生灭，已受一切身心大苦。现在即有无量逼迫，未来所苦亦无分齐，难舍难离而不觉知。众生如是，甚为可愍。」作此思惟，即应勇猛立大誓愿：「愿令我心离分别故，遍于十方修行一切诸善功德，尽其未来，以无量方便救拔一切苦恼众生，令得涅槃第一义乐。」以起如是愿故，于一切时、一切处，所有众善，随己堪能不舍修学，心无懈怠，唯除坐时专念于止。若余一切，悉当观察应作不应作。若行若住、若卧若起，皆应止观俱行。所谓虽念诸法自性不生，而复即念因缘和合善恶之业，苦乐等报不失不坏。虽念因缘善恶业报，而亦即念性不可得。若修止者，对治凡夫住著世间，能舍二乘怯弱之见。若修观者，对治二乘不起大悲狭劣心过，远离凡夫不修善根。以此义故，是止观二门，共相助成，不相舍离。若止观不具，则无能入菩提之道。","复次，众生初学是法欲求正信，其心怯弱。以住于此娑婆世界，自畏不能常值诸佛、亲承供养。惧谓信心难可成就，意欲退者，当知如来有胜方便摄护信心。谓以专意念佛因缘，随愿得生他方佛土，常见于佛永离恶道。如修多罗说，若人专念西方极乐世界阿弥陀佛，所修善根，回向愿求生彼世界，即得往生，常见佛故，终无有退。若观彼佛真如法身，常勤修习毕竟得生，住正定故。","已说修行信心分。","次说劝修利益分。","如是摩诃衍诸佛秘藏，我已总说。若有众生，欲于如来甚深境界得生正信，远离诽谤入大乘道，当持此论思量修习，究竟能至无上之道。若人闻是法已不生怯弱，当知此人定绍佛种，必为诸佛之所授记。假使有人能化三千大千世界满中众生令行十善，不如有人于一食顷正思此法，过前功德不可为喻。复次，若人受持此论观察修行，若一日一夜，所有功德无量无边不可得说。假令十方一切诸佛，各于无量无边阿僧祇劫，叹其功德，亦不能尽。何以故？谓法性功德无有尽故。此人功德亦复如是，无有边际。其有众生，于此论中毁谤不信，所获罪报，经无量劫受大苦恼。是故众生但应仰信，不应诽谤，以深自害亦害他人，断绝一切三宝之种，以一切如来皆依此法得涅槃故，一切菩萨因之修行入佛智故。当知过去菩萨已依此法得成净信，现在菩萨今依此法得成净信，未来菩萨当依此法得成净信，是故众生应勤修学。",`诸佛甚深广大义，　我今随分总持说，
回此功德如法性，　普利一切众生界。`],source:"https://cbetaonline.dila.edu.tw/zh/T32n1666",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T32/T32n1666.xml",sourceLabel:"CBETA T32n1666",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"大乘起信論",juan:[1]},{id:"cbeta-t45n1858",title:"肇论",subtitle:"肇论 · 后秦 僧肇作",paragraphs:["宗本义","本无、实相、法性、性空、缘会，一义耳。何则？一切诸法，缘会而生。缘会而生，则未生无有，缘离则灭。如其真有，有则无灭。以此而推，故知虽今现有，有而性常自空。性常自空，故谓之性空。性空故，故曰法性。法性如是，故曰实相。实相自无，非推之使无，故名本无。言不有不无者，不如有见常见之有，邪见断见之无耳。若以有为有，则以无为无。夫不存无以观法者，可谓识法实相矣。虽观有而无所取相，然则法相为无相之相，圣人之心为住无所住矣。三乘，等观性空而得道也。性空者，谓诸法实相也。见法实相故云正观，若其异者便为邪观。设二乘不见此理，则颠倒也。是以三乘观法无异，但心有大小为差耳。沤和般若者，大慧之称也。诸法实相，谓之般若；能不形证，沤和功也。适化众生，谓之沤和；不染尘累，般若力也。然则般若之门观空，沤和之门涉有。涉有未始迷虚，故常处有而不染；不厌有而观空，故观空而不证。是谓一念之力权慧具矣。一念之力权慧具矣，好思，历然可解。泥洹尽谛者，直结尽而已，则生死永灭，故谓尽耳；无复别有一尽处耳。","物不迁论第一","夫生死交谢，寒暑迭迁，有物流动。人之常情。余则谓之不然。何者？《放光》云：「法无去来，无动转者。」寻夫不动之作，岂释动以求静？必求静于诸动。必求静于诸动，故虽动而常静；不释动以求静，故虽静而不离动。然则动静未始异，而惑者不同，缘使真言滞于竞辩，宗途屈于好异。所以静躁之极，未易言也。何者？夫谈真则逆俗，顺俗则违真。违真故迷性而莫返，逆俗故言淡而无味。缘使中人未分于存亡，下士抚掌而弗顾，近而不可知者，其唯物性乎！然不能自已，聊复寄心于动静之际，岂曰必然！试论之曰：","《道行》云：「诸法本无所从来，去亦无所至。」《中观》云：「观方知彼去，去者不至方。」斯皆即动而求静，以知物不迁，明矣。夫人之所谓动者，以昔物不至今，故曰动而非静。我之所谓静者，亦以昔物不至今，故曰静而非动。动而非静，以其不来；静而非动。以其不去。然则所造未尝异，所见未尝同。逆之所谓塞，顺之所谓通。苟得其道，复何滞哉！伤夫！人情之惑也久矣，目对真而莫觉。既知往物而不来，而谓今物而可往。往物既不来，今物何所往？何则？求向物于向，于向未甞无；责向物于今，于今未甞有。于今未尝有，以明物不来；于向未甞无，故知物不去。覆而求今，今亦不往。是谓昔物自在昔，不从今以至昔；今物自在今，不从昔以至今。故仲尼曰：「回也见新，交臂非故。」如此，则物不相往来，明矣。既无往返之微朕，有何物而可动乎？然则旋岚偃岳而常静，江河兢注而不流，野马飘鼓而不动，日月历天而不周。复何怪哉！噫！圣人有言曰：「人命逝速，速于川流。」是以声闻悟非常以成道，缘觉觉缘离以即真。苟万动而非化，岂寻化以阶道？覆寻圣言，微隐难测。若动而静，似去而留。可以神会，难以事求。是以言去不必去，闲人之常想；称住不必住，释人之所谓往耳。岂曰去而可遣、住而可留也。故《成具》云：「菩萨处计常之中，而演非常之教。」《摩诃衍论》云：「诸法不动，无去来处。」斯皆导达群方，两言一会，岂曰文殊而乖其致哉？是以言常而不住，称去而不迁。不迁，故虽往而常静；不住，故虽静而常往。虽静而常往，故往而弗迁；虽往而常静，故静而弗留矣。然则庄生之所以藏山，仲尼之所以临川，斯皆感往者之难留，岂曰排今而可往？是以观圣人心者，不同人之所见，得也。何者？人则谓少壮同体、百龄一质，徒知年往，不觉形随。是以梵志出家，白首而归。隣人见之曰：「昔人尚存乎？」梵志曰：「吾犹昔人，非昔人也。」隣人皆愕然，非其言也。所谓有力者负之而趋，昧者不觉。其斯之谓欤！是以如来因群情之所滞，则方言以辩惑，乘莫二之真心，吐不一之殊教，乖而不可异者，其唯圣言乎！故谈真有不迁之称，导俗有流动之说。虽复千途异唱，会归同致矣。而征文者闻不迁，则谓昔物不至今；聆流动者，而谓今物可至昔。既曰古今，而欲迁之者，何也？是以言往不必往，古今常存，以其不动；称去不必去，谓不从今至古，以其不来。不来，故不驰骋于古今；不动，故各性住于一世。然则群籍殊文、百家异说，苟得其会，岂殊文之能惑哉？是以人之所谓住，我则言其去；人之所谓去，我则言其住。然则去住虽殊，其致一也。故经云：「正言似反。谁当信者？」斯言有由矣。何者？人则求古于今，谓其不住。吾则求今于古，知其不去。今若至古，古应有今；古若至今，今应有古。今而无古，以知不来；古而无今，以知不去。若古不至今，今亦不至古，事各性住于一世，有何物而可去来？然则四象风驰、璇玑电卷，得意毫微，虽速而不转。是以如来，功流万世而常存，道通百劫而弥固。成山假就于始篑，修途托至于初步，果以功业不可朽故也。功业不可朽，故虽在昔而不化，不化故不迁。不迁故，则湛然明矣。故经云：「三灾弥纶而行业湛然。」信其言也。何者？果不俱因，因因而果。因因而果，因不昔灭；果不俱因，因不来今。不灭不来，则不迁之致明矣！复何惑于去留，踟蹰于动静之间哉？然则乾坤倒覆，无谓不静；洪流滔天，无谓其动。苟能契神于即物，斯不远而可知矣！","物不迁论（终）","不真空论第二","夫至虚无生者，盖是般若玄鉴之妙趣，有物之宗极者也。自非圣明特达，何能契神于有无之间哉？是以至人通神心于无穷，穷所不能滞；极耳目于视听，声色所不能制者，岂不以其即万物之自虚，故物不能累其神明者也。是以圣人乘真心而理顺，则无滞而不通；审一气以观化，故所遇而顺适。无滞而不通，故能混杂致湻；所遇而顺适，故则触物而一。如此，则万象虽殊而不能自异。不能自异，故知象非真象。象非真象故，则虽象而非象。然则物我同根、是非一气，潜微幽隐，殆非群情之所尽，故顷尔谈论，至于虚宗，每有不同。夫以不同而适同，有何物而可同哉？故众论竞作而性莫同焉。何则？心无者，无心于万物，万物未尝无。此得在于神静，失在于物虚。即色者，明色不自色，故虽色而非色也。夫言色者，但当色即色，岂待色色而后为色哉？此直语色不自色，未领色之非色也。本无者，情尚于无，多触言以宾无。故非有，有即无；非无，无亦无。寻夫立文之本旨者，直以非有非真有，非无非真无耳。何必非有无此有，非无无彼无？此直好无之谈，岂谓顺通事实，即物之情哉！夫以物物于物，则所物而可物；以物物非物，故虽物而非物。是以物不即名而就实，名不即物而履真。然则真谛独静于名教之外，岂曰文言之能辨哉？然不能杜默，聊复厝言以拟之。试论之曰：","《摩诃衍论》云：「诸法亦非有相，亦非无相。」《中论》云：「诸法不有不无者，第一真谛也。」寻夫不有不无者，岂谓涤除万物、杜塞视听，寂寥虚豁，然后为真谛者乎？诚以即物顺通，故物莫之逆；即伪即真，故性莫之易。性莫之易，故虽无而有；物莫之逆，故虽有而无。虽有而无，所谓非有；虽无而有，所谓非无。如此，则非无物也，物非真物。物非真物，故于何而可物？故经云：「色之性空，非色败空。」以明夫圣人之于物也，即万物之自虚，岂待宰割以求通哉！是以寝疾有不真之谈，超日有即虚之称；然则三藏殊文，统之者一也。故《放光》云：「第一真谛，无成无得；世俗谛故，便有成有得。」夫有得即是无得之伪号，无得即是有得之真名。真名故，虽真而非有；伪号故，虽伪而非无。是以言真未尝有，言伪未尝无。二言未始一，二理未始殊。故经云：「真谛、俗谛谓有异耶？答曰：无异也。」此经直辩真谛以明非有，俗谛以明非无；岂以谛二而二于物哉？然则万物果有其所以不有，有其所以不无。有其所以不有，故虽有而非有；有其所以不无，故虽无而非无。虽无而非无，无者不绝虚；虽有而非有，有者非真有。若有不即真，无不夷迹，然则有无称异，其致一也。故童子叹曰：「说法不有亦不无，以因缘故诸法生。」《璎珞经》云：「转法轮者，亦非有转，亦非无转，是谓转无所转。」此乃众经之微言也。何者？谓物无耶，则邪见非惑；谓物有耶，则常见为得。以物非无，故邪见为惑；以物非有，故常见不得。然则非有非无者，信真谛之谈也。故《道行》云：「心亦不有亦不无。」《中观》云：「物从因缘故不有，缘起故不无。」寻理，即其然矣。所以然者，夫有若真有，有自常有，岂待缘而后有哉？譬彼真无，无自常无，岂待缘而后无也！若有不自有，待缘而后有者，故知有非真有。有非真有，虽有，不可谓之有矣。不无者，夫无则湛然不动，可谓之无。万物若无，则不应起；起则非无。以明缘起故不无也。故《摩诃衍论》云：「一切诸法，一切因缘故应有；一切诸法，一切因缘故不应有。一切无法，一切因缘故应有；一切有法，一切因缘故不应有。」寻此有无之言，岂直反论而已哉！若应有，即是有，不应言无；若应无，即是无，不应言有。言有，是为假有，以明非无。借无，以辨非有。此事一称二，其文有似不同。苟领其所同，则无异而不同。然则万法，果有其所以不有不可得而有；有其所以不无不可得而无。何则？欲言其有，有非真生；欲言其无；事象既形。象形，不即无；非真，非实有。然则不真空义，显于兹矣！故《放光》云：「诸法假号不真，譬如幻化人。非无幻化人，幻化人非真人也。」夫以名求物，物无当名之实；以物求名，名无得物之功。物无当名之实，非物也；名无得物之功，非名也。是以名不当实，实不当名。名实无当，万物安在？故《中观》云：「物无彼此。」而人以此为此，以彼为彼。彼亦以此为彼，以彼为此。此、彼莫定乎一名，而惑者怀必然之志。然则彼此初非有，惑者初非无，既悟彼此之非有，有何物而可有哉？故知万物非真，假号久矣！是以《成具》立强名之文，园林托指马之况。如此，则深远之言，于何而不在！是以圣人乘千化而不变，履万惑而常通者，以其即万物之自虚，不假虚而虚物也。故经云：「甚奇，世尊！不动真际为诸法立处。」非离真而立处，立处即真也。然则道远乎哉？触事而真！圣远乎哉？体之即神！","不真空论（终）","般若无知论第三","夫般若虚玄者，盖是三乘之宗极也。诚真一之无差，然异端之论，纷然久矣。有天竺沙门鸠摩罗什者，少践大方，研机斯趣。独拔于言象之表，妙契于希夷之境；齐异学于迦夷，扬湻风于东扇。将爰烛殊方而匿籴凉土者，所以道不虚应，应必有由矣。弘始三年，岁次星纪，秦乘入国之谋，举师以来之意也。北天之运，数其然也。大秦天王者，道契百王之端，德洽千载之下，游刃万机，弘道终日，信季俗苍生之所天，释迦遗法之所仗也。时乃集义学沙门五百余人于逍遥观，躬执秦文，与什公参定方等。其所开拓者，岂谓当时之益，乃累劫之津梁矣。余以短乏，曾厕嘉会，以为上闻异要，始于时也。然则圣智幽微，深隐难测。无相无名，乃非言象之所得。为试罔象其怀，寄之狂言耳，岂曰圣心而可辨哉！试论之曰：","《放光》云：「般若无所有相，无生灭相。」《道行》云：「般若无所知、无所见。」此辨智照之用，而曰无相、无知者，何耶？果有无相之知、不知之照，明矣。何者？夫有所知，则有所不知。以圣心无知，故无所不知。不知之知，乃曰一切知。故经云：「圣心无所知，无所不知。」信矣！是以圣人虚其心而实其照，终日知而未尝知也。故能默耀韬光虚心玄鉴，闭智塞聪而独觉冥冥者矣。然则智有穷幽之鉴而无知焉，神有应会之用而无虑焉。神无虑，故能独王于世表；智无知，故能玄照于事外。智虽事外，未始无事；神虽世表，终日域中。所以俯仰顺化应接无穷，无幽不察而无照功。斯则无知之所知，圣神之所会也。然其为物也，实而不有、虚而不无。存而不可论者，其唯圣智乎。何者？欲言其有，无状无名；欲言其无，圣以之灵。圣以之灵，故虚不失照；无状无名，故照不失虚。照不失虚，故混而不渝；虚不失照，故动以接麁。是以圣智之用，未始暂废；求之形相，未暂可得。故《宝积》曰：「以无心意而现行。」《放光》云：「不动等觉而建立诸法。」所以圣迹万端，其致一而已矣。是以般若可虚而照，真谛可亡而知，万动可即而静，圣应可无而为。斯则不知而自知，不为而自为矣！复何知哉？复何为哉？","难曰：夫圣人真心独朗，物物斯照；应接无方，动与事会。物物斯照，故知无所遗；动与事会，故会不失机。会不失机，故必有会于可会；知无所遗，故必有知于可知。必有知于可知，故圣不虚知；必有会于可会；故圣不虚会。既知既会，而曰无知无会者。何耶？若夫忘知遗会者，则是圣人无私于知会，以成其私耳。斯可谓不自有其知，安得无知哉？","答曰：夫圣人功高二仪而不仁，明逾日月而弥昏，岂曰木石瞽其怀？其于无知而已哉。诚以异于人者神明，故不可以事相求之耳。子意欲令圣人不自有其知，而圣人未尝不有知，无乃乖于圣心、失于文旨者乎！何者？经云：「真般若者，清净如虚空，无知无见，无作无缘。」斯则知自无知矣，岂待返照然后无知哉？若有知性空而称净者，则不辨于惑智，三毒四倒亦皆清净，有何独尊于般若？若以所知美般若，所知非般若，所知自常净，故般若未尝净，亦无缘致净叹于般若。然经云「般若清净」者，将无以般若体性真净，本无惑取之知。本无惑取之知，不可以知名哉。岂唯无知名无知，知自无知矣！是以圣人以无知之般若，照彼无相之真谛。真谛无兔马之遗，般若无不穷之鉴，所以会而不差、当而无是。寂怕、无知，而无不知者矣。","难曰：夫物无以自通，故立名以通物。物虽非名，果有可名之物当于此名矣。是以即名求物，物不能隐。而论云「圣心无知」，又云「无所不知」。意谓无知未尝知，知未尝无知。斯则名教之所通，立言之本意也。然论者欲一于圣心，异于文旨。寻文求实，未见其当。何者？若知得于圣心，无知无所辨；若无知得于圣心，知亦无所辨；若二都无得，无所复论哉！","答曰：经云：「般若义者，无名无说，非有非无，非实非虚。」虚不失照，照不失虚，斯则无名之法，故非言所能言也。言虽不能言，然非言无以传，是以圣人终日言而未尝言也。今试为子狂言辨之。夫圣心者，微妙无相，不可为有；用之弥勤，不可为无。不可为无，故圣智存焉；不可为有，故名教绝焉。是以言知不为知，欲以通其鉴；不知非不知，欲以辨其相。辨相，不为无；通鉴，不为有。非有，故知而无知；非无；故无知而知。是以知即无知，无知即知。无以言异而异于圣心也。","难曰：夫真谛深玄，非智不测。圣智之能，在兹而显。故经云：「不得般若，不见真谛。」真谛，则般若之缘也。以缘求智，智则知矣。","答曰：以缘求智，智非知也。何者？放光云：「不缘色生识，是名不见色。」又云：「五阴清净故，般若清净。」般若即能知也，五阴即所知也。所知，即缘也。夫知与所知，相与而有、相与而无。相与而无，故物莫之有；相与而有，故物莫之无。物莫之无，故为缘之所起；物莫之有，故则缘所不能生。缘所不能生，故照缘而非知；为缘之所起，故知、缘相因而生。是以知与无知，生于所知矣。何者？夫智以知所知，取相故名知。真谛自无相，真智何由知？所以然者，夫所知非所知，所知生于知；所知既生知，知亦生所知。所、知既相生，相生即缘法，缘法故非真。非真，故非真谛也。故《中观》云：「物从因缘有，故不真。不从因缘有，故即真。」今真谛曰真，真则非缘。真非缘，故无物从缘而生也。故经云：「不见有法无缘而生。」是以真智观真谛，未尝取所知。智不取所知，此智何由知？然智非无知，但真谛非所知，故真智亦非知。而子欲以缘求智，故以智为知。缘自非缘，于何而求知？","难曰：论云「不取」者，为无知故不取？为知然后不取耶？若无知故不取，圣人则冥若夜游，不辨缁素之异耶！若知然后不取，知则异于不取矣！","答曰：非无知，故不取；又非知，然后不取。知即不取，故能不取而知。","难曰：论云「不取」者，诚以圣心不物于物，故无惑取也。无取则无是，无是则无当。谁当圣心，而云圣心无所不知耶？","答曰：然。无是、无当者。夫无当，则物无不当；无是；则物无不是。物无不是，故是而无是；物无不当，故当而无当。故经云：「尽见诸法而无所见。」","难曰：圣心非不能是，诚以无是可是。虽无是可是，故当是于无是矣。是以经云「真谛无相故般若无知」者，诚以般若无有有相之知。若以无相为无相，有何累于真谛耶？","答曰：圣人无无相也。何者？若以无相为无相，无相即为相。舍有而之无，譬犹逃峰而赴壑，俱不免于患矣。是以至人处有而不有，居无而不无。虽不取于有无，然亦不舍于有无。所以和光尘劳，周旋五趣，寂然而往，怕尔而来，恬淡无为而无不为。","难曰：圣心虽无知，然其应会之道不差。是以可应者应之，不可应者存之。然则圣心有时而生、有时而灭。可得然乎？","答曰：生灭者，生灭心也。圣人无心，生灭焉起？然非无心，但是无心心耳；又非不应，但是不应应耳。是以圣人应会之道，则信若四时之质。直以虚无为体，斯不可得而生、不可得而灭也。","难曰：圣智之无、惑智之无，俱无生灭。何以异之？","答曰：圣智之无者，无知；惑智之无者，知无。其无虽同，所以无者，异也。何者？夫圣心虚静，无知可无，可曰无知，非谓知无。惑智有知，故有知可无，可谓知无，非曰无知也。无知，即般若之无也；知无，即真谛之无也。是以般若之与真谛，言用，即同而异；言寂，即异而同。同，故无心于彼此；异，故不失于照功。是以辨同者同于异，辨异者异于同，斯则不可得而异、不可得而同也。何者？内有独鉴之明，外有万法之实。万法虽实，然非照不得。内外相与以成其照功，此则圣所不能同；用也。内虽照而无知，外虽实而无相。内外寂然，相与俱无，此则圣所不能异；寂也。是以经云「诸法不异」者，岂曰续凫截鹤、夷岳盈壑，然后无异哉？诚以不异于异，故虽异而不异也。故经云：「甚奇，世尊！于无异法中而说诸法异。」又云：「般若与诸法，亦不一相，亦不异相。」信矣。","难曰：论云「言用则异，言寂则同。」未详般若之内，则有用寂之异乎？","答曰：用即寂、寂即用，用寂体一，同出而异名；更无无用之寂而主于用也。是以智弥昧，照逾明；神弥静，应逾动。岂曰明昧动静之异哉？故《成具》云：「不为而过为。」《宝积》曰：「无心无识，无不觉知。」斯则穷神尽智，极象外之谈也。即之明文，圣心可知矣。","般若无知论（终）","刘遗民书问附","遗民和南：顷餐徽闻，有怀遥伫。岁未寒严，体中如何？音寄壅隔，增用抱蕴。弟子沉疴草泽，常有弊瘵耳。因慧明道人北游，裁通其情。古人不以形疏致淡，悟涉则亲。是以虽复江山悠邈，不面当年，至于企怀风味，镜心象迹，伫悦之勤，良以深矣。缅然无因，瞻霞永叹，顺时爱敬。冀因行李，数有承问。伏愿彼大众康和！外国法师休纳！上人以悟发之器而遘兹渊对，想开究之功，足以尽过半之思。故以每惟乖阔，愤愧何深。此山僧清常，道戒弥励，禅隐之余则惟研惟讲。恂恂穆穆，故可乐矣。弟子既以遂宿心，而覩兹上轨，感寄之诚，日月铭至。远法师顷恒履宜，思业精诣，干干宵夕。自非道用潜流，理为神御，孰以过顺之年，湛气若兹之勤？所以凭慰既深，仰谢逾绝。","去年夏末，始见生上人示《无知论》。才运清俊，旨中沈允，推涉圣文，婉而有归。披味殷勤，不能释手。直可谓浴心方等之渊，而悟怀绝冥之肆者矣！若令此辨遂通，则般若众流，殆不言而会。可不欣乎！可不欣乎！夫理微者辞险，唱独者应希。苟非绝言象之表者，将以存象而致乖乎？意谓，答以缘求智之章，婉转穷尽，极为精巧，无所间然矣。但暗者难以顿晓，犹有余疑一两，今辄题之如别。想从容之暇，复能麁为释之。","论序云：「般若之体，非有非无。虚不失照，照不失虚。故曰不动等觉而建立诸法。」下章云：「异乎人者神明，故不可以事相求之耳。」又云：「用即寂、寂即用。神弥静，应逾动。」夫圣心冥寂，理极同无。不疾而疾，不徐而徐。是以知不废寂、寂不废知，未始不寂、未始不知。故其运物，成功化世之道。虽处有名之中，而远与无名同。斯理之玄，固常所弥昧者矣。但今谈者，所疑于高论之旨，欲求圣心之异：为谓穷灵极数妙尽冥符耶？为将心体自然灵怕独感耶？若穷灵极数妙尽冥符，则寂照之名，故是定慧之体耳。若心体自然灵怕独感，则群数之应，固以几乎息矣。夫心数既玄而孤运其照，神湻化表而慧明独存。当有深证，可试为辨之。疑者当以抚会应机覩变之知，不可谓之不有矣。而论旨云「本无惑取之知」，而未释所以不取之理。谓宜先定圣心所以应会之道，为当唯照无相耶？为当咸覩其变耶？若覩其变，则异乎无相；若唯照无相，则无会可抚。既无会可抚，而有抚会之功。意有未悟，幸复诲之。论云「无当，则物无不当；无是，则物无不是。物无不是，故是而无是；物无不当，故当而无当。」夫无当而物无不当，乃所以为至当；无是而物无不是，乃所以为真是。岂有真是而非是、至当而非当，而云当而无当、是而无是耶？若谓至当非常当，真是非常是，此盖悟、惑之言本异耳，固论旨所以不明也。愿复重喻，以祛其惑矣。","论至日，即与远法师详省之，法师亦好相领得意。但标位似各有本，或当不必理尽同矣。顷兼以班诸有怀，屡有击其节者，而恨不得与斯人同时也。","答刘遗民书","不面在昔，伫想用劳。慧明道人至，得去年十二月疏并问。披寻返覆，欣若暂对。凉风届节，顷常如何？贪道劳疾，多不住耳。信南返不悉。八月十五日。释僧肇疏答。","服像虽殊，妙期不二；江山虽缅，理契则隣。所以望途致想，虚襟有寄。君既遂嘉遯之志，标越俗之美，独恬事外，欢足方寸。每一言集，何尝不远喻林下之雅咏，高致悠然。清散未期，厚自保爱。每因行李，数有承问。愿彼山僧无恙，道俗通佳。承远法师之胜常，以为欣慰。虽未清承，然服膺高轨。企伫之勤，为日久矣。公以过顺之年，湛气弥厉，养徒幽岩，抱一冲谷，遐迩仰咏，何美如之！每亦翘想一隅，悬庇霄岸。无由写敬，致慨良深！君清对终日，快有悟心之欢也。即此大众寻常，什法师如宜。秦王道性自然，天机迈俗，城堑三宝，弘道是务。由使异典、胜僧方远而至，灵鹫之风萃于兹土。领公远举，乃千载之津梁也。于西域还，得方等新经二百余部，请大乘禅师一人、三藏法师一人、毘婆沙法师二人。什法师于大石寺出新至诸经，法藏渊旷，日有异闻。禅师于瓦官寺教习禅道，门徒数百，夙夜匪懈，邕邕萧萧，致可欣乐。三藏法师于中寺出律藏，本末精悉，若覩初制。毘婆沙法师于石羊寺出《舍利弗阿毘昙》胡本，虽未及译，时问中事，发言新奇。贫道一生，猥参嘉运，遇兹盛化。自恨不覩释迦祇桓之集，余复何恨？而慨不得与清胜君子同斯法集耳。生上人顷在此同止数年，至于言话之际，常相称咏。中途还南，君得与相见。未更近问，惘悒何言！威道人至，得君《念佛三昧咏》，并得远法师《三昧咏》及〈序〉。此作兴寄既高，辞致清婉。能文之士，率称其美。可谓游涉圣门，扣玄关之唱也。君与法师当数有文集，因来何少？什法师以午年出《维摩经》，贫道时预听次；参承之暇，辄复条记成言，以为注解。辞虽不文，然义承有本。今因信持一本往南。君闲详，试可取看。","来问婉切，难为郢人。贫道思不关微，兼拙于笔语。且至趣无言，言必乖趣。云云不已，竟何所辨？聊以狂言，示詶来旨耳。","疏云「称圣心冥寂，理极同无。虽处有名之中，而远与无名同。」斯理之玄，固常弥昧者。以此为怀，自可忘言内得，取定方寸。复何足以人情之所异，而求圣心之异乎。","疏曰「谈者谓穷灵极数妙尽冥符，别寂照之名，故是定慧之体耳。若心体自然灵怕独感，则群数之应固以几乎息矣。」意谓，妙尽冥符，不可以定慧为名；灵怕独感；不可称群数以息。两言虽殊，妙用常一。迹我而乘，在圣不殊也。何者？夫圣人玄心默照，理极同无。既曰为同，同无不极。何有同无之极，而有定慧之名？定慧之名，非同外之称也。若称生同内，有称非同；若称生同外，称非我也。又圣心虚微，妙绝常境。感无不应，会无不通。冥机潜运，其用不勤。群数之应，亦何为而息耶？且夫心之有也，以其有有。有不自有，故圣心不有有。不有有，故有无有。有无有，故则无无。无无，故圣人不有不无。不有不无，其神乃虚。何者？夫有也、无也，心之影响也。言也、象也，影响之所攀缘也。有无既废，则心无影响。影响既沦，则言象莫测。言象莫测，则道绝群方。道绝群方，故能穷灵极数。穷灵极数，乃曰妙尽。妙尽之道，本乎无寄。夫无寄在乎冥寂，冥绝故虚以通之；妙尽存乎极数，极数故数以应之。数以应之，故动与事会；虚以通之，故道超名外。道超名外，因谓之无；动与事会，因谓之有。因谓之有者，应夫真有，强谓之然耳。彼何然哉？故经云：「圣智无知而无所不知，无为而无所不为。」此无言无相寂灭之道。岂曰有而为有、无而为无？动而乖静、静而废用耶？而今谈者多即言以定旨，寻大方而征隅，怀前识以标玄，存所存之必当。是以闻圣有知，谓之有心；闻圣无知；谓等大虚。有无之境，边见所存，岂是处中莫二之道乎！何者？万物虽殊，然性本常一；不可而物，然非不物。可物于物，则名相异陈；不物于物，则物而即真。是以圣人不物于物、不非物于物。不物于物，物非有也；不非物于物，物非无也。非有，所以不取；非无，所以不舍。不舍，故妙存即真；不取，故名相靡因。名相靡因，非有知也；妙存即真，非无知也。故经云：「般若于诸法，无取无舍，无知无不知。」此攀缘之外、绝心之域，而欲以有无诘者，不亦远乎！请诘夫陈有无者。夫智之生也，极于相内。法本无相，圣智何知？世称无知者，谓等木石、太虚、无情之流。灵鉴幽烛，形于未兆，道无隐机，宁曰无知？且无知生于无知，无无知也，无有知也。无有知也，谓之非有；无无知也，谓之非无。所以虚不失照、照不失虚，怕然永寂，靡执靡拘。孰能动之令有、静之使无耶？故经云：「真般若者，非有非无，无起无灭，不可说示于人。」何则？言其非有者，言其非是有，非谓是非有；言其非无者，言其非是无，非谓是非无。非有，非非有；非无，非非无。是以须菩提终日说般若，而云无所说。此绝言之道，知何以传？庶参玄君子，有以会之耳！","又云「宜先定圣心所以应会之道，为当唯照无相耶？为当咸覩其变耶？」谈者似谓无相与变，其旨不一，覩变则异乎无相，照无相则失于抚会。然则即真之义，或有滞也。经云：「色不异空，空不异色。色即是空，空即是色。」若如来旨，观色空时，应一心见色、一心见空。若一心见色，则唯色非空；若一心见空，则唯空非色。然则空色两陈，莫定其本也。是以经云「非色」者，诚以非色于色，不非色于非色。若非色于非色，太虚则非色，非色何所明？若以非色于色，即非色不异色。非色不异色，色即为非色。故知变即无相，无相即变。群情不同，故教迹有异耳。考之玄籍，本之圣意，岂复真伪殊心、空有异照耶！是以照无相，不失抚会之功；覩变动，不乖无相之旨。造有，不异无；造无，不异有。未尝不有，未尝不无，故曰「不动等觉而建立诸法」。以此而推，寂用何妨！如之何谓覩变之知，异无相之照乎，恐谈者脱谓空有两心，静躁殊用，故言覩变之知，不可谓之不有耳。若能舍已心于封内，寻玄机于事外，齐万有于一虚，晓至虚之非无者，当言至人终日应会，与物推移，乘运抚化，未始为有也。圣心若此，何有可取而曰「未释不取之理」。","又云「无是乃所以为真是，无当乃所以为至当。」亦可如来言耳。若能无心于为是，而是于无是，无心于为当，而当于无当者，则终日是，不乖于无是；终日当，不乖于无当。但恐有是于无是、有当于无当，所以为患耳。何者？若真是可是、至当可当，则名相以形，美恶是生。生生奔竞，孰与止之？是以圣人空洞其怀，无识无知。然居动用之域，而止无为之境，处有名之内，而宅绝言之乡。寂寥虚旷，莫可以形名得，若斯而已矣。乃曰真是可是、至当可当，未喻雅旨也。恐是当之生，物谓之然，彼自不然，何足以然耳。夫言迹之兴，异途之所由生也。而言有所不言，迹有所不迹。是以善言言者，求言所不能言；善迹迹者，寻迹所不能迹。至理虚玄，拟心已差，况乃有言，恐所示转远。庶通心君子，有以相期于文外耳。","涅槃无名论第四","表上秦主姚兴","僧肇言：肇闻天得一以清，地得一以宁，君王得一以治天下。伏惟陛下！叡哲钦明，道与神会；妙契环中，理无不统；游刃万机，弘道终日；威被苍生，垂文作则。所以域中有四大，而王居一焉。涅槃之道，盖是三乘之所归，方等之渊府。渺漭希夷，绝视听之域；幽致虚玄，殆非群情之所测。肇以人微，猥蒙国恩，得闲居学肆，在什公门下十有余载。虽众经殊致，胜趣非一，然涅槃一义，常以听习为先。但肇才识暗短，虽屡蒙诲喻，犹怀疑漠漠。为竭愚不已，亦如似有解。然未经高胜先唱，不敢自决。不幸什公去世，咨参无所，以为永慨。而陛下圣德不孤，独与什公神契，目击道存，快尽其中方寸，故能振彼玄风以启末俗。一日遇蒙〈答安城候姚嵩书问无为宗极〉：「何者？夫众生所以久流转生死者，皆由著欲故也。若欲止于心，即无复于生死。既无生死，潜神玄默，与虚空合其德，是名涅槃矣。既曰涅槃，复何容有名于其间哉！」斯乃穷微言之美，极象外之谈者也。自非道参文殊、德慈侔氏，孰能宣扬玄道、为法城堑，使夫大教卷而复舒，幽旨沦而更显。寻玩殷勤，不能暂舍。欣悟交怀，手舞弗暇。岂直当时之胜轨，方乃累劫之津梁矣。然圣旨渊玄，理微言约。可以匠彼先进、拯拔高士；惧言题之流，或未尽上意。庶拟孔易十翼之作，岂贪丰文，图以弘显幽旨。辄作《涅槃无名论》，论有九折十演，博采众经，托证成喻。以仰述陛下无名之致，岂曰关诣神心，穷究远当。聊以拟议玄门，班喻学徒耳。论末章云：「诸家通第一义谛，皆云廓然空寂，无有圣人。吾常以为太甚径庭、不近人情。若无圣人，知无者谁？」实如明诏！实如明诏！夫道，恍惚窈冥，其中有精。若无圣人，谁与道游？顷诸学徒，莫不踌躇道门，怏怏此旨，怀疑终日，莫之能正。幸遭高判，宗徒𢄶然；扣关之俦，蔚登玄室。真可谓法轮再转于阎浮，道光重映于千载者矣。今演论之作旨，曲辨涅槃无名之体，寂彼廓然排方外之谈。条牒如左，谨以仰呈。若少参圣旨，愿勅存记；如其有差，伏承指授。僧肇言。泥曰、泥洹、涅槃，此三名前后异出，盖是楚夏不同耳。云涅槃，音正也。","　　九折十演者","开宗第一","无名曰：经称有余涅槃、无余涅槃者，秦言无为，亦名灭度。无为者，取乎虚无寂寞，妙绝于有为。灭度者，言其大患永灭，超度四流。斯盖是镜像之所归，绝称之幽宅也。而曰有余、无余者，良是出处之异号，应物之假名耳。余尝试言之。夫涅槃之为道也，寂寥虚矌，不可以形名得；微妙无相，不可以有心知。超群有以幽升，量太虚而永久，随之弗得其踪，迎之罔眺其首，六趣不能摄其生，力负无以化其体。潢漭惚恍，若存若往，五目不覩其容，二听不闻其响。冥冥窈窅，谁见谁晓？弥纶靡所不在，而独曳于有无之表。然则言之者失其真，知之者反其愚，有之者乖其性，无之者伤其躯。所以释迦掩室于摩竭，净名杜口于毘耶，须菩提唱无说以显道，释梵绝听而雨华；斯皆理为神御，故口以之而默，岂曰无辩？辩所不能言也。经云：「真解脱者，离于言数，寂灭永安，无始无终，不晦不明，不寒不暑，湛若虚空，无名无说。」论曰：「涅槃非有，亦复非无。言语道断，心行处灭。」寻夫经论之作，岂虚搆哉？果有其所以不有，故不可得而有；有其所以不无，故不可得而无耳。何者？本之有境，则五阴永灭；推之无乡，而幽灵不竭。幽灵不竭，则抱一湛然；五阴永灭，则万累都捐。万累都捐，故与道通洞；抱一湛然，故神而无功。神而无功，故至功常存；与道通洞，故冲而不改。冲而不改，故不可为有；至功常存，故不可为无。然则有无绝于内，称谓沦于外，视听之所不暨，四空之所昏昧，恬焉而夷，怕焉而泰，九流于是乎交归，众圣于是乎冥会。斯乃希夷之境、太玄之乡。而欲以有无题榜，标其方域而语其神道者，不亦邈哉！","核体第二","有名曰：夫名号不虚生，称谓不自起。经称有余涅槃、无余涅槃者，盖是返本之真名，神道之妙称者也。请试陈之。有余者，谓如来大觉始兴，法身初建，澡八解之清流，憩七觉之茂林，积万善于旷劫，荡无始之遗尘，三明镜于内，神光照于外，结僧那于始心，终大悲以赴难。仰攀玄根，俯提弱丧，超迈三域，独蹈大方。启八正之平路，坦众庶之夷途，骋六通之神骥，乘五衍之安车。至能出生入死，与物推移，道无不洽，德无不施。穷化母之始物，极玄枢之妙用，廓虚宇于无疆，耀萨云于幽烛，将绝朕于九止，永沦太虚，而有余缘不尽，余迹不泯。业报犹魂，圣智尚存。此有余涅槃也。经曰：「陶治尘滓，如炼真金。万累都尽，而灵觉独存。」无余者，谓至人教缘都讫，灵照永灭，廓尔无朕，故曰无余。何则？夫大患莫若于有身，故灭身以归无；劳勤莫先于有智，故绝智以沦虚。然则智以形倦，形以智劳，轮转修途，疲而弗已。经曰：「智为杂毒，形为桎梏。渊默以之而辽，患难以之而起。」所以至人灰身灭智，捐形绝虑。内无机照之勤，外息大患之本，超然与群有永分，浑尔与太虚同体。寂焉无闻，怕尔无兆，冥冥长往，莫知所之。其犹灯尽火灭，膏明俱竭。此无余涅槃也。经云：「五阴永尽，譬如灯灭。」然则有余可以有称，无余可以无名。无名立，则宗虚者欣尚于冲默；有称生，则怀德者弥仰于圣功。斯乃诰典之所垂文，先圣之所轨辙。而曰有无绝于内，称谓沦于外，视听之所不暨，四空之所昏昧。使夫怀德者自绝，宗虚者靡托。无异杜耳目于胎壳，掩玄象于云霄外，而责宫商之异，辩玄素之殊者也。子徒知远推至人于有无之表，高韵绝唱于形名之外，而论旨竟莫知所归，幽途故自蕴而未显。静思幽寻，寄怀无所，岂所谓朗大明于冥室，奏玄响于无闻者哉！","位体第三","无名曰：有余、无余者，盖是涅槃之外称，应物之假名耳；而存称谓者封名，志器象者耽形。名也极于题目，形也尽于方圆；方圆有所不写，题目有所不传。焉可以名于无名，而形于无形者哉。难序云：「有余、无余者，信是权寂致教之本意，亦是如来隐显之诚迹也。但未是玄寂绝言之幽致，又非至人环中之妙术耳。」子独不闻正观之说欤？维摩诘言：「我观如来无始无终，六入已过、三界已出，不在方、不离方，非有为、非无为，不可以识识、不可以智知，无言无说，心行处灭。以此观者，乃名正观；以他观者。非见佛也。」《放光》云：「佛如虚空，无去无来，应缘而现，无有方所。」然则圣人之在天下也，寂莫虚无，无执无竞，导而弗先，感而后应。譬犹幽谷之响、明镜之像，对之弗知其所以来，随之因识其所以往。恍焉而有，总焉而亡；动而逾寂，隐而弥彰；出幽入冥，变化无常。其为称也，因应而作：显迹为生，息迹为灭；生名有余，灭名无余。然则有无之称本乎无名，无名之道于何不名？是以至人居方而方，止圆而圆，在天而天，处人而人。原夫能天能人者，岂天人之所能哉！果以非天非人，故能天能人耳。其为治也，故应而不为，因而不施。因而不施，故施莫之广；应而不为，故为莫之大。为莫之大，故乃返于小成；施莫之广，故乃归乎无名。经曰：「菩提之道，不可图度。高而无上，广不可极；渊而无下，深不可测；大包天地，细入无间。」故谓之道。然则涅槃之道，不可以有无得之，明矣。而惑者覩神变，因谓之有；见灭度，便谓之无。有无之境，妄想之域，岂足以标榜玄道而语圣心者乎？意谓，至人寂怕无兆，隐显同源，存不为有，亡不为无。何则？佛言：「吾无生不生，虽生不生；无形不形，虽形不形。」以知存不为有。经云：「菩萨入无尽三昧，尽见过去灭度诸佛。」又云：「入于涅槃而不般涅槃。」以知亡不为无。亡不为无，虽无而有；存不为有，虽有而无。虽有而无，故所谓非有；虽无而有，故所谓非无。然则涅槃之道，果出有无之域，绝言象之径。断矣！子乃云：「圣人患于有身，故灭身以归无；劳勤莫先于有智，故绝智以沦虚。」无乃乖乎神极、伤于玄旨者也。经曰：「法身无象，应物而形；般若无知，对缘而照。」万机顿赴而不挠其神，千难殊对而不干其虑，动若行云，止犹谷神。岂有心于彼此、情系于动静者乎？既无心于动静，亦无象于去来。去来不以象，故无器而不形；动静不以心，故无感而不应。然则心生于有心，象出于有象。象非我出，故金石流而不燋；心非我生，故日用而不动。纭纭自彼，于我何为？所以智周万物而不劳，形充八极而无患，益不可盈、损不可亏，宁复疴疠中逵，寿极双树，灵竭天棺，体尽焚燎者哉！而惑者居见闻之境，寻殊应之迹，秉执规矩而拟大方。欲以智劳至人、形患大圣，谓舍有入无，因以名之。岂谓采微言于听表，拔玄根于虚壤者哉？","征出第四","有名曰：夫浑元剖判，万有参分。有既有矣，不得不无。无自不无，必因于有。所以高下相倾、有无相生，此乃自然之数，数极于是。以此而观，化母所育理无幽显，恢恑憰怪无非有也。有化而无，无非无也。然则有无之境，理无不统。经曰：「有无二法，摄一切法。」又称三无为者，虚空、数缘尽、非数缘尽。数缘尽者，即涅槃也。而论云：「有无之表，别有妙道，妙于有无，谓之涅槃。」请核妙道之本。果若有也，虽妙非无；虽妙非无，即入有境。果若无也，无即无差；无而无差，即入无境。总而括之、即而究之，无有异有而非无，无有异无而非有者。明矣。而曰「有无之外别有妙道，非有非无谓之涅槃。」吾闻其语，未即于心也。","超境第五","无名曰：有无之数，诚以法无不该、理无不统。然其所统，俗谛而已。经曰：「真谛何耶？涅槃道是。俗谛何耶？有无法是。」何则？有者有于无，无者无于有。有无所以称有，无有所以称无。然则有生于无、无生于有，离有无无、离无无有。有无相生。其犹高下相倾，有高必有下，有下必有高矣。然则有无虽殊，俱未免于有也。此乃言象之所以形，是非之所以生。岂是以统夫幽极、拟夫神道者乎！是以论称出有无者，良以有无之数止乎六境之内，六境之内非涅槃之宅，故借出以祛之。庶悕道之流，髣髴幽途，托情绝域，得意忘言，体其非有非无。岂曰有无之外，别有一有而可称哉？经曰「三无为」者，盖是群生纷绕，生乎笃患；笃患之尤，莫先于有；绝有之称，莫先于无，故借无以明其非有。明其非有，非谓无也。","搜玄第六","有名曰：论自云「涅槃既不出有无，又不在有无。」不在有无，则不可于有无得之矣；不出有无，则不可离有无求之矣。求之无所，便应都无。然复不无其道。其道不无，则幽途可寻。所以千圣同辙，未尝虚返者也。其道既存，而曰不出不在，必有异旨。可得闻乎？","妙存第七","无名曰：夫言由名起，名以相生。相因可相，无相无名；无名无说，无说无闻。经曰：「涅槃非法、非非法。无闻无说，非心所知。」吾何敢言之？而子欲闻之耶！虽然，善吉有言：「众人若能以无心而受、无听而听者，吾当以无言言之。」庶述其言，亦可以言。净名曰：「不离烦恼而得涅槃。」天女曰：「不出魔界而入佛界。」然则玄道在于妙悟，妙悟在于即真，即真即有无齐观，齐观即彼己莫二。所以天地与我同根，万物与我一体。同我则非复有无，异我则乖于会通。所以不出不在而道存乎其间矣。何则？夫至人虚心冥照，理无不统。怀六合于胸中而灵鉴有余，镜万有于方寸而其神常虚。至能拔玄根于未始，即群动以静心。恬淡渊默，妙契自然。所以处有不有，居无不无。居无不无，故不无于无；处有不有，故不有于有。故能不出有无而不在有无者也。然则法无有无之相，圣无有无之知。圣无有无之知，则无心于内；法无有无之相，则无数于外。于外无数、于内无心，彼此寂灭，物我冥一，怕尔无朕，乃曰涅槃。涅槃若此，图度绝矣。岂容可责之于有无之内，又可征之有无之外耶？","难差第八","有名曰：涅槃既绝图度之域，则超六境之外，不出不在而玄道独存。斯则穷理尽性究竟之道，妙一无差。理其然矣。而《放光》云：「三乘之道，皆因无为而有差别。」佛言：「我昔为菩萨时，名曰儒童。于然灯佛所，已入涅槃。」儒童菩萨时于七住初获无生忍，进修三位。若涅槃一也，则不应有三；如其有三，则非究竟。究竟之道，而有升降之殊。众经异说，何以取中耶？","辩差第九","无名曰：然究竟之道，理无差也。《法华经》云：「第一大道无有两正，吾以方便为怠慢者，于一乘道分别说三。」三车出火宅，即其事也。以俱出生死，故同称无为；所乘不一，故有三名。统其会归，一而已矣。而难云「三乘之道，皆因无为而有差别。」此以人三，三于无为，非无为有三也。故《放光》云：「涅槃有差别耶？答曰：无差别。」但如来结习都尽，声闻结习不尽耳。请以近喻，以况远旨。如人斩木，去尺无尺，去寸无寸。修短在于尺寸，不在无也。夫以群生万端，识根不一，智鉴有浅深，德行有厚薄，所以俱之彼岸，而升降不同。彼岸岂异？异自我耳。然则众经殊辩，其致不乖。","责异第十","有名曰：俱出火宅，则无患一也。同出生死，则无为一也。而云「彼岸无异，异自我耳。」彼岸，则无为岸也；我，则体无为者也。请问我与无为，为一？为异？若我即无为，无为亦即我。不得言无为无异，异自我也。若我异无为，我则非无为。无为自无为，我自常有为。冥会之致，又滞而不通。然则我与无为，一亦无三，异亦无三。三乘之名，何由而生也？","会异第十一","无名曰：夫止此而此、适彼而彼，所以同于得者，得亦得之；同于失者，失亦失之。我适无为，我即无为。无为虽一，何乖不一耶！譬犹三鸟出网，同适无患之域。无患虽同，而鸟鸟各异。不可以鸟鸟各异，谓无患亦异。又不可以无患既一，而一于众鸟也。然则鸟即无患，无患即鸟。无患岂异？异自鸟耳。如是三乘众生，俱越妄想之樊，同适无为之境。无为虽同，而乘乘各异。不可以乘乘各异，谓无为亦异。又不可以无为既一，而一于三乘也。然则我即无为，无为即我。无为岂异？异自我耳。所以无患虽同，而升虚有远近；无为虽一，而幽鉴有浅深。无为即乘也，乘即无为也。此非我异无为，以未尽无为故有三耳。","诘渐第十二","有名曰：万累滋彰，本于妄想；妄想既祛，则万累都息。二乘得尽智、菩萨得无生智，是时妄想都尽，结缚永除；结缚既除，则心无为；心既无为，理无余翳。经曰：「是诸圣智，不相违背。不出不在，其实俱空。」又曰：「无为大道，平等不二。」既曰无二，则不容心异。不体则已，体应穷微。而曰「体而未尽」，是所未悟也。","明渐第十三","无名曰：无为无二，则已然矣。结是重惑，可谓顿尽，亦所未喻。经曰：「三箭中的，三兽渡河。」中渡无异，而有浅深之殊者，为力不同故也。三乘众生，俱济缘起之津，同鉴四谛之的，绝伪即真，同升无为。然则所乘不一者，亦以智力不同故也。夫群有虽众，然其量有涯。正使智犹身子、辩若满愿，穷才极虑，莫窥其畔。况乎虚无之数、重玄之域，其道无涯，欲之顿尽耶？书不云乎：「为学者日益，为道者日损。」为道者，为于无为者也。为于无为而曰日损，此岂顿得之谓？要损之又损之，以至于无损耳。经喻萤日，智用可知矣！","讥动第十四","有名曰：经称「法身已上，入无为境。心不可以智知，形不可以象测。体绝阴入，心智寂灭。」而复云「进修三位，积德弥广。」夫进修本于好尚，积德生于涉求。好尚则取舍情现，涉求则损益交陈。既以取舍为心、损益为体，而曰体绝阴入，心智寂灭。此文乖致殊，而会之一人，无异指南为北，以晓迷夫。","动寂第十五","无名曰：经称「圣人无为而无所不为。」无为，故虽动而常寂；无所不为，故虽寂而常动。虽寂而常动，故物莫能一；虽动而常寂，故物莫能二。物莫能二，故逾动逾寂；物莫能一，故逾寂逾动。所以为即无为、无为即为，动寂虽殊而莫之可异也。《道行》曰：「心亦不有亦不无。」不有者，不若有心之有；不无者，不若无心之无。何者？有心，则众庶是也；无心，则太虚是也。众庶止于妄想，太虚绝于灵照；岂可止于妄想、绝于灵照，标其神道而语圣心者乎？是以圣心不有，不可谓之无；圣心不无，不可谓之有。不有，故心想都灭；不无；故理无不契。理无不契，故万德斯弘；心想都灭，故功成非我。所以应化无方，未尝有为；寂然不动，未尝不为。经曰：「心无所行，无所不行。」信矣。儒僮曰：「昔我于无数劫，国财身命施人无数；以妄想心施，非为施也。今以无生心，五华施佛，始名施耳。」又空行菩萨入空解脱门，方言「今是行时，非为证时。」然则心弥虚，行弥广；终日行，不乖于无行者也。是以《贤劫》称无舍之檀，《成具》美不为之为，禅典唱无缘之慈，《思益》演不知之知。圣旨虚玄，殊文同辩；岂可以有为便有为、无为便无为哉？菩萨住尽不尽平等法门，不尽有为、不住无为。即其事也。而以南北为喻，殊非领会之唱。","穷源第十六","有名曰：非众生无以御三乘，非三乘无以成涅槃。然必先有众生，后有涅槃。是则涅槃有始，有始必有终。而经云：「涅槃无始无终，湛若虚空。」则涅槃先有，非复学而后成者也。","通古第十七","无名曰：夫至人空洞无象，而万物无非我造。会万物以成已者，其唯圣人乎！何则？非理不圣，非圣不理；理而为圣者，圣不异理也。故天帝曰：「般若当于何求？」善吉曰：「般若不可于色中求，亦不离色中求。」又曰：「见缘起为见法，见法为见佛。」斯则物我不异之效也。所以至人戢玄机于未兆，藏冥运于即化，总六合以镜心，一去来以成体。古今通，始终同，穷本极末，莫之与二，浩然大均，乃曰涅槃。经曰：「不离诸法而得涅槃。」又曰：「诸法无边，故菩提无边。」以知涅槃之道，存乎妙契；妙契之致，本乎冥一。然则物不异我、我不异物，物我玄会，归乎无极。进之弗先，退之弗后，岂容终始于其间哉？天女曰：「耆年解脱亦如何久。」","考得第十八","有名曰：经云：「众生之性，极于五阴之内。」又云：「得涅槃者，五阴都尽，譬犹灯灭。」然则众生之性，顿尽于五阴之内；涅槃之道，独建于三有之外。貌然殊域，非复众生得涅槃也。果若有得，则众生之性不止于五阴；必若止于五阴，则五阴不都尽。五阴若都尽，谁复得涅槃耶？","玄得第十九","无名曰：夫真由离起，伪因著生；著故有得，离故无名。是以则真者同真，法伪者同伪。子以有得为得，故求于有得耳。吾以无得为得，故得在于无得也。且谈论之作，必先定其本。既论涅槃，不可离涅槃而语涅槃也。若即涅槃以兴言，谁独非涅槃而欲得之耶？何者？夫涅槃之道，妙尽常数，融治二仪，荡涤万有，均天人，同一异。内视不已见，返听不我闻；未尝有得，未尝无得。经曰：「涅槃非众生，亦不异众生。」维摩诘言：「若弥勒得灭度者，一切众生亦当灭度。所以者何？一切众生本性常灭，不复更灭。」此名灭度，在于无灭者也。然则众生非众生，谁为得之者？涅槃非涅槃，谁为可得者？《放光》云：「菩提从有得耶？答曰：不也。从无得耶？答曰：不也。从有无得耶？答曰：不也。离有无得耶？答曰：不也。然则都无得耶？答曰：不也。是义云何？答曰：无所得故为得也，是故得无所得也。」无所得谓之得者，谁独不然耶？然则玄道在于绝域，故不得以得之；妙智存乎物外，故不知以知之。大象隐于无形；故不见以见之；大音匿于希声，故不闻以闻之。故能囊括终古导达群方，亭毒苍生疎而不漏。汪哉洋哉，何莫由之哉！故梵志曰：「吾闻佛道，厥义弘深，汪洋无涯；靡不成就，靡不度生。」然则三乘之路开，真伪之途辩，贤圣之道存，无名之致显矣！","涅槃无名论（终）"],source:"https://cbetaonline.dila.edu.tw/zh/T45n1858",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T45/T45n1858.xml",sourceLabel:"CBETA T45n1858",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"肇論",juan:[1]},{id:"cbeta-t48n2008",title:"六祖大师法宝坛经",subtitle:"六祖大师法宝坛经 · 元 宗宝编",paragraphs:["行由第一","时，大师至宝林。韶州韦刺史（名璩）与官僚入山请师，出于城中大梵寺讲堂，为众开缘说法。师升座次，刺史官僚三十余人，儒宗学士三十余人，僧尼道俗一千余人，同时作礼，愿闻法要。","大师告众曰：「善知识！菩提自性，本来清净，但用此心，直了成佛。善知识！且听惠能行由，得法事意。惠能严父，本贯范阳，左降流于岭南，作新州百姓。此身不幸，父又早亡。老母孤遗，移来南海，艰辛贫乏，于市卖柴。时，有一客买柴，使令送至客店；客收去，惠能得钱，却出门外，见一客诵经。惠能一闻经语，心即开悟，遂问：『客诵何经？』客曰：『《金刚经》。』复问：『从何所来，持此经典？』客云：『我从蕲州黄梅县东禅寺来。其寺是五祖忍大师在彼主化，门人一千有余；我到彼中礼拜，听受此经。大师常劝僧俗，但持《金刚经》，即自见性，直了成佛。』惠能闻说，宿昔有缘，乃蒙一客，取银十两与惠能，令充老母衣粮，教便往黄梅参礼五祖。","「惠能安置母毕，即便辞违。不经三十余日，便至黄梅，礼拜五祖。祖问曰：『汝何方人？欲求何物？』惠能对曰：『弟子是岭南新州百姓，远来礼师，惟求作佛，不求余物。』祖言：『汝是岭南人，又是猎獠，若为堪作佛？』惠能曰：『人虽有南北，佛性本无南北；猎獠身与和尚不同，佛性有何差别？』五祖更欲与语，且见徒众总在左右，乃令随众作务。惠能曰：『惠能启和尚，弟子自心，常生智慧，不离自性，即是福田。未审和尚教作何务？』祖云：『这獦獠根性大利！汝更勿言，著槽厂去。』惠能退至后院，有一行者，差惠能破柴踏碓。经八月余，祖一日忽见惠能曰：『吾思汝之见可用，恐有恶人害汝，遂不与汝言。汝知之否？』惠能曰：『弟子亦知师意，不敢行至堂前，令人不觉。』","「祖一日唤诸门人总来：『吾向汝说，世人生死事大，汝等终日只求福田，不求出离生死苦海；自性若迷，福何可救？汝等各去，自看智慧，取自本心般若之性，各作一偈，来呈吾看。若悟大意，付汝衣法，为第六代祖。火急速去，不得迟滞，思量即不中用；见性之人，言下须见。若如此者，轮刀上阵，亦得见之。』（喻利根者）众得处分，退而递相谓曰：『我等众人，不须澄心用意作偈，将呈和尚，有何所益？神秀上座，现为教授师，必是他得。我辈谩作偈颂，枉用心力。』余人闻语，总皆息心，咸言：『我等已后依止秀师，何烦作偈？』神秀思惟：『诸人不呈偈者，为我与他为教授师；我须作偈，将呈和尚，若不呈偈，和尚如何知我心中见解深浅？我呈偈意，求法即善，觅祖即恶，却同凡心，夺其圣位奚别？若不呈偈，终不得法。大难！大难！』","「五祖堂前，有步廊三间，拟请供奉卢珍，画楞伽经变相，及五祖血脉图，流传供养。神秀作偈成已，数度欲呈，行至堂前，心中恍惚，遍身汗流，拟呈不得；前后经四日，一十三度呈偈不得。秀乃思惟：『不如向廊下书著，从他和尚看见，忽若道好，即出礼拜，云是秀作；若道不堪，枉向山中数年，受人礼拜，更修何道？』是夜三更，不使人知，自执灯，书偈于南廊壁间，呈心所见。偈曰：",`「身是菩提树，　心如明镜台，
时时勤拂拭，　勿使惹尘埃。`,"「秀书偈了，便却归房，人总不知。秀复思惟：『五祖明日见偈欢喜，即我与法有缘；若言不堪，自是我迷，宿业障重，不合得法。』圣意难测，房中思想，坐卧不安，直至五更。祖已知神秀入门未得，不见自性。","「天明，祖唤卢供奉来，向南廊壁间，绘画图相，忽见其偈，报言：『供奉却不用画，劳尔远来。经云：「凡所有相，皆是虚妄。」但留此偈，与人诵持。依此偈修，免堕恶道；依此偈修，有大利益。』令门人炷香礼敬，尽诵此偈，即得见性。门人诵偈，皆叹善哉。","「祖，三更唤秀入堂，问曰：『偈是汝作否？』秀言：『实是秀作，不敢妄求祖位，望和尚慈悲，看弟子有少智慧否？』祖曰：『汝作此偈，未见本性，只到门外，未入门内。如此见解，觅无上菩提，了不可得；无上菩提，须得言下识自本心，见自本性不生不灭；于一切时中，念念自见万法无滞，一真一切真，万境自如如。如如之心，即是真实。若如是见，即是无上菩提之自性也。汝且去，一两日思惟，更作一偈，将来吾看；汝偈若入得门，付汝衣法。』神秀作礼而出。又经数日，作偈不成，心中恍惚，神思不安，犹如梦中，行坐不乐。","「复两日，有一童子于碓坊过，唱诵其偈；惠能一闻，便知此偈未见本性，虽未蒙教授，早识大意。遂问童子曰：『诵者何偈？』童子曰：『尔这猎獠不知，大师言：「世人生死事大，欲得传付衣法，令门人作偈来看。若悟大意，即付衣法为第六祖。」神秀上座，于南廊壁上，书无相偈，大师令人皆诵，依此偈修，免堕恶道；依此偈修，有大利益。』惠能曰：『（一本有我亦要诵此，结来生缘）上人！我此踏碓，八个余月，未曾行到堂前。望上人引至偈前礼拜。』童子引至偈前礼拜，惠能曰：『惠能不识字，请上人为读。』时，有江州别驾，姓张名日用，便高声读。惠能闻已，遂言：『亦有一偈，望别驾为书。』别驾言：『汝亦作偈？其事希有。』惠能向别驾言：『欲学无上菩提，不得轻于初学。下下人有上上智，上上人有没意智。若轻人，即有无量无边罪。』别驾言：『汝但诵偈，吾为汝书。汝若得法，先须度吾。勿忘此言。』惠能偈曰：",`「菩提本无树，　明镜亦非台；
本来无一物，　何处惹尘埃？`,"「书此偈已，徒众总惊，无不嗟讶，各相谓言：『奇哉！不得以貌取人，何得多时使他肉身菩萨。』祖见众人惊怪，恐人损害，遂将鞋擦了偈，曰：『亦未见性。』众以为然。","「次日，祖潜至碓坊，见能腰石舂米，语曰：『求道之人，为法忘躯，当如是乎！』乃问曰：『米熟也未？』惠能曰：『米熟久矣，犹欠筛在。』祖以杖击碓三下而去。惠能即会祖意，三鼓入室；祖以袈裟遮围，不令人见，为说《金刚经》。至『应无所住而生其心』，惠能言下大悟，一切万法，不离自性。遂启祖言：『何期自性，本自清净；何期自性，本不生灭；何期自性，本自具足；何期自性，本无动摇；何期自性，能生万法。』祖知悟本性，谓惠能曰：『不识本心，学法无益；若识自本心，见自本性，即名丈夫、天人师、佛。』三更受法，人尽不知，便传顿教及衣钵，云：『汝为第六代祖，善自护念，广度有情，流布将来，无令断绝。听吾偈曰：",`「『有情来下种，　因地果还生，
无情既无种，　无性亦无生。』`,"「祖复曰：『昔达磨大师，初来此土，人未之信，故传此衣，以为信体，代代相承；法则以心传心，皆令自悟自解。自古，佛佛惟传本体，师师密付本心；衣为争端，止汝勿传。若传此衣，命如悬丝。汝须速去，恐人害汝。』惠能启曰：『向甚处去？』祖云：『逢怀则止，遇会则藏。』惠能三更领得衣钵，云：『能本是南中人，素不知此山路，如何出得江口？』五祖言：『汝不须忧，吾自送汝。』祖相送，直至九江驿。祖令上船，五祖把𫇛自摇。惠能言：『请和尚坐。弟子合摇𫇛。』祖云：『合是吾渡汝。』惠能云：『迷时师度，悟了自度；度名虽一，用处不同。惠能生在边方，语音不正，蒙师传法，今已得悟，只合自性自度。』祖云：『如是，如是！以后佛法，由汝大行。汝去三年，吾方逝世。汝今好去，努力向南。不宜速说，佛法难起。』","「惠能辞违祖已，发足南行。两月中间，至大庾岭（五祖归，数日不上堂。众疑，诣问曰：『和尚少病少恼否？』曰：『病即无。衣法已南矣。』问：『谁人传授？』曰：『能者得之。』众乃知焉）。逐后数百人来，欲夺衣钵。一僧俗姓陈，名惠明，先是四品将军，性行麁慥，极意参寻。为众人先，趁及惠能。惠能掷下衣钵于石上，云：『此衣表信，可力争耶？』能隐草莽中。惠明至，提掇不动，乃唤云：『行者！行者！我为法来，不为衣来。』惠能遂出，坐盘石上。惠明作礼云：『望行者为我说法。』惠能云：『汝既为法而来，可屏息诸缘，勿生一念。吾为汝说。』明良久。惠能云：『不思善，不思恶，正与么时，那个是明上座本来面目？』惠明言下大悟。复问云：『上来密语密意外，还更有密意否？』惠能云：『与汝说者，即非密也。汝若返照，密在汝边。』明曰：『惠明虽在黄梅，实未省自己面目。今蒙指示，如人饮水，冷暖自知。今行者即惠明师也。』惠能曰：『汝若如是，吾与汝同师黄梅，善自护持。』明又问：『惠明今后向甚处去？』惠能曰：『逢袁则止，遇蒙则居。』明礼辞（明回至岭下，谓趁众曰：『向陟崔嵬，竟无踪迹，当别道寻之。』趁众咸以为然。惠明后改道明，避师上字）。","「惠能后至曹溪，又被恶人寻逐。乃于四会，避难猎人队中，凡经一十五载，时与猎人随宜说法。猎人常令守网，每见生命，尽放之。每至饭时，以菜寄煮肉锅。或问，则对曰：『但吃肉边菜。』","「一日思惟：『时当弘法，不可终遯。』遂出至广州法性寺，值印宗法师讲《涅槃经》。时有风吹旛动，一僧曰：『风动。』一僧曰：『旛动。』议论不已。惠能进曰：『不是风动，不是旛动，仁者心动。』一众骇然。印宗延至上席，征诘奥义。见惠能言简理当，不由文字，宗云：『行者定非常人。久闻黄梅衣法南来，莫是行者否？』惠能曰：『不敢。』宗于是作礼，告请传来衣钵出示大众。宗复问曰：『黄梅付嘱，如何指授？』惠能曰：『指授即无；惟论见性，不论禅定解脱。』宗曰：『何不论禅定解脱？』能曰：『为是二法，不是佛法。佛法是不二之法。』宗又问：『如何是佛法不二之法？』惠能曰：『法师讲《涅槃经》，明佛性，是佛法不二之法。如高贵德王菩萨白佛言：「犯四重禁、作五逆罪，及一阐提等，当断善根佛性否？」佛言：「善根有二：一者常，二者无常，佛性非常非无常，是故不断，名为不二。一者善，二者不善，佛性非善非不善，是名不二。蕴之与界，凡夫见二，智者了达其性无二，无二之性即是佛性。」』印宗闻说，欢喜合掌，言：『某甲讲经，犹如瓦砾；仁者论义，犹如真金。』于是为惠能剃发，愿事为师。惠能遂于菩提树下，开东山法门。","「惠能于东山得法，辛苦受尽，命似悬丝。今日得与使君、官僚、僧尼、道俗同此一会，莫非累劫之缘，亦是过去生中供养诸佛，同种善根，方始得闻如上顿教得法之因。教是先圣所传，不是惠能自智。愿闻先圣教者，各令净心，闻了各自除疑，如先代圣人无别。」","一众闻法，欢喜作礼而退。","般若第二","次日，韦使君请益。师升座，告大众曰：「总净心念摩诃般若波罗蜜多。」复云：「善知识！菩提般若之智，世人本自有之；只缘心迷，不能自悟，须假大善知识，示导见性。当知愚人智人，佛性本无差别，只缘迷悟不同，所以有愚有智。吾今为说摩诃般若波罗蜜法，使汝等各得智慧。志心谛听！吾为汝说。善知识！世人终日口念般若，不识自性般若，犹如说食不饱。口但说空，万劫不得见性，终无有益。善知识！摩诃般若波罗蜜是梵语，此言大智慧到彼岸。此须心行，不在口念。口念心不行，如幻、如化、如露、如电；口念心行，则心口相应，本性是佛，离性无别佛。何名摩诃？摩诃是大。心量广大，犹如虚空，无有边畔，亦无方圆大小，亦非青黄赤白，亦无上下长短，亦无瞋无喜，无是无非，无善无恶，无有头尾。诸佛刹土，尽同虚空。世人妙性本空，无有一法可得。自性真空，亦复如是。善知识！莫闻吾说空，便即著空。第一莫著空，若空心静坐，即著无记空。善知识！世界虚空，能含万物色像，日月星宿，山河大地，泉源溪涧，草木丛林，恶人善人，恶法善法，天堂地狱，一切大海，须弥诸山，总在空中。世人性空，亦复如是。善知识！自性能含万法是大，万法在诸人性中。若见一切人、恶之与善，尽皆不取不舍亦不染著，心如虚空，名之为大，故曰摩诃。善知识！迷人口说，智者心行。又有迷人，空心静坐，百无所思，自称为大。此一辈人，不可与语，为邪见故。善知识！心量广大，遍周法界，用即了了分明，应用便知一切。一切即一，一即一切。去来自由，心体无滞，即是般若。善知识！一切般若智，皆从自性而生，不从外入。莫错用意，名为真性自用，一真一切真。心量大事，不行小道。口莫终日说空，心中不修此行，恰似凡人自称国王，终不可得，非吾弟子。","「善知识！何名般若？般若者，唐言智慧也。一切处所，一切时中，念念不愚，常行智慧，即是般若行。一念愚即般若绝，一念智即般若生。世人愚迷，不见般若，口说般若，心中常愚。常自言：『我修般若。』念念说空，不识真空。般若无形相，智慧心即是。若作如是解，即名般若智。何名波罗蜜？此是西国语，唐言到彼岸，解义离生灭。著境生灭起，如水有波浪，即名为此岸；离境无生灭，如水常通流，即名为彼岸，故号波罗蜜。善知识！迷人口念，当念之时，有妄有非。念念若行，是名真性。悟此法者，是般若法；修此行者，是般若行。不修即凡；一念修行，自身等佛。善知识！凡夫即佛，烦恼即菩提。前念迷即凡夫，后念悟即佛。前念著境即烦恼，后念离境即菩提。","「善知识！摩诃般若波罗蜜，最尊最上最第一，无住无往亦无来，三世诸佛从中出。当用大智慧，打破五蕴烦恼尘劳。如此修行，定成佛道，变三毒为戒定慧。善知识！我此法门，从一般若生八万四千智慧。何以故？为世人有八万四千尘劳。若无尘劳，智慧常现，不离自性。悟此法者，即是无念，无忆无著，不起诳妄。用自真如性，以智慧观照，于一切法不取不舍，即是见性成佛道。善知识！若欲入甚深法界及般若三昧者，须修般若行，持诵《金刚般若经》，即得见性。当知此经功德无量无边，经中分明赞叹，莫能具说。此法门是最上乘，为大智人说，为上根人说。小根小智人闻，心生不信。何以故？譬如大龙下雨于阎浮提，城邑聚落，悉皆漂流如漂枣叶。若雨大海，不增不减。若大乘人，若最上乘人，闻说《金刚经》，心开悟解。故知本性自有般若之智，自用智慧，常观照故，不假文字。譬如雨水，不从天有，元是龙能兴致，令一切众生、一切草木、有情无情，悉皆蒙润。百川众流，却入大海，合为一体。众生本性般若之智，亦复如是。善知识！小根之人，闻此顿教，犹如草木根性小者，若被大雨，悉皆自倒，不能增长。小根之人，亦复如是。元有般若之智，与大智人更无差别，因何闻法不自开悟？缘邪见障重、烦恼根深。犹如大云覆盖于日，不得风吹，日光不现。般若之智亦无大小，为一切众生自心迷悟不同，迷心外见，修行觅佛；未悟自性，即是小根。若开悟顿教，不能外修，但于自心常起正见，烦恼尘劳常不能染，即是见性。善知识！内外不住，去来自由，能除执心，通达无碍。能修此行，与般若经本无差别。","「善知识！一切修多罗及诸文字，大小二乘，十二部经，皆因人置。因智慧性，方能建立。若无世人，一切万法本自不有，故知万法本自人兴。一切经书，因人说有。缘其人中有愚有智，愚为小人，智为大人。愚者问于智人，智者与愚人说法。愚人忽然悟解心开，即与智人无别。善知识！不悟即佛是众生，一念悟时众生是佛，故知万法尽在自心。何不从自心中，顿见真如本性？《菩萨戒经》云：『我本元自性清净，若识自心见性，皆成佛道。』《净名经》云：『即时豁然，还得本心。』善知识！我于忍和尚处，一闻言下便悟，顿见真如本性。是以将此教法流行，令学道者顿悟菩提。各自观心，自见本性。若自不悟，须觅大善知识、解最上乘法者，直示正路。是善知识有大因缘，所谓化导令得见性。一切善法，因善知识能发起故。三世诸佛、十二部经，在人性中本自具有。不能自悟，须求善知识指示方见；若自悟者，不假外求。若一向执谓须他善知识方得解脱者，无有是处。何以故？自心内有知识自悟。若起邪迷、妄念颠倒，外善知识虽有教授，救不可得。若起正真般若观照，一刹那间，妄念俱灭。若识自性，一悟即至佛地。善知识！智慧观照，内外明彻，识自本心。若识本心，即本解脱。若得解脱，即是般若三昧，即是无念。何名无念？若见一切法，心不染著，是为无念。用即遍一切处，亦不著一切处。但净本心，使六识出六门，于六尘中无染无杂，来去自由，通用无滞，即是般若三昧、自在解脱，名无念行。若百物不思，当令念绝，即是法缚，即名边见。善知识！悟无念法者，万法尽通；悟无念法者，见诸佛境界；悟无念法者，至佛地位。","「善知识！后代得吾法者，将此顿教法门，于同见同行，发愿受持。如事佛故，终身而不退者，定入圣位。然须传授从上以来默传分付，不得匿其正法。若不同见同行，在别法中，不得传付。损彼前人，究竟无益。恐愚人不解，谤此法门，百劫千生，断佛种性。善知识！吾有一无相颂，各须诵取，在家出家，但依此修。若不自修，惟记吾言，亦无有益。听吾颂曰：",`「说通及心通，　如日处虚空，
唯传见性法，　出世破邪宗。
法即无顿渐，　迷悟有迟疾，
只此见性门，　愚人不可悉。
说即虽万般，　合理还归一，
烦恼暗宅中，　常须生慧日。
邪来烦恼至，　正来烦恼除，
邪正俱不用，　清净至无余。
菩提本自性，　起心即是妄，
净心在妄中，　但正无三障。
世人若修道，　一切尽不妨，
常自见己过，　与道即相当。
色类自有道，　各不相妨恼，
离道别觅道，　终身不见道。
波波度一生，　到头还自懊，
欲得见真道，　行正即是道。
自若无道心，　暗行不见道，
若真修道人，　不见世间过。
若见他人非，　自非却是左，
他非我不非，　我非自有过。
但自却非心，　打除烦恼破，
憎爱不关心，　长伸两脚卧。
欲拟化他人，　自须有方便，
勿令彼有疑，　即是自性现。
佛法在世间，　不离世间觉，
离世觅菩提，　恰如求兔角。
正见名出世，　邪见是世间，
邪正尽打却，　菩提性宛然。
此颂是顿教，　亦名大法船，
迷闻经累劫，　悟则刹那间。」`,"师复曰：「今于大梵寺说此顿教，普愿法界众生，言下见性成佛。」","时韦使君与官僚道俗，闻师所说，无不省悟。一时作礼，皆叹：「善哉！何期岭南有佛出世！」","疑问第三","一日，韦刺史为师设大会斋。斋讫，刺史请师升座，同官僚士庶肃容再拜，问曰：「弟子闻和尚说法，实不可思议。今有少疑，愿大慈悲，特为解说。」","师曰：「有疑即问，吾当为说。」","韦公曰：「和尚所说，可不是达磨大师宗旨乎？」","师曰：「是。」","公曰：「弟子闻：达磨初化梁武帝，帝问云：『朕一生造寺度僧、布施设斋，有何功德？』达磨言：『实无功德。』弟子未达此理，愿和尚为说。」","师曰：「实无功德，勿疑先圣之言。武帝心邪，不知正法。造寺度僧、布施设斋，名为求福，不可将福便为功德。功德在法身中，不在修福。」师又曰：「见性是功，平等是德。念念无滞，常见本性，真实妙用，名为功德。内心谦下是功，外行于礼是德。自性建立万法是功，心体离念是德。不离自性是功，应用无染是德。若觅功德法身，但依此作，是真功德。若修功德之人，心即不轻，常行普敬。心常轻人，吾我不断，即自无功；自性虚妄不实，即自无德。为吾我自大，常轻一切故。善知识！念念无间是功，心行平直是德。自修性是功，自修身是德。善知识！功德须自性内见，不是布施供养之所求也。是以福德与功德别。武帝不识真理，非我祖师有过。」","刺史又问曰：「弟子常见僧俗念阿弥陀佛，愿生西方。请和尚说，得生彼否？愿为破疑。」","师言：「使君善听，惠能与说。世尊在舍卫城中，说西方引化。经文分明，去此不远。若论相说，里数有十万八千，即身中十恶八邪，便是说远。说远为其下根，说近为其上智。人有两种，法无两般。迷悟有殊，见有迟疾。迷人念佛求生于彼，悟人自净其心。所以佛言：『随其心净即佛土净。』使君东方人，但心净即无罪。虽西方人，心不净亦有愆。东方人造罪，念佛求生西方。西方人造罪，念佛求生何国？凡愚不了自性，不识身中净土，愿东愿西。悟人在处一般，所以佛言：『随所住处恒安乐。』使君心地但无不善，西方去此不遥。若怀不善之心，念佛往生难到。今劝善知识，先除十恶即行十万，后除八邪乃过八千。念念见性，常行平直，到如弹指，便覩弥陀。使君但行十善，何须更愿往生？不断十恶之心，何佛即来迎请？若悟无生顿法，见西方只在刹那。不悟念佛求生，路遥如何得达。惠能与诸人，移西方于刹那间，目前便见。各愿见否？」","众皆顶礼云：「若此处见，何须更愿往生？愿和尚慈悲，便现西方，普令得见。」","师言：「大众！世人自色身是城，眼耳鼻舌是门，外有五门，内有意门。心是地，性是王。王居心地上，性在王在，性去王无。性在身心存，性去身坏。佛向性中作，莫向身外求。自性迷即是众生，自性觉即是佛。慈悲即是观音，喜舍名为势至，能净即释迦，平直即弥陀；人我是须弥，贪欲是海水，烦恼是波浪，毒害是恶龙，虚妄是鬼神，尘劳是鱼鳖。贪瞋是地狱，愚痴是畜生。善知识！常行十善，天堂便至。除人我，须弥倒；去贪欲，海水竭；烦恼无，波浪灭；毒害除，鱼龙绝。自心地上觉性，如来放大光明；外照六门清净，能破六欲诸天；自性内照，三毒即除；地狱等罪一时销灭，内外明彻不异西方。不作此修，如何到彼？」","大众闻说，了然见性，悉皆礼拜，俱叹善哉。唱言：「普愿法界众生，闻者一时悟解。」","师言：「善知识！若欲修行，在家亦得，不由在寺。在家能行，如东方人心善；在寺不修，如西方人心恶。但心清净，即是自性西方。」","韦公又问：「在家如何修行？愿为教授。」","师言：「吾与大众说无相颂。但依此修，常与吾同处无别；若不依此修，剃发出家于道何益？颂曰：",`「心平何劳持戒，　行直何用修禅！
恩则孝养父母，　义则上下相怜，
让则尊卑和睦，　忍则众恶无諠，
若能钻木出火，　淤泥定生红莲。
苦口的是良药，　逆耳必是忠言，
改过必生智慧，　护短心内非贤。
日用常行饶益，　成道非由施钱，
菩提只向心觅，　何劳向外求玄。
听说依此修行，　西方只在目前。」`,"师复曰：「善知识！总须依偈修行，见取自性，直成佛道。时不相待，众人且散，吾归曹溪。众若有疑，却来相问。」","时，刺史官僚、在会善男信女，各得开悟，信受奉行。","定慧第四","师示众云：「善知识！我此法门，以定慧为本。大众！勿迷，言定慧别。定慧一体，不是二。定是慧体，慧是定用。即慧之时定在慧，即定之时慧在定。若识此义，即是定慧等学。诸学道人，莫言先定发慧、先慧发定各别。作此见者，法有二相。口说善语，心中不善。空有定慧，定慧不等。若心口俱善、内外一如，定慧即等。自悟修行，不在于诤。若诤先后，即同迷人，不断胜负，却增我法，不离四相。善知识！定慧犹如何等？犹如灯光。有灯即光，无灯即暗。灯是光之体，光是灯之用；名虽有二，体本同一。此定慧法，亦复如是。」","师示众云：「善知识！一行三昧者，于一切处行住坐卧，常行一直心是也。《净名》云：『直心是道场，直心是净土。』莫心行谄曲，口但说直；口说一行三昧，不行直心。但行直心，于一切法勿有执著。迷人著法相、执一行三昧，直言：『常坐不动，妄不起心，即是一行三昧。』作此解者，即同无情，却是障道因缘。善知识！道须通流，何以却滞？心不住法，道即通流；心若住法；名为自缚。若言常坐不动是，只如舍利弗宴坐林中，却被维摩诘诃。善知识！又有人教坐，看心观静，不动不起，从此置功。迷人不会，便执成颠。如此者众，如是相教，故知大错。」","师示众云：「善知识！本来正教，无有顿渐，人性自有利钝。迷人渐修，悟人顿契。自识本心，自见本性，即无差别，所以立顿渐之假名。善知识！我此法门，从上以来，先立无念为宗，无相为体，无住为本。无相者，于相而离相。无念者，于念而无念。无住者，人之本性。于世间善恶好丑，乃至冤之与亲，言语触刺欺争之时，并将为空，不思酬害，念念之中不思前境。若前念今念后念，念念相续不断，名为系缚。于诸法上念念不住，即无缚也。此是以无住为本。善知识！外离一切相，名为无相。能离于相，即法体清净。此是以无相为体。善知识！于诸境上，心不染，曰无念。于自念上，常离诸境，不于境上生心。若只百物不思，念尽除却，一念绝即死，别处受生，是为大错。学道者思之。若不识法意，自错犹可，更误他人；自迷不见，又谤佛经，所以立无念为宗。善知识！云何立无念为宗？只缘口说见性，迷人于境上有念，念上便起邪见，一切尘劳妄想从此而生。自性本无一法可得，若有所得，妄说祸福，即是尘劳邪见，故此法门立无念为宗。善知识！无者无何事？念者念何物？无者无二相，无诸尘劳之心。念者念真如本性。真如即是念之体，念即是真如之用。真如自性起念，非眼耳鼻舌能念。真如有性，所以起念；真如若无，眼耳色声当时即坏。善知识！真如自性起念，六根虽有见闻觉知，不染万境，而真性常自在。故经云：『能善分别诸法相，于第一义而不动。』」","坐禅第五","师示众云：「此门坐禅，元不著心，亦不著净，亦不是不动。若言著心，心元是妄，知心如幻，故无所著也。若言著净，人性本净，由妄念故，盖覆真如。但无妄想，性自清净；起心著净，却生净妄。妄无处所，著者是妄。净无形相，却立净相，言是工夫。作此见者，障自本性，却被净缚。善知识！若修不动者，但见一切人时，不见人之是非善恶过患，即是自性不动。善知识！迷人身虽不动！开口便说他人是非长短好恶，与道违背。若著心著净，即障道也。」","师示众云：「善知识！何名坐禅？此法门中，无障无碍，外于一切善恶境界，心念不起，名为坐；内见自性不动，名为禅。善知识！何名禅定？外离相为禅，内不乱为定。外若著相，内心即乱；外若离相，心即不乱。本性自净自定，只为见境，思境即乱。若见诸境心不乱者，是真定也。善知识！外离相即禅，内不乱即定。外禅内定，是为禅定。《菩萨戒经》云：『我本元自性清净。』善知识！于念念中，自见本性清净，自修自行，自成佛道。」","忏悔第六","时，大师见广韶洎四方士庶，骈集山中听法，于是升座，告众曰：「来，诸善知识！此事须从自事中起，于一切时，念念自净其心。自修自行，见自己法身，见自心佛，自度自戒，始得不假到此。既从远来，一会于此，皆共有缘。今可各各胡跪，先为传自性五分法身香，次授无相忏悔。」众胡跪。师曰：「一、戒香。即自心中无非无恶、无嫉妬、无贪瞋、无劫害，名戒香。二、定香。即覩诸善恶境相，自心不乱，名定香。三、慧香。自心无碍，常以智慧观照自性，不造诸恶；虽修众善，心不执著，敬上念下，矜恤孤贫，名慧香。四、解脱香。即自心无所攀缘，不思善、不思恶，自在无碍，名解脱香。五、解脱知见香。自心既无所攀缘善恶，不可沈空守寂，即须广学多闻，识自本心，达诸佛理，和光接物，无我无人，直至菩提，真性不易，名解脱知见香。善知识！此香各自内熏，莫向外觅。","「今与汝等授无相忏悔，灭三世罪，令得三业清净。善知识！各随我语，一时道：『弟子等，从前念今念及后念，念念不被愚迷染。从前所有恶业愚迷等罪，悉皆忏悔，愿一时销灭，永不复起。弟子等，从前念今念及后念，念念不被憍诳染。从前所有恶业憍诳等罪，悉皆忏悔，愿一时销灭，永不复起。弟子等，从前念今念及后念，念念不被嫉妬染。从前所有恶业嫉妬等罪，悉皆忏悔，愿一时销灭，永不复起。』善知识！已上是为无相忏悔。云何名忏？云何名悔？忏者，忏其前愆，从前所有恶业，愚迷憍诳嫉妬等罪，悉皆尽忏，永不复起，是名为忏。悔者，悔其后过，从今以后，所有恶业，愚迷憍诳嫉妬等罪，今已觉悟，悉皆永断，更不复作，是名为悔。故称忏悔。凡夫愚迷，只知忏其前愆，不知悔其后过。以不悔故，前愆不灭，后过又生。前愆既不灭，后过复又生，何名忏悔？","「善知识！既忏悔已，与善知识发四弘誓愿，各须用心正听。自心众生无边誓愿度，自心烦恼无边誓愿断，自性法门无尽誓愿学，自性无上佛道誓愿成。善知识！大家岂不道，众生无边誓愿度。恁么道，且不是惠能度。善知识！心中众生，所谓邪迷心、诳妄心、不善心、嫉妬心、恶毒心，如是等心，尽是众生。各须自性自度，是名真度。何名自性自度？即自心中邪见烦恼愚痴众生，将正见度。既有正见，使般若智打破愚痴迷妄众生，各各自度。邪来正度，迷来悟度，愚来智度，恶来善度；如是度者，名为真度。又烦恼无边誓愿断，将自性般若智，除却虚妄思想心是也。又法门无尽誓愿学，须自见性，常行正法，是名真学。又无上佛道誓愿成，既常能下心，行于真正，离迷离觉，常生般若。除真除妄，即见佛性，即言下佛道成。常念修行，是愿力法。","「善知识！今发四弘愿了，更与善知识授无相三归依戒。善知识！归依觉，两足尊。归依正，离欲尊。归依净，众中尊。从今日去，称觉为师，更不归依邪魔外道，以自性三宝常自证明，劝善知识归依自性三宝。佛者，觉也。法者，正也。僧者，净也。自心归依觉，邪迷不生，少欲知足，能离财色，名两足尊。自心归依正，念念无邪见，以无邪见故，即无人我贡高，贪爱执著，名离欲尊。自心归依净，一切尘劳爱欲境界，自性皆不染著，名众中尊。若修此行，是自归依。凡夫不会，从日至夜受三归戒。若言归依佛，佛在何处？若不见佛，凭何所归，言却成妄。善知识！各自观察，莫错用心。经文分明言自归依佛，不言归依他佛。自佛不归，无所依处。今既自悟，各须归依自心三宝，内调心性，外敬他人，是自归依也。","「善知识！既归依自三宝竟，各各志心，吾与说一体三身自性佛，令汝等见三身了然，自悟自性。总随我道：『于自色身，归依清净法身佛。于自色身，归依圆满报身佛。于自色身，归依千百亿化身佛。』善知识！色身是舍宅，不可言归。向者三身佛，在自性中，世人总有；为自心迷，不见内性。外觅三身如来，不见自身中有三身佛。汝等听说，令汝等于自身中，见自性有三身佛。此三身佛，从自性生，不从外得。何名清净法身佛？世人性本清净，万法从自性生。思量一切恶事，即生恶行；思量一切善事，即生善行。如是诸法在自性中，如天常清，日月常明，为浮云盖覆，上明下暗。忽遇风吹云散，上下俱明，万象皆现。世人性常浮游，如彼天云。善知识！智如日，慧如月，智慧常明。于外著境，被妄念浮云盖覆自性，不得明朗。若遇善知识，闻真正法，自除迷妄，内外明彻，于自性中万法皆现。见性之人，亦复如是。此名清净法身佛。善知识！自心归依自性，是归依真佛。自归依者，除却自性中不善心、嫉妬心、谄曲心、吾我心、诳妄心、轻人心、慢他心、邪见心、贡高心，及一切时中不善之行，常自见己过，不说他人好恶，是自归依。常须下心，普行恭敬，即是见性通达，更无滞碍，是自归依。何名圆满报身？譬如一灯能除千年暗，一智能灭万年愚。莫思向前，已过不可得；常思于后，念念圆明，自见本性。善恶虽殊，本性无二，无二之性，名为实性。于实性中，不染善恶，此名圆满报身佛。自性起一念恶，灭万劫善因；自性起一念善，得恒沙恶尽。直至无上菩提，念念自见，不失本念，名为报身。何名千百亿化身？若不思万法，性本如空，一念思量，名为变化。思量恶事，化为地狱；思量善事，化为天堂。毒害化为龙蛇，慈悲化为菩萨，智慧化为上界，愚痴化为下方。自性变化甚多，迷人不能省觉，念念起恶，常行恶道。回一念善，智慧即生，此名自性化身佛。善知识！法身本具，念念自性自见，即是报身佛。从报身思量，即是化身佛。自悟自修自性功德，是真归依。皮肉是色身，色身是舍宅，不言归依也。但悟自性三身，即识自性佛。吾有一无相颂，若能诵持，言下令汝积劫迷罪一时销灭。颂曰：",`「迷人修福不修道，　只言修福便是道，
布施供养福无边，　心中三恶元来造。
拟将修福欲灭罪，　后世得福罪还在，
但向心中除罪缘，　名自性中真忏悔。
忽悟大乘真忏悔，　除邪行正即无罪，
学道常于自性观，　即与诸佛同一类。
吾祖惟传此顿法，　普愿见性同一体，
若欲当来觅法身，　离诸法相心中洗。
努力自见莫悠悠，　后念忽绝一世休，
若悟大乘得见性，　虔恭合掌至心求。」`,"师言：「善知识！总须诵取，依此修行，言下见性。虽去吾千里，如常在吾边。于此言下不悟，即对面千里，何勤远来。珍重！好去。」","一众闻法，靡不开悟，欢喜奉行。","机缘第七","师自黄梅得法，回至韶州曹侯村，人无知者（他本云，师去时，至曹侯村，住九月余。然师自言：「不经三十余日便至黄梅。」此求道之切，岂有逗留？作去时者非是）。有儒士刘志略，礼遇甚厚。志略有姑为尼，名无尽藏，常诵《大涅槃经》。师暂听，即知妙义，遂为解说。尼乃执卷问字，师曰：「字即不识，义即请问。」尼曰：「字尚不识，焉能会义？」师曰：「诸佛妙理，非关文字。」尼惊异之，遍告里中耆德云：「此是有道之士，宜请供养。」有魏（魏一作晋）武侯玄孙曹叔良及居民，竞来瞻礼。时，宝林古寺，自隋末兵火已废，遂于故基重建梵宇，延师居之。俄成宝坊，师住九月余日，又为恶党寻逐，师乃遯于前山。被其纵火焚草木，师隐身挨入石中得免。石今有师趺坐膝痕，及衣布之纹，因名避难石。师忆五祖怀会止藏之嘱，遂行隐于二邑焉。","僧法海，韶州曲江人也。初参祖师，问曰：「即心即佛，愿垂指谕。」师曰：「前念不生即心，后念不灭即佛；成一切相即心，离一切相即佛。吾若具说，穷劫不尽。听吾偈曰：",`「即心名慧，　即佛乃定，　定慧等持，
意中清净。　悟此法门，　由汝习性，
用本无生，　双修是正。」`,"法海言下大悟，以偈赞曰：",`「即心元是佛，　不悟而自屈，
我知定慧因，　双修离诸物。」`,"僧法达，洪州人，七岁出家，常诵《法华经》。来礼祖师，头不至地。师诃曰：「礼不投地，何如不礼？汝心中必有一物。蕴习何事耶？」曰：「念《法华经》已及三千部。」师曰：「汝若念至万部，得其经意，不以为胜，则与吾偕行。汝今负此事业，都不知过。听吾偈曰：",`「礼本折慢幢，　头奚不至地？
有我罪即生，　亡功福无比。」`,"师又曰：「汝名什么？」曰：「法达。」师曰：「汝名法达，何曾达法？」复说偈曰：",`「汝今名法达，　勤诵未休歇，
空诵但循声，　明心号菩萨。
汝今有缘故，　吾今为汝说，
但信佛无言，　莲华从口发。」`,"达闻偈，悔谢曰：「而今而后，当谦恭一切。弟子诵《法华经》，未解经义，心常有疑。和尚智慧广大，愿略说经中义理。」师曰：「法达！法即甚达，汝心不达。经本无疑，汝心自疑。汝念此经，以何为宗？」达曰：「学人根性暗钝，从来但依文诵念，岂知宗趣？」师曰：「吾不识文字，汝试取经诵一遍，吾当为汝解说。」法达即高声念经，至譬喻品，师曰：「止！此经元来以因缘出世为宗，纵说多种譬喻，亦无越于此。何者因缘？经云：『诸佛世尊，唯以一大事因缘出现于世。』一大事者，佛之知见也。世人外迷著相，内迷著空；若能于相离相、于空离空，即是内外不迷。若悟此法，一念心开，是为开佛知见。佛，犹觉也。分为四门，开觉知见、示觉知见、悟觉知见、入觉知见。若闻开示，便能悟入，即觉知见，本来真性而得出现。汝慎勿错解经意，见他道：『开示悟入，自是佛之知见。我辈无分。』若作此解，乃是谤经毁佛也。彼既是佛，已具知见，何用更开？汝今当信，佛知见者，只汝自心，更无别佛。盖为一切众生，自蔽光明，贪爱尘境，外缘内扰，甘受驱驰。便劳他世尊，从三昧起，种种苦口，劝令寝息，莫向外求，与佛无二。故云：『开佛知见。』吾亦劝一切人，于自心中，常开佛之知见。世人心邪，愚迷造罪，口善心恶，贪瞋嫉妬，谄佞我慢，侵人害物，自开众生知见。若能正心，常生智慧，观照自心，止恶行善，是自开佛之知见。汝须念念开佛知见，勿开众生知见。开佛知见，即是出世；开众生知见，即是世间。汝若但劳劳执念，以为功课者，何异牦牛爱尾。」达曰：「若然者，但得解义，不劳诵经耶？」师曰：「经有何过，岂障汝念？只为迷悟在人，损益由己。口诵心行，即是转经；口诵心不行，即是被经转。听吾偈曰：",`「心迷法华转，　心悟转法华，
诵经久不明，　与义作雠家。
无念念即正，　有念念成邪，
有无俱不计，　长御白牛车。」`,"达闻偈，不觉悲泣，言下大悟，而告师曰：「法达从昔已来，实未曾转法华，乃被法华转。」再启曰：「经云：『诸大声闻乃至菩萨，皆尽思共度量，不能测佛智。』今令凡夫但悟自心，便名佛之知见。自非上根，未免疑谤。又经说三车，羊鹿牛车与白牛之车，如何区别？愿和尚再垂开示。」师曰：「经意分明，汝自迷背。诸三乘人，不能测佛智者，患在度量也。饶伊尽思共推，转加悬远。佛本为凡夫说，不为佛说。此理若不肯信者，从他退席。殊不知，坐却白牛车，更于门外觅三车。况经文明向汝道：『唯一佛乘，无有余乘若二若三。』乃至无数方便，种种因缘譬喻言词，是法皆为一佛乘故。汝何不省，三车是假，为昔时故；一乘是实，为今时故。只教汝去假归实，归实之后，实亦无名。应知所有珍财，尽属于汝，由汝受用，更不作父想，亦不作子想，亦无用想。是名持法华经，从劫至劫，手不释卷，从昼至夜，无不念时也。」","达蒙启发，踊跃欢喜，以偈赞曰：",`「经诵三千部，　曹溪一句亡，
未明出世旨，　宁歇累生狂。
羊鹿牛权设，　初中后善扬，
谁知火宅内，　元是法中王。」`,"师曰：「汝今后方可名念经僧也。」达从此领玄旨，亦不辍诵经。","僧智通，寿州安丰人。初看《楞伽经》。约千余遍，而不会三身四智。礼师求解其义，师曰：「三身者，清净法身，汝之性也；圆满报身，汝之智也；千百亿化身，汝之行也。若离本性，别说三身，即名有身无智；若悟三身无有自性，即明四智菩提。听吾偈曰：",`「自性具三身，　发明成四智，
不离见闻缘，　超然登佛地。
吾今为汝说，　谛信永无迷，
莫学驰求者，　终日说菩提。」`,"通再启曰：「四智之义，可得闻乎？」师曰：「既会三身，便明四智。何更问耶？若离三身，别谈四智，此名有智无身。即此有智，还成无智。」复说偈曰：",`「大圆镜智性清净，　平等性智心无病，
妙观察智见非功，　成所作智同圆镜。
五八六七果因转，　但用名言无实性，
若于转处不留情，　繁兴永处那伽定。」`,"（如上转识为智也。教中云，转前五识为成所作智，转第六识为妙观察智，转第七识为平等性智，转第八识为大圆镜智。虽六七因中转，五八果上转，但转其名而不转其体也）。","通顿悟性智，遂呈偈曰：",`「三身元我体，　四智本心明，
身智融无碍，　应物任随形。
起修皆妄动，　守住匪真精，
妙旨因师晓，　终亡染污名。」`,"僧智常，信州贵溪人，髫年出家，志求见性。一日参礼，师问曰：「汝从何来？欲求何事？」曰：「学人近往洪州白峰山礼大通和尚，蒙示见性成佛之义。未决狐疑，远来投礼，伏望和尚慈悲指示。」师曰：「彼有何言句？汝试举看。」曰：「智常到彼，凡经三月，未蒙示诲。为法切故，一夕独入丈室，请问：『如何是某甲本心本性？』大通乃曰：『汝见虚空否？』对曰：『见。』彼曰：『汝见虚空有相貌否？』对曰：『虚空无形，有何相貌？』彼曰：『汝之本性，犹如虚空，了无一物可见，是名正见；无一物可知，是名真知。无有青黄长短，但见本源清净，觉体圆明，即名见性成佛，亦名如来知见。』学人虽闻此说，犹未决了，乞和尚开示。」师曰：「彼师所说，犹存见知，故令汝未了。吾今示汝一偈：",`「不见一法存无见，　大似浮云遮日面，
不知一法守空知，　还如太虚生闪电。
此之知见瞥然兴，　错认何曾解方便，
汝当一念自知非，　自己灵光常显现。」`,"常闻偈已，心意豁然。乃述偈曰：",`「无端起知见，　著相求菩提，
情存一念悟，　宁越昔时迷。
自性觉源体，　随照枉迁流，
不入祖师室，　茫然趣两头。」`,"智常一日问师曰：「佛说三乘法，又言最上乘。弟子未解，愿为教授。」师曰：「汝观自本心，莫著外法相。法无四乘，人心自有等差。见闻转诵是小乘；悟法解义是中乘；依法修行是大乘；万法尽通，万法俱备，一切不染，离诸法相，一无所得，名最上乘。乘是行义，不在口争。汝须自修，莫问吾也。一切时中，自性自如。」常礼谢执侍，终师之世。","僧志道，广州南海人也。请益曰：「学人自出家，览《涅槃经》十载有余，未明大意，愿和尚垂诲。」师曰：「汝何处未明？」曰：「诸行无常，是生灭法；生灭灭已，寂灭为乐。于此疑惑。」师曰：「汝作么生疑？」曰：「一切众生皆有二身，谓色身、法身也。色身无常，有生有灭；法身有常，无知无觉。经云：『生灭灭已，寂灭为乐』者，不审何身寂灭？何身受乐？若色身者，色身灭时，四大分散，全然是苦，苦不可言乐。若法身寂灭，即同草木瓦石，谁当受乐？又法性是生灭之体，五蕴是生灭之用，一体五用，生灭是常。生则从体起用，灭则摄用归体。若听更生，即有情之类，不断不灭；若不听更生，则永归寂灭，同于无情之物。如是，则一切诸法被涅槃之所禁伏，尚不得生，何乐之有？」师曰：「汝是释子，何习外道断常邪见，而议最上乘法？据汝所说，即色身外别有法身，离生灭求于寂灭。又推涅槃常乐，言有身受用。斯乃执悋生死，耽著世乐。汝今当知，佛为一切迷人，认五蕴和合为自体相，分别一切法为外尘相，好生恶死，念念迁流，不知梦幻虚假，枉受轮回。以常乐涅槃翻为苦相，终日驰求。佛愍此故，乃示涅槃真乐。刹那无有生相，刹那无有灭相，更无生灭可灭，是则寂灭现前。当现前时，亦无现前之量，乃谓常乐。此乐无有受者，亦无不受者，岂有一体五用之名？何况更言涅槃禁伏诸法，令永不生。斯乃谤佛毁法。听吾偈曰：",`「无上大涅槃，　圆明常寂照，
凡愚谓之死，　外道执为断，
诸求二乘人，　目以为无作，
尽属情所计，　六十二见本。
妄立虚假名，　何为真实义，
惟有过量人，　通达无取舍。
以知五蕴法，　及以蕴中我，
外现众色象，　一一音声相，
平等如梦幻，　不起凡圣见，
不作涅槃解，　二边三际断。
常应诸根用，　而不起用想，
分别一切法，　不起分别想。
劫火烧海底，　风鼓山相击，
真常寂灭乐，　涅槃相如是。
吾今彊言说，　令汝舍邪见，
汝勿随言解，　许汝知少分。」`,"志道闻偈大悟，踊跃作礼而退。","行思禅师，生吉州安城刘氏。闻曹溪法席盛化，径来参礼，遂问曰：「当何所务，即不落阶级？」师曰：「汝曾作什么来？」曰：「圣谛亦不为。」师曰：「落何阶级？」曰：「圣谛尚不为，何阶级之有？」师深器之，令思首众。一日，师谓曰：「汝当分化一方，无令断绝。」思既得法，遂回吉州青原山，弘法绍化（谥弘济禅师）。","怀让禅师，金州杜氏子也。初谒嵩山安国师，安发之曹溪参扣。让至礼拜，师曰：「甚处来？」曰：「嵩山。」师曰：「什么物？恁么来？」曰：「说似一物即不中。」师曰：「还可修证否？」曰：「修证即不无，污染即不得。」师曰：「只此不污染，诸佛之所护念。汝既如是，吾亦如是。西天般若多罗谶，汝足下出一马驹，踏杀天下人。应在汝心，不须速说（一本无西天以下二十七字）。」让豁然契会，遂执侍左右一十五载，日臻玄奥。后往南岳，大阐禅宗（勅谥大慧禅师）。","永嘉玄觉禅师，温州戴氏子。少习经论，精天台止观法门。因看《维摩经》发明心地。偶师弟子玄策相访，与其剧谈，出言暗合诸祖。策云：「仁者得法师谁？」曰：「我听方等经论，各有师承。后于《维摩经》悟佛心宗，未有证明者。」策云：「威音王已前即得，威音王已后，无师自悟，尽是天然外道。」曰：「愿仁者为我证据。」策云：「我言轻。曹溪有六祖大师，四方云集，并是受法者。若去，则与偕行。」觉遂同策来参，绕师三匝，振锡而立。师曰：「夫沙门者，具三千威仪、八万细行。大德自何方而来，生大我慢？」觉曰：「生死事大，无常迅速。」师曰：「何不体取无生，了无速乎？」曰：「体即无生，了本无速。」师曰：「如是，如是！」玄觉方具威仪礼拜，须臾告辞。师曰：「返太速乎？」曰：「本自非动，岂有速耶？」师曰：「谁知非动？」曰：「仁者自生分别。」师曰：「汝甚得无生之意。」曰：「无生岂有意耶？」师曰：「无意，谁当分别？」曰：「分别亦非意。」师曰：「善哉！少留一宿。」时谓一宿觉。后著《证道歌》，盛行于世（谥曰无相大师，时称为真觉焉）。","禅者智隍，初参五祖，自谓已得正受。庵居长坐，积二十年。师弟子玄策，游方至河朔，闻隍之名，造庵问云：「汝在此作什么？」隍曰：「入定。」策云：「汝云入定，为有心入耶？无心入耶？若无心入者，一切无情草木瓦石，应合得定；若有心入者，一切有情含识之流，亦应得定。」隍曰：「我正入定时，不见有有无之心。」策云：「不见有有无之心，即是常定。何有出入？若有出入，即非大定。」隍无对，良久，问曰：「师嗣谁耶？」策云：「我师曹溪六祖。」隍云：「六祖以何为禅定？」策云：「我师所说，妙湛圆寂，体用如如。五阴本空，六尘非有，不出不入，不定不乱。禅性无住，离住禅寂；禅性无生，离生禅想。心如虚空，亦无虚空之量。」隍闻是说，径来谒师。师问云：「仁者何来？」隍具述前缘。师云：「诚如所言。汝但心如虚空，不著空见，应用无碍，动静无心，凡圣情忘，能所俱泯，性相如如，无不定时也（一本无汝但以下三十五字。止云：师悯其远来，遂垂开决）。」隍于是大悟，二十年所得心，都无影响。其夜河北士庶，闻空中有声云：「隍禅师今日得道。」隍后礼辞，复归河北，开化四众。一僧问师云：「黄梅意旨，甚么人得？」师云：「会佛法人得。」僧云：「和尚还得否？」师云：「我不会佛法。」","师一日欲濯所授之衣而无美泉，因至寺后五里许，见山林欝茂，瑞气盘旋。师振锡卓地，泉应手而出，积以为池，乃跪膝浣衣石上。忽有一僧来礼拜，云：「方辩是西蜀人，昨于南天竺国，见达磨大师，嘱方辩速往唐土。吾传大迦叶正法眼藏及僧伽梨，见传六代，于韶州曹溪，汝去瞻礼。方辩远来，愿见我师传来衣钵。」师乃出示，次问：「上人攻何事业？」曰：「善塑。」师正色曰：「汝试塑看。」辩罔措。过数日，塑就真相，可高七寸，曲尽其妙。师笑曰：「汝只解塑性，不解佛性。」师舒手摩方辩顶，曰：「永为人天福田。」","（师仍以衣酬之。辩取衣分为三，一披塑像，一自留，一用椶裹瘗地中。誓曰：「后得此衣，乃吾出世，住持于此，重建殿宇。」宋嘉祐八年，有僧惟先，修殿掘地，得衣如新。像在高泉寺，祈祷辄应）。","有僧举卧轮禅师偈曰：",`「卧轮有伎俩，　能断百思想，
对境心不起，　菩提日日长。」`,"师闻之，曰：「此偈未明心地，若依而行之，是加系缚。」因示一偈曰：",`「惠能没伎俩，　不断百思想，
对境心数起，　菩提作么长。」`,"顿渐第八","时，祖师居曹溪宝林，神秀大师在荆南玉泉寺。于时两宗盛化，人皆称南能北秀，故有南北二宗顿渐之分，而学者莫知宗趣。师谓众曰：「法本一宗，人有南北。法即一种，见有迟疾。何名顿渐？法无顿渐，人有利钝，故名顿渐。」然秀之徒众，往往讥南宗祖师，不识一字，有何所长。秀曰：「他得无师之智，深悟上乘。吾不如也。且吾师五祖，亲传衣法。岂徒然哉！吾恨不能远去亲近，虚受国恩。汝等诸人，毋滞于此，可往曹溪参决。」一日，命门人志诚曰：「汝聪明多智，可为吾到曹溪听法。若有所闻，尽心记取，还为吾说。」志诚禀命至曹溪，随众参请，不言来处。时祖师告众曰：「今有盗法之人，潜在此会。」志诚即出礼拜，具陈其事。师曰：「汝从玉泉来，应是细作。」对曰：「不是。」师曰：「何得不是？」对曰：「未说即是，说了不是。」师曰：「汝师若为示众？」对曰：「常指诲大众，住心观静，长坐不卧。」师曰：「住心观静，是病非禅；长坐拘身，于理何益？听吾偈曰：",`「生来坐不卧，　死去卧不坐，
一具臭骨头，　何为立功课？」`,"志诚再拜曰：「弟子在秀大师处学道九年，不得契悟。今闻和尚一说，便契本心。弟子生死事大，和尚大慈，更为教示。」师云：「吾闻汝师教示学人戒定慧法，未审汝师说戒定慧行相如何？与吾说看。」诚曰：「秀大师说，诸恶莫作名为戒，诸善奉行名为慧，自净其意名为定。彼说如此，未审和尚以何法诲人？」师曰：「吾若言有法与人，即为诳汝。但且随方解缚，假名三昧。如汝师所说戒定慧，实不可思议。吾所见戒定慧又别。」志诚曰：「戒定慧只合一种，如何更别？」师曰：「汝师戒定慧接大乘人，吾戒定慧接最上乘人。悟解不同，见有迟疾。汝听吾说，与彼同否？吾所说法，不离自性。离体说法，名为相说，自性常迷。须知一切万法，皆从自性起用，是真戒定慧法。听吾偈曰：",`「心地无非自性戒，　心地无痴自性慧，
心地无乱自性定，　不增不减自金刚，
身去身来本三昧。」`,"诚闻偈，悔谢，乃呈一偈曰：",`「五蕴幻身，　幻何究竟？　回趣真如，
法还不净。」`,"师然之，复语诚曰：「汝师戒定慧，劝小根智人；吾戒定慧，劝大根智人。若悟自性，亦不立菩提涅槃，亦不立解脱知见。无一法可得，方能建立万法。若解此意，亦名佛身，亦名菩提涅槃，亦名解脱知见。见性之人，立亦得、不立亦得，去来自由，无滞无碍，应用随作，应语随答，普见化身，不离自性，即得自在神通游戏三昧，是名见性。」志诚再启师曰：「如何是不立义？」师曰：「自性无非、无痴无乱，念念般若观照，常离法相，自由自在，纵横尽得，有何可立？自性自悟，顿悟顿修，亦无渐次，所以不立一切法。诸法寂灭，有何次第？」志诚礼拜，愿为执侍，朝夕不懈（诚吉州太和人也）。","僧志彻，江西人，本姓张，名行昌，少任侠。自南北分化，二宗主虽亡彼我，而徒侣竞起爱憎。时北宗门人，自立秀师为第六祖，而忌祖师传衣为天下闻，乃嘱行昌来刺师。师心通，预知其事，即置金十两于座间。时夜暮，行昌入祖室，将欲加害。师舒颈就之，行昌挥刃者三，悉无所损。师曰：「正剑不邪，邪剑不正。只负汝金，不负汝命。」行昌惊仆，久而方苏，求哀悔过，即愿出家。师遂与金，言：「汝且去，恐徒众翻害于汝。汝可他日易形而来，吾当摄受。」行昌禀旨宵遁。后投僧出家，具戒精进。一日，忆师之言，远来礼觐。师曰：「吾久念汝，汝来何晚？」曰：「昨蒙和尚舍罪，今虽出家苦行，终难报德，其惟传法度生乎？弟子常览《涅槃经》，未晓常无常义。乞和尚慈悲，略为解说。」师曰：「无常者，即佛性也。有常者，即一切善恶诸法分别心也。」曰：「和尚所说，大违经文。」师曰：「吾传佛心印，安敢违于佛经？」曰：「经说佛性是常；和尚却言无常。善恶之法乃至菩提心，皆是无常；和尚却言是常。此即相违，令学人转加疑惑。」师曰：「《涅槃经》吾昔听尼无尽藏读诵一遍，便为讲说，无一字一义不合经文。乃至为汝，终无二说。」曰：「学人识量浅昧，愿和尚委曲开示。」师曰：「汝知否？佛性若常，更说什么善恶诸法，乃至穷劫无有一人发菩提心者；故吾说无常，正是佛说真常之道也。又，一切诸法若无常者，即物物皆有自性，容受生死，而真常性有不遍之处。故吾说常者，正是佛说真无常义。佛比为凡夫、外道执于邪常，诸二乘人于常计无常，共成八倒，故于《涅槃》了义教中，破彼偏见，而显说真常、真乐、真我、真净。汝今依言背义，以断灭无常及确定死常，而错解佛之圆妙最后微言。纵览千遍，有何所益？」行昌忽然大悟，说偈曰：",`「因守无常心，　佛说有常性，
不知方便者，　犹春池拾砾。
我今不施功，　佛性而现前，
非师相授与，　我亦无所得。」`,"师曰：「汝今彻也，宜名志彻。」彻礼谢而退。","有一童子，名神会，襄阳高氏子。年十三，自玉泉来参礼。师曰：「知识远来艰辛，还将得本来否？若有本则合识主。试说看。」会曰：「以无住为本，见即是主。」师曰：「这沙弥争合取次语？」会乃问曰：「和尚坐禅，还见不见？」师以柱杖打三下，云：「吾打汝痛不痛？」对曰：「亦痛亦不痛。」师曰：「吾亦见亦不见。」神会问：「如何是亦见亦不见？」师云：「吾之所见，常见自心过愆，不见他人是非好恶，是以亦见亦不见。汝言：『亦痛亦不痛。』如何？汝若不痛，同其木石；若痛，则同凡夫，即起恚恨。汝向前见、不见是二边，痛、不痛是生灭。汝自性且不见，敢尔弄人！」神会礼拜悔谢。师又曰：「汝若心迷不见，问善知识觅路。汝若心悟，即自见性依法修行。汝自迷不见自心，却来问吾见与不见。吾见自知，岂代汝迷？汝若自见，亦不代吾迷。何不自知自见，乃问吾见与不见？」神会再礼百余拜，求谢过愆。服勤给侍，不离左右。","一日，师告众曰：「吾有一物，无头无尾，无名无字，无背无面。诸人还识否？」神会出曰：「是诸佛之本源，神会之佛性。」师曰：「向汝道：『无名无字』，汝便唤作本源佛性。汝向去有把茆盖头，也只成个知解宗徒。」祖师灭后，会入京洛，大弘曹溪顿教，著《显宗记》，盛行于世（是为荷泽禅师）。","师见诸宗难问咸起恶心，多集座下愍而谓曰：「学道之人，一切善念恶念应当尽除。无名可名，名于自性，无二之性，是名实性。于实性上建立一切教门，言下便须自见。」诸人闻说，总皆作礼，请事为师。","宣诏第九","神龙元年上元日，则天、中宗诏云：「朕请安、秀二师宫中供养。万机之暇，每究一乘。二师推让云：『南方有能禅师，密授忍大师衣法，传佛心印，可请彼问。』今遣内侍薛简，驰诏迎请，愿师慈念，速赴上京。」师上表辞疾，愿终林麓。薛简曰：「京城禅德皆云：『欲得会道，必须坐禅习定。若不因禅定而得解脱者，未之有也。』未审师所说法如何？」师曰：「道由心悟，岂在坐也。经云：『若言如来若坐若卧，是行邪道。』何故？无所从来，亦无所去。无生无灭，是如来清净禅。诸法空寂，是如来清净坐。究竟无证，岂况坐耶。」简曰：「弟子回京，主上必问。愿师慈悲，指示心要，传奏两宫及京城学道者。譬如一灯，然百千灯，冥者皆明，明明无尽。」师云：「道无明暗，明暗是代谢之义。明明无尽，亦是有尽，相待立名故。《净名经》云：『法无有比，无相待故。』」简曰：「明喻智慧，暗喻烦恼。修道之人，倘不以智慧照破烦恼，无始生死凭何出离？」师曰：「烦恼即是菩提，无二无别。若以智慧照破烦恼者，此是二乘见解。羊鹿等机，上智大根，悉不如是。」简曰：「如何是大乘见解？」师曰：「明与无明，凡夫见二；智者了达，其性无二。无二之性，即是实性。实性者，处凡愚而不减，在贤圣而不增，住烦恼而不乱，居禅定而不寂。不断不常，不来不去，不在中间及其内外，不生不灭，性相如如，常住不迁，名之曰道。」简曰：「师说不生不灭，何异外道？」师曰：「外道所说不生不灭者，将灭止生，以生显灭，灭犹不灭，生说不生。我说不生不灭者，本自无生，今亦不灭，所以不同外道。汝若欲知心要，但一切善恶都莫思量，自然得入清净心体，湛然常寂，妙用恒沙。」简蒙指教，豁然大悟。礼辞归阙，表奏师语。","其年九月三日，有诏奖谕师曰：「师辞老疾，为朕修道，国之福田。师若净名托疾毘耶，阐扬大乘，传诸佛心，谈不二法。薛简传师指授如来知见，朕积善余庆，宿种善根，值师出世，顿悟上乘。感荷师恩，顶戴无已，并奉磨衲袈裟及水晶钵，勅韶州刺史修饰寺宇，赐师旧居为国恩寺。」","付嘱第十","师一日唤门人法海、志诚、法达、神会、智常、智通、志彻、志道、法珍、法如等，曰：「汝等不同余人，吾灭度后，各为一方师。吾今教汝说法，不失本宗：先须举三科法门，动用三十六对，出没即离两边。说一切法，莫离自性。忽有人问汝法，出语尽双，皆取对法，来去相因。究竟二法尽除，更无去处。三科法门者，阴、界、入也。阴是五阴——色、受、想、行、识是也。入是十二入，外六尘——色、声、香、味、触、法；内六门——眼、耳、鼻、舌、身、意是也。界是十八界，六尘、六门、六识是也。自性能含万法，名含藏识。若起思量，即是转识。生六识，出六门，见六尘。如是一十八界，皆从自性起用。自性若邪，起十八邪；自性若正，起十八正。若恶用即众生用，善用即佛用。用由何等？由自性有，对法外境。无情五对：天与地对，日与月对，明与暗对，阴与阳对，水与火对；此是五对也。法相语言十二对：语与法对，有与无对，有色与无色对，有相与无相对，有漏与无漏对，色与空对，动与静对，清与浊对，凡与圣对，僧与俗对，老与少对，大与小对；此是十二对也。自性起用十九对：长与短对，邪与正对，痴与慧对，愚与智对，乱与定对，慈与毒对，戒与非对，直与曲对，实与虚对，险与平对，烦恼与菩提对，常与无常对，悲与害对，喜与瞋对，舍与悭对，进与退对，生与灭对，法身与色身对，化身与报身对；此是十九对也。」师言：「此三十六对法，若解用即道，贯一切经法，出入即离两边。自性动用，共人言语，外于相离相，内于空离空。若全著相，即长邪见；若全执空，即长无明。执空之人有谤经，直言不用文字。既云不用文字，人亦不合语言。只此语言，便是文字之相。又云：『直道不立文字。』即此不立两字，亦是文字。见人所说，便即谤他言著文字。汝等须知，自迷犹可，又谤佛经。不要谤经，罪障无数。若著相于外，而作法求真；或广立道场，说有无之过患。如是之人，累劫不得见性。但听依法修行，又莫百物不思，而于道性窒碍。若听说不修，令人反生邪念。但依法修行，无住相法施。汝等若悟，依此说、依此用、依此行、依此作，即不失本宗。若有人问汝义，问有将无对，问无将有对，问凡以圣对，问圣以凡对。二道相因，生中道义。如一问一对，余问一依此作，即不失理也。设有人问：『何名为暗？』答云：『明是因，暗是缘，明没即暗。』以明显暗，以暗显明，来去相因，成中道义。余问悉皆如此。汝等于后传法，依此转相教授，勿失宗旨。」","师于太极元年壬子，延和七月（是年五月改延和，八月玄宗即位方改元先天，次年遂改开元。他本作先天者非）命门人往新州国恩寺建塔，仍令促工，次年夏末落成。七月一日，集徒众曰：「吾至八月，欲离世间。汝等有疑，早须相问，为汝破疑，令汝迷尽。吾若去后，无人教汝。」法海等闻，悉皆涕泣。惟有神会，神情不动，亦无涕泣。师云：「神会小师却得善不善等，毁誉不动，哀乐不生；余者不得。数年山中竟修何道？汝今悲泣，为忧阿谁？若忧吾不知去处，吾自知去处。吾若不知去处，终不预报于汝。汝等悲泣，盖为不知吾去处；若知吾去处，即不合悲泣。法性本无生灭去来，汝等尽坐，吾与汝说一偈，名曰真假动静偈。汝等诵取此偈，与吾意同，依此修行，不失宗旨。」众僧作礼，请师说偈。偈曰：",`「一切无有真，　不以见于真，
若见于真者，　是见尽非真。
若能自有真，　离假即心真，
自心不离假，　无真何处真？
有情即解动，　无情即不动，
若修不动行，　同无情不动。
若觅真不动，　动上有不动，
不动是不动，　无情无佛种。
能善分别相，　第一义不动，
但作如此见，　即是真如用。
报诸学道人，　努力须用意，
莫于大乘门，　却执生死智。
若言下相应，　即共论佛义；
若实不相应，　合掌令欢喜。
此宗本无诤，　诤即失道意，
执逆诤法门，　自性入生死。」`,"时，徒众闻说偈已，普皆作礼，并体师意，各各摄心，依法修行，更不敢诤，乃知大师不久住世。法海上座，再拜问曰：「和尚入灭之后，衣法当付何人？」师曰：「吾于大梵寺说法，以至于今抄录流行，目曰『法宝坛经』。汝等守护，递相传授。度诸群生，但依此说，是名正法。今为汝等说法，不付其衣。盖为汝等信根淳熟，决定无疑，堪任大事。然据先祖达磨大师付授偈意，衣不合传。偈曰：",`「『吾本来兹土，　传法救迷情，
一华开五叶，　结果自然成。』」`,"师复曰：「诸善知识！汝等各各净心，听吾说法。若欲成就种智，须达一相三昧、一行三昧。若于一切处而不住相，于彼相中不生憎爱，亦无取舍，不念利益成坏等事，安闲恬静，虚融澹泊，此名一相三昧。若于一切处行住坐卧，纯一直心，不动道场，真成净土，此名一行三昧。若人具二三昧，如地有种，含藏长养，成熟其实。一相一行，亦复如是。我今说法，犹如时雨，普润大地。汝等佛性，譬诸种子，遇兹沾洽，悉得发生。承吾旨者，决获菩提。依吾行者，定证妙果。听吾偈曰：",`「心地含诸种，　普雨悉皆萌，
顿悟华情已，　菩提果自成。」`,"师说偈已，曰：「其法无二，其心亦然。其道清净，亦无诸相，汝等慎勿观静及空其心。此心本净，无可取舍。各自努力，随缘好去。」尔时徒众作礼而退。","大师，七月八日忽谓门人曰：「吾欲归新州，汝等速理舟楫。」大众哀留甚坚。师曰：「诸佛出现，犹示涅槃。有来必去，理亦常然。吾此形骸，归必有所。」众曰：「师从此去，早晚可回。」师曰：「叶落归根，来时无口。」又问曰：「正法眼藏，传付何人？」师曰：「有道者得，无心者通。」又问：「后莫有难否？」师曰：「吾灭后五六年，当有一人来取吾首。听吾记曰：『头上养亲，口里须餐，遇满之难，杨柳为官。』」又云：「吾去七十年，有二菩萨从东方来，一出家、一在家。同时兴化，建立吾宗，缔缉伽蓝，昌隆法嗣。」问曰：「未知从上佛祖应现已来，传授几代？愿垂开示。」师云：「古佛应世已无数量，不可计也。今以七佛为始，过去庄严劫，毘婆尸佛、尸弃佛、毘舍浮佛；今贤劫，拘留孙佛、拘那含牟尼佛、迦叶佛、释迦文佛。是为七佛。","　　「已上七佛，今以释迦文佛首传。","「第一摩诃迦叶尊者、第二阿难尊者、第三商那和修尊者、第四优波毱多尊者、第五提多迦尊者、第六弥遮迦尊者、第七婆须蜜多尊者、第八佛驮难提尊者、第九伏驮蜜多尊者、第十脇尊者、十一富那夜奢尊者、十二马鸣大士、十三迦毘摩罗尊者、十四龙树大士、十五迦那提婆尊者、十六罗睺罗多尊者、十七僧伽难提尊者、十八伽耶舍多尊者、十九鸠摩罗多尊者、二十阇耶多尊者、二十一婆修盘头尊者、二十二摩拏罗尊者、二十三鹤勒那尊者、二十四师子尊者、二十五婆舍斯多尊者、二十六不如蜜多尊者、二十七般若多罗尊者、二十八菩提达磨尊者（此土是为初祖）、二十九慧可大师、三十僧璨大师、三十一道信大师、三十二弘忍大师。","「惠能是为三十三祖。从上诸祖，各有禀承。汝等向后，递代流传毋令乖误。」","大师，先天二年癸丑岁八月初三日（是年十二月改元开元），于国恩寺斋罢，谓诸徒众曰：「汝等各依位坐，吾与汝别。」法海白言：「和尚！留何教法，令后代迷人得见佛性？」师言：「汝等谛听！后代迷人，若识众生，即是佛性；若不识众生，万劫觅佛难逢。吾今教汝。识自心众生，见自心佛性。欲求见佛，但识众生。只为众生迷佛，非是佛迷众生。自性若悟，众生是佛；自性若迷，佛是众生。自性平等，众生是佛；自性邪险，佛是众生。汝等心若险曲，即佛在众生中；一念平直。即是众生成佛。我心自有佛，自佛是真佛。自若无佛心，何处求真佛？汝等自心是佛，更莫狐疑。外无一物而能建立，皆是本心生万种法。故经云：『心生种种法生，心灭种种法灭。』吾今留一偈与汝等别，名自性真佛偈。后代之人，识此偈意，自见本心，自成佛道。偈曰：",`「真如自性是真佛，　邪见三毒是魔王，
邪迷之时魔在舍，　正见之时佛在堂。
性中邪见三毒生，　即是魔王来住舍，
正见自除三毒心，　魔变成佛真无假。
法身报身及化身，　三身本来是一身，
若向性中能自见，　即是成佛菩提因。
本从化身生净性，　净性常在化身中，
性使化身行正道，　当来圆满真无穷。
婬性本是净性因，　除婬即是净性身，
性中各自离五欲，　见性刹那即是真。
今生若遇顿教门，　忽悟自性见世尊，
若欲修行觅作佛，　不知何处拟求真？
若能心中自见真，　有真即是成佛因，
不见自性外觅佛，　起心总是大痴人。
顿教法门今已留，　救度世人须自修，
报汝当来学道者，　不作此见大悠悠。」`,"师说偈已，告曰：「汝等好住。吾灭度后，莫作世情悲泣雨泪，受人吊问、身著孝服，非吾弟子，亦非正法。但识自本心，见自本性，无动无静，无生无灭，无去无来，无是无非，无住无往。恐汝等心迷，不会吾意，今再嘱汝，令汝见性。吾灭度后，依此修行，如吾在日；若违吾教，纵吾在世，亦无有益。」复说偈曰：",`「兀兀不修善，　腾腾不造恶，
寂寂断见闻，　荡荡心无著。」`,"师说偈已，端坐至三更，忽谓门人曰：「吾行矣！」奄然迁化。于时异香满室，白虹属地，林木变白，禽兽哀鸣。十一月，广韶新三郡官僚，洎门人僧俗，争迎真身，莫决所之。乃焚香祷曰：「香烟指处，师所归焉。」时香烟直贯曹溪。十一月十三日，迁神龛并所传衣钵而回。次年七月出龛，弟子方辩以香泥上之，门人忆念取首之记，仍以铁叶漆布固护师颈入塔。忽于塔内白光出现，直上冲天，三日始散。韶州奏闻，奉勅立碑，纪师道行。","师春秋七十有六，年二十四传衣，三十九祝发，说法利生三十七载，嗣法四十三人，悟道超凡者莫知其数。达磨所传信衣（西域屈眴布也），中宗赐磨衲宝钵，及方辩塑师真相，并道具，永镇宝林道场。留传《坛经》以显宗旨，兴隆三宝，普利群生者。"],source:"https://cbetaonline.dila.edu.tw/zh/T48n2008",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T48/T48n2008.xml",sourceLabel:"CBETA T48n2008",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"六祖大師法寶壇經",juan:[1]},{id:"cbeta-t01n0031",title:"一切流摄守因经",subtitle:"一切流摄守因经 · 后汉 安世高译",paragraphs:["闻如是：","一时，佛在拘留国留国聚会法议思惟。是时，佛告比丘：「比丘！」应：「唯然。」比丘便从佛受教。佛便说是：「智者见者，比丘！为得流尽，不智者不见者流不得尽。何等，比丘！智者见者令流得尽，不智不见者流不得尽？但为本观非本观。非本观者，未有欲便有欲生，已生欲，欲便增生不致；未生有流亦痴流便生，已生有亦痴便增多不致。痴者，比丘！不闻者，世间人，不见慧者，亦不从慧人闻法，亦不从慧人受教诫，亦不从慧人分别解，便得非本念。令未生流便生，已生流令增饶不致，未生有亦痴便生，已生有亦痴便增饶不致。以不知不解，如有令不可念法便念，可应念法者便不念。以应念法不念，不应念法者便念，便爱流生，已爱流生便增多不致，未生爱流亦痴流便生，已生爱流亦痴流便增多不致。闻者，比丘！道德弟子，以见慧者，以从慧者受教诫，亦从慧者分别解，便是如有知。非本念者，未生爱流便生，已生爱流便增多不致，未生爱流亦痴流便生，已生爱流亦痴流便增多不致。本念者，未生爱流不生，已生爱流能舍，未生爱流亦痴流不生，已生爱流亦痴流能舍。若是如有知便所法，不应念便不念，所应念法便念。以不应念法不念，应念法者念，令未生爱流不生，已生爱流便舍解，未生爱流亦痴流不生，已生爱流亦痴流便舍解。","「亦有比丘为七流，从是恼生、从是热、从是忧。何等为七？有，比丘！有流从见断，有流从摄断，有流从避断，有流从更断，有流从忍断，有流从晓断，有流从行念断。","「何等，比丘！流从见断？是闻，比丘！痴，不闻者，世间人，不见贤者，亦不从贤者解，亦不从贤者解教诫，令如是非本念：前世我为有不？前世我为无有不？前世我为何等？前世我为云何？未来世我当有不？未来世我当无有不？未来世我当云何？未来世我云何为？自身争疑有何等有？是人从何来？当复往至何许？是要当云何？以如是非本念者，为六处疑生、异异结生。庄有是身？庄无有是身？是为疑生，生自计身身见。如是疑生，生自计是身、是我身；为是疑生身、生身相见，为是疑生，生非身见是身，为是疑生，生计是为是我身。所觉所说、所作所更、所举所起，彼彼处处，所作所行善恶受罪，止不生亦生亦尔。","「是，比丘！结令结、疑令疑，恶疑不正见，跳疑结疑相著，比丘！不闻者世间人，从是苦习有，从是生致。闻者，比丘！道弟子，是苦如有知，是习如有知，是尽灭如有知，是苦灭行令灭如有知。如是知已，如是见，便三缚结毕尽：一者身结，二者疑结，三者行愿结。以是三结尽，便随道得一，不复堕恶处，当得度世。在人间天上，不过七世，已更七世便毕苦。若，比丘！不知者、不见者所生流，从恼热忧令从见者断，为是流恼热忧不复有，是名为，比丘！从见流断。","「何等为，比丘！流从守断？是闻比丘行者，眼见色，摄眼根自守，行恶露观；念本从所生。比丘！眼根不守摄，行令从恶露观，从念本所生流恼热忧，以眼根守摄止，便从恶露见本观，便所流恼热忧便不有，是为，比丘！流从守断。耳、鼻、口、身、意亦尔。","「何等为，比丘！流从避断？是闻比丘行者，所应从自守，避弊象、避弊马、避弊牛、避弊狗、避弊虺、避深坑、避蒺䔧、避溪、避危、避陂池、避山、避不安、避河、避深㵎、避恶知识、避恶伴、避恶求、避恶受、避恶处、避恶卧具所卧具。从贤者疑生，如是应，比丘！当避，如是上说不离，所生流恼热忧已得避，令是流恼热忧不复有，是名为，比丘！流从避断。","「何等为，比丘！流从用断？是闻比丘行者，从所用被服，不绮故、不乐故、不贪故、不严事故，但为令是身却蚊、蚋、风、日曝、含毒相更从，乱意生亦自守，所食不乐故、不贪故、不健故、不端正故，但令是身得住行道故，供养令断故。痛痒、新痛痒不复起，令从是差不随罪，得力安隐行，令从所更卧具床席，不绮故、不乐故、不贪故、不严事故，但令从是是身以有用剧苦疲惓令得止，亦令从所乐用、乐所用，不绮故、不乐故、不贪故、不严事故，但为令从是是身以生有痛恼大剧甚痛不可意从断，令救令解止，若比丘从不用故，生流恼热忧以从用得止，为所流恼热忧不复有，是名为，诸比丘！流从以更得断。","「何等为，比丘！流从忍断？是闻比丘行者，发精进行令断恶法，受清净法行，增发胆力，坚精进方便，不舍清净法。方便听令是身肌肉骨消干坏并髓肪皮，但令所应发精进所得，令得胆者、坚者、精进方便者，所求未得精进，不可中止。便行者比丘，能忍寒热饥渴、蚊蚋风日曝令止含毒，从闻不可语言憍慢意以来，能忍能暇，以生有含毒痛恼、不可意剧痛能过止。若，比丘！从不忍耐所生流热恼忧，令从过、令从是行，不复流恼热忧，令得止，是名为，比丘！流从忍耐断。","「何等为比丘流从晓断？是闻，诸比丘！比丘已生欲，令不听、不过；舍、晓相、却离；已生瞋恚，不听、不过；舍、晓相、却离；已生杀欺盗，不听，不过，舍，晓相，却离。若，诸比丘！不从晓，生流恼热忧，已从晓不生，便所流恼热忧令无复有，是名为，诸比丘！流从晓断。","「何等为，比丘！流从增行断？是闻诸比丘意，比丘意觉有增念行，独坐止却猗离恶转法。分别觉亦如是，精进觉亦如是，喜觉亦如是，猗觉亦如是，定觉亦如是，观却觉行亦如是，不听、不过、舍、晓相、却。若，诸比丘！不行不增所生流恼热忧已行增，为所流恼热忧不复有，是名为，诸比丘！流从行增断。","「若，诸比丘！所流应从见断，已从见断；若所流应从守摄断，已从守摄断；若流因从避断，已从避断；若流因从用断，已从用断；若流因从忍过断，已从忍过断；若流因从晓断，已从晓断；若流因从行增断，已从行增断；是名为，诸比丘！一切流摄守因，已坏恶爱，从世间逮得度世，舍缚结，得要离苦。」","佛说是，从是闻比丘，意受喜行，得度世竟得道。"],source:"https://cbetaonline.dila.edu.tw/zh/T01n0031",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T01/T01n0031.xml",sourceLabel:"CBETA T01n0031",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"一切流攝守因經",juan:[1]},{id:"cbeta-t01n0032",title:"四谛经",subtitle:"四谛经 · 后汉 安世高译",paragraphs:["闻如是：","一时，佛在舍卫国祇树给孤独园。是时，佛告诸比丘：「比丘！」应：「唯然。」比丘便从佛闻。佛便说是：「比丘！真正法说，为是四谛。具思惟见、开了分别发见。若所有比丘过世时，从如来无所著正觉是，亦从是正说，为是四谛。具思惟见、开了分别发见。从是四谛，若所有比丘从后世来者，从如来无所著正觉是，为从是正法，真为贤者四谛。具如上说。今有比丘见在，如来无所著正觉是，亦从是正谛，说如是四谛，具思惟见、开了分别发见。」","佛复告比丘舍利曰：「比丘！慧、疾慧、走慧、利慧、方慧、深彻慧、恶慧，不厌能见慧、珍宝慧随。比丘舍利曰能，比丘舍利曰所，是贤者四谛，平说具能。舍利曰比丘为奇人，具说思惟，能见能开，能了能分，别发能见，今多少随道法。是舍利曰比丘，最无有过，从邪能还。舍利曰比丘能令随道，目揵连比丘能令竟道；舍利曰比丘如母生，目揵连比丘如母供养。当目揵连比丘如是觉者，舍利曰、目揵连，当可事、当为供、当可往问。舍利曰比丘、目揵连比丘，为同学者致乐念，令无有他。」","佛已说如是，从坐起，入寺室，顷思惟在。时贤者舍利曰比丘，为利故、令佛在世间故，今为说是四谛：「何等为四？一为苦，二为习，三为尽，四为道，四谛受行令灭苦。何等为，贤者！苦谛？从生苦，从老苦，为病苦，为死苦，不哀相逢苦、离哀苦、所求不得是亦苦、仓卒五种苦。生，贤者！苦生为何等？若是人彼彼人种，从生增生，以随以有欲成，五阴已生，命根已得，是名为生。生，贤者！苦。何因缘生苦？为生者人令身有故更苦，从更复更，从痛复痛，令意更苦。从更复更，从受复受，令身意更苦。从更复更，知受复受，令身待受恼。从更复更，觉受复受，意念热恼。从更复更，知受复受，令身意热恼。从更复更，从受苦复苦，身热疲热恼。从更复更，从受复受，意热恼疲令热忧。从更复更，从受复受，令身意恼热疲。从念热恼，从更复更，从受复受，生，贤者！苦上说苦，是故说从是有老。","「贤者！苦老为何等？所各各疲疲人，其为是老，皱白力动以老，偻拄杖、鬓发堕、黑子生𭣛𭣛、根已熟、身欲坏、色已转、老已寿，是名为老。老，贤者！苦。何因缘说老苦？以人老身更苦，从更复更，行受复受，意念更苦。从更复更，作受复作受，身意亦苦。从更复更，行受复受，身热恼。从更复更，从受复受，意念热恼。从更复更，从受复受，身意热恼。从更复更，从受复受，身热疲忧恼。从更相更，从受相受，意念热恼疲恼忧。从更相更，从受相受，身意念热疲忧恼。从更相更，从受复受，是故，贤者！说老苦。上说苦，为是故说。","「病，贤者！苦。病为何等？有头病、有腹病、有耳病、有鼻病、有口病、有唇病、有舌病、有咽喉病、有哕病、有变病、有下病、有热病、有淋沥病、有颠病、有咽癅病、有寻寻病、有骨节病、有皮病、有肪病、有血热病、有痰病，是亦余若干，皆从猗生，不得离是，皆在著身。病，贤者！苦。何因缘病苦？人受故令身更苦，从更复更从受复受，意念苦。从更复更，从受复受，并身意念更苦。从更复更，从受复受，身热恼。从更复更，从受复受，令意热恼。从更复更，从受复受，身意念热恼。从更复更，从受复受，身热疲忧恼。从更复更，从受复受，意热疲忧恼。从更复更，从受复受，身意念热疲忧恼。从更复更，从受复受，所说病，贤者！苦。是故说，亦从是因缘有。","「死，贤者！苦。死为何等？所为人有，所为人有在生死，处处为舍身废坏灭，不复见命，已尽五阴、已舍命根、已灭死时，是名为死。贤者！苦，何因缘死苦？死者人为身更苦，从更复更，从受复受，意念更苦。从更复更，从受复受，身意念更苦。从更复更，从受复受，令身热恼。从更复更，从受复受，令意念热恼。从更复更，从受复受，令身意热恼。从更复更，从受复受，身热疲悔恼。从更复更，从受复受，令身意念热疲悔恼。从更复更，从受复受。死，贤者！苦，为是因缘说，亦从是因缘有说。","「不相哀相逢会，贤者！苦。不相哀相逢会，为何等有？贤者！人六自入，不哀不可，是从是相逢会。有是一坏相，离本相聚会、共事相离，是为苦。如是外亦尔，识亦尔，思亦尔，痛亦尔，思想亦尔，念为亦尔，爱亦尔，六行亦尔。有，贤者！人为六种持不哀。何等六种？若地种，若水种、火种、风种、空种、识种。是一会相，有合聚，共会共事，是为苦。不相哀会，贤者！苦。何因缘不相哀会，贤者！苦？不相哀共事会，贤者！人令身更苦，从更复更，从受复受，令意更苦。从更复更，从受复受，令身意念更苦。从更复更，从受复受，令身意念热。从更复更，从受复受，令身热疲苦恼。从更复更，从受复受，令意念热疲苦恼。从更复更，从受复受，令身意念热疲苦恼。从更复更，从受复受，不相哀相逢会，贤者！苦。是故所说亦从是，故从是说。","「哀相别离，贤者！苦。哀别离为何等？有是，贤者！人为所，自所入哀，令从是相别离亡，相别相离、不相俱，不会、不共居、不相逢、不更，是为苦。如是自外亦尔，识亦尔，更爱亦尔，痛亦尔，念为亦尔，爱亦尔，六持亦尔。有，贤者！人为哀六持，地持、水持、火持、风持、空持、识持，令从是相别离亡，相别相离、不会、远离、不共居、不相会、不共更，是为苦。是离，哀贤者！苦，为是故说，亦从是因缘说。","「若求不得是亦苦，是故复说。世间法，贤者！为人，若意生栽为莫生，是亦可舍。老法，贤者！为人，如是欲生为栽莫老，是意不舍。病法，贤者！人，病已受为是欲生，令我莫有，苦是欲舍。死法者，贤者，人已应受死，有是欲生，令我莫死，得不从是舍。有，贤者！人，已生痛，不可、不贪、意不用，为是欲生令是所生，痛不可贪、意不用，令是为可、令是为欲、令是为意不得，从欲断。有，贤者！人为求思想，亦念不可、不用意，不可有是意生，令是意生者，思想求不用、不可意、不可为欲是意，用可可意，为令我是意当用、当可不得，从是得断。有是，贤者！人，有更用可可意，设有是意生所，是更已生用可可意，令是常不离，是欲不当断。设有，贤者！人，生是思想，念爱可意欲，得为是欲生，令是思想念生欲可意欲，得令是常坚勿相离，令是愿莫断。所求不得是亦苦，是故说亦从是因缘故说。","「本为五阴苦，是故复说，令从是法。是法非常，厄病为坏，疾、败、老、不坚、不信，欲、转、离，为是故本五阴苦。过世，贤者！同是苦谛，未来世，贤者！亦是苦谛，现在世，贤者！亦是苦谛，是无有异，不倒不惑。如有谛如，是如应贤者谛贤者谛。贤者！是谛知见解得应，如是谛觉，是故名为贤者谛。","「何等为，贤者！苦习贤者谛？或人，贤者！六自，入身相爱，彼所爱著近往，是为习。如自身，外身亦尔，识更知行哀。有，贤者！人为六持爱：一为地、二为水、三为火、四为风、五为空、六为识。彼所爱著，相近往发，是为习。如是何应？若人在儿子，亦妻、从使御者、田地舍宅、坐肆卧具，便息为爱，著近更发往求，当知是爱习为苦习贤者谛。过世，贤者！时亦是爱习为苦习贤者习，未来世时亦是爱习为苦习贤者习，今现世时亦是爱习为苦习贤者习。如是不异，如有不倒不惑，真谛正如。有，贤者！谛，为贤者谛，更见解得，相应如有觉。是故，苦习名为贤者谛。","「何等为，贤者！苦尽贤者谛？有，贤者！为人六自身中种入，为不受，得从是解，不共更，已断、已舍、相离、已尽、不复望、已灭、寂然，是苦灭。如是内身，外亦尔，识相近，更思想，念行望，爱亦尔。有，贤者！人六持不爱：一地、二水、三火、四风、五空、六识。从是得解，不共更，已断、已舍、已弃、已异、不用、寂然，是为苦尽。是亦为何等？若人无有爱著，在儿、在家、在使、在御、田地舍宅、居肆卧具、卖买利息，无有爱著，不相近、意生发求，无有是，当知是爱尽为苦尽贤者谛。过世，贤者！时是亦爱尽为苦尽贤者谛，未来世亦尔，今现在世时亦是爱尽为苦尽贤者谛。如是不异，如有不惑不倒，真谛是如有，是故苦已尽名为贤者谛。","「何等为，贤者！苦尽受行贤者谛？有是，贤者！八种道：一直见、二直治、三直语、四直行、五直业、六直方便、七直念、八直定。","「何等为，贤者！直见？若，贤者！道德弟子为苦念苦，为习念习，为尽念尽，为道念道，得分别观，能得法观，能受想，能观想，能可想，能受行，是名为直见。亦观持宿，亦念道德，蚤行见行悔受止、无为、念寂然、止从不著、如得脱、意分别、观行相、行意在法、观相不离相会受，是名为正直见，是名为道德谛。","「何等为，贤者！正直治？若，贤者！道德弟子，苦为苦念，习为习念，尽为尽念，道为道念，若行随投念复念，是名为直治。亦观宿命持，亦所学行相念、从行观悔、无为、寂然受、止从无所著、得脱意、观止、所求所投念行随行，是名为直治，是名为道德谛。","「何等为，贤者！正直语？同，贤者！道德弟子！为从苦念苦，为从习念习，为从尽念尽，为从道念道，止四口犯、有余口恶行，从是得止离。止、相离、摄守、不可作，不作从受罪，无有罪，已止，是为直语。亦复为持宿观，已入行行念道、从行悔意止、无为、度世、寂然、可意、止、无所著，如得解脱意分别观，除四口恶行，离、止、相离、摄守、不可作、不作从受罪、无有罪、已止，是名为直语，是名为道德谛。","「何等为，贤者！正直行？念为，贤者！道德弟子，从苦为念苦，从习为念习，从尽为念尽，从道为念道，除身三恶行亦余身恶行，从是止、离、摄守、不可作、不作从受罪、无有罪、已止，是名为直行。亦持观宿命，亦从道德行，念世间行见悔，止、无为、度世见、寂然止、从无为度世、不著、如得脱意得观，除身三恶行亦除身恶行，离、止、相离、摄守、不可作、从受罪无有、罪已止，是名为正直行，是名为道德谛。","「何等为，贤者！正直业？若，贤者！道德弟子，苦从苦念，苦习从习念，习尽从尽念，尽道从道行得念，所不应求、所不可行，若干畜生业，从邪行欲自活，是名为邪业。亦持宿命行观，从行得道，念世间行观悔，止、度世、无为观、寂然、止得度世、不著、如得脱意从得观，不应求不求，若干畜生业行自活命，离、止、相离、摄守、不可作、从受罪无有、罪已止，是名为正直业，是名为道德谛。","「何等为，贤者！正直方便？贤者！道德弟子，苦为念苦，习为念习，尽为念尽，道为念道，所精进、所方便、所出、所住止、所能、所敷、所喜，不毁不灭念正止，是名为正直方便。亦有持宿命观，亦从得行念，从世间行见悔，止见、度世、无为、寂然、止从、不著、已得道观解脱意，所精进、所方便、所出、所住止、所敷、所喜、不毁灭念正摄止，是名为正直方便，是名为道德谛。","「何等为，贤者！直正念？若，贤者！道德弟子，苦为念苦，习为念习，尽为念尽，道为念道，相念从念，念念不忘，少言、念不离，是名为正直念。亦观持宿命，亦从得道行，念世间行不可悔，摄、止、度世、无为、寂然、止见、一德、无所著、如解脱意观念想念，从念念、念不忘、少言、念不离，是名为直正念，是名为道德谛。","「何等为，贤者！直正定？若，贤者！道德弟子，苦为念苦，习为念习，尽为念尽，道为念道，意止故不动不走，已摄止故意念在一，是名为直正定。亦观持宿命，亦从得解意念，见世间行悔，摄、止、度世、无为、见可如、得无所著、从解脱因缘意向观所意止，正安一、不惑、不走、摄止、念定在二念，是名为正直定，是名为道德谛。过世，贤者！亦是苦尽受贤者谛，后世未来时亦从是受行贤者谛，今现世时亦从是受行灭苦贤者谛，如是不异，如有不失不惑，真谛如本如有德道德谛，贤者！是谛更见得应解脱，是故为苦尽。从是行名为道德谛。从后敛说，苦、苦习、尽亦见道，佛所说行无有量。」","舍利曰说如是，比丘受行。","持宿命观（《大安般》云「信本因缘」，知从宿命有，名直见。）（《义决》云「知前事」，如后事是也）。"],source:"https://cbetaonline.dila.edu.tw/zh/T01n0032",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T01/T01n0032.xml",sourceLabel:"CBETA T01n0032",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"四諦經",juan:[1]},{id:"cbeta-t01n0046",title:"阿那律八念经",subtitle:"阿那律八念经 · 后汉 支曜译",paragraphs:["闻如是：","一时，佛在誓牧山求师树下。贤者阿那律，在彼禅空泽中坐思惟言：「道法少欲，多欲非道；道法知足，无厌非道；道法隐处，乐众非道；道法精进，懈怠非道；道法制心，放荡非道；道法定意，多念非道；道法智慧，愚暗非道。」","佛以圣心逆知其意，譬如力士屈申臂顷飞到其前，赞言：「善哉善哉！阿那律！汝所念者为大士念。听吾语汝大士八念，善思行之。当学四禅捡意观法而无中止，必获大利，不失所愿。何谓四禅？惟弃欲恶不善之法，意以欢喜，为一禅行。以舍恶念专心守一，不用欢喜，为二禅行。欢喜以止，惟如法观觉见苦乐，为三禅行。又弃苦乐，忧喜悉断而住清净，为四禅行。已学如是，而后惟行八大人念。四禅为捡意法，快见于行，得利愿疾，不复中止。又少欲者，其义譬如王有边臣，主诸椷簏满中彩衣，而汝自乐著麁弊者，少欲知足，隐处精进，制心定意，智慧舍家，不以戏慢，无有差跌，必安隐人，至泥洹门。是八大人念，惟四禅捡意观法，其义譬如王有边臣，监主厨宰和调五味，而汝自乐乞食，趣得救身不以快心。其义譬如王有游观楼阁，而汝自乐山泽树间燕处精进，无欲于世。其义譬如王有边臣，主诸良药及酪酥醍醐石蜜，而汝自乐有疾以服，小便趣得除恼。以行八念，思惟四禅，精进不亏，心无差跌，必自安隐至泥洹门。」","佛说是已，即还誓牧告诸弟子：「道当少欲，无得多欲；道当知足，无畜遗余；道当隐处，无乐众会；道当精进，无得懈怠；道当制心，无得放逸；道当定意，无得乱念；道当智慧，无得愚暗。","「比丘当少欲者快，谓身自少欲，不使众人知我少欲，义当从是。","「比丘知足，谓应器法衣床卧病药，得食足止，不畜遗余，义当从是。","「比丘隐处，谓避人间，不入众会，远居山泽岩石树间。如有四辈，若王大臣来从问道，为说清净欲令疾去。譬如贫人负豪姓债，为主所牵抴，欲离不乐潜隐远遁，义当从是。","「比丘精进，谓断非法，勤行经道未常懈惓，上中后夜经行坐卧，常觉寤意念净以除五盖，义当从是。","「比丘制心，弃欲恶法，坐意惟观，以断苦乐，得四禅行，义当从是。","「比丘定意，谓常一心，观身观意观法，不为猗行，摄念就道舍痴恼想，义当从是。","「比丘智慧，谓知四谛：苦、习、尽、道。何谓苦谛？生苦、老苦、病苦、死苦、忧悲恼苦、恩爱别苦、怨憎会苦、所欲不得苦、合五盛阴苦。生苦者，谓人随行所堕，受胞成生，已出形现，根入受长。老者，谓人根熟形变，发白齿落、筋缓皮皱、偻步拄杖。病者，谓人罪行所致，痈疽疮脓癎癫长病，亦百余种。死者，谓人命逝形坏，温消气绝魂神离逝。是皆为苦。何谓习谛？谓婬心乐喜而生恩爱，志在贪欲，令复有漏，众行滋盛以著自缚。所谓爱者，眼爱色、耳爱声、鼻爱香、舌爱味、身爱细滑、心爱所欲；但观其常乐在望，安以为利，呼言是我有，以著自缚，从是故色痛想行识五阴爱盛，见常贪乐，谓是我有，以著自缚。所谓色者，精神所受地气、水气、火气、风气，变化为形；以所爱著，令眼识色、耳识声、鼻识香、舌识味、身识细滑、意识法著，信为习谛。何谓尽谛？不受不入，爱尽无余，缚著已解，如慧见者，不复有一切故。世间人无所见，五阴所著；计数已尽，爱缚都解，已从慧见非常、苦、空、非身故断，是为尽谛。何谓道谛？谓八直道，正见、正思、正言、正行、正治、正命、正志、正定。何谓正见？正见有二：有俗、有道。知有仁义，知有父母，知有沙门梵志，知有得道真人，知有今世后世，知有善恶罪福，从此到彼以行为证，是为世间正见。已解四谛：苦、习、尽、道，已得慧见，空净非身，是为道正见。正思亦有二：思学问、思和敬、思诫慎、思无害，是为世间正思；思出处、思忍默、思灭爱尽著，是为道正思。正言亦有二：不两舌、不恶骂、不妄言、不绮语，是为世间正言；离口四过，讲诵道语，心不造为，尽无复余，是为道正言。正行亦有二：身行善、口言善、心念善，是为世间正行；身口精进，心念空净，消荡灭著，是为道正行。正治亦有二：不杀盗婬，不自贡高，修德自守，是为世间正治；离身三恶，除断苦习，灭爱求度，是为道正治。正命亦有二：求财以道不贪苟得，不诈绐心于人，是为世间正命；以离邪业，舍世占候，不犯道禁，是为道正命。正志亦有二：不嫉妬、不恚怒、不事邪，是为世间正志；离心三恶，行四意端，清净无为，是为道正志。正定亦有二：性体淳调，守善安固，心不邪曲，是为世间正定；得四意志，惟空、无想、不愿，见泥洹源，是为道正定，是为道谛。比丘舍家弃捐恩爱，安静思道无所恋慕，意不随欲净无罣碍，是为道法，义当从是。」","贤者阿那律闻佛说经，开导其意受行三月，漏尽意解，得三治以为证已，自觉得罗汉，便说偈言：",`「夫欲而无厌，　乐众以放意，
是行以致苦，　修恶多所著。
少欲知道行，　知惭不自见，
是法堕清净，　远恶致度世。
道意不贪生，　亦无乐死别，
吾以如空定，　诸苦得待时。
从佛受教命，　守行弃欲恶，
所身患已舍，　得利就无为。
自致至三治，　已拔恩爱根，
当于维沙聚，　竹园般泥洹。」`],source:"https://cbetaonline.dila.edu.tw/zh/T01n0046",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T01/T01n0046.xml",sourceLabel:"CBETA T01n0046",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"阿那律八念經",juan:[1]},{id:"cbeta-t01n0056",title:"乐想经",subtitle:"乐想经 · 西晋 竺法护译",paragraphs:["闻如是：","一时，婆伽婆在舍卫城祇树给孤独园。彼时，世尊告诸比丘：「诸有沙门婆罗门，于地有地想，乐于地、计于地为我，彼言地是我；我说彼未知水、火、风。天神、梵天、阿婆天、阿鞞婆天，净有净想，乐于净、计净为我，彼言净是我；我说未知虚空处、识处、无所有处、无想处。或一或若干，或别见闻知识得观觉行，今世至后世，后世至今世，彼有此想乐，乐是计是我，彼尽计是我；我说彼未知。诸有沙门婆罗门，计地为神通，不乐于地，不乐于地不计地为我，彼不言地是我；我说彼已知水、火、风。天神、梵天、阿婆天、阿鞞婆天，以净为神通，不乐净，不乐净，不以净是我；我说彼已知虚空处、识处、无所有处、无想处。或一或若干，或别闻闻见识知得观觉行，从今世至后世，从后世至今世，彼尽以神通示不乐亦不乐，亦不计我，亦不言是我；我说彼以知。复次，我以地为神通，不乐地，不乐地，不以地为我，我不计地，我以知水火风。神天、梵天、阿婆天、阿鞞婆天，彼神通不以为净，不以为净，不计净为我，我以知此虚空处、识处、无所有处、无想处。或一或若干，或别见闻识知得观觉行，从今世至后世，从后世至今世，尽已神通不乐，不乐，不计为我；我已知此。」佛如是说。彼诸比丘闻世尊所说，欢喜而乐，所因跋渠尽。"],source:"https://cbetaonline.dila.edu.tw/zh/T01n0056",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T01/T01n0056.xml",sourceLabel:"CBETA T01n0056",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"樂想經",juan:[1]},{id:"cbeta-t01n0016",title:"尸迦罗越六方礼经",subtitle:"尸迦罗越六方礼经 · 后汉 安世高译",paragraphs:["佛在王舍国鸡山中。时，有长者子，名尸迦罗越，早起严头，洗浴著文衣，东向四拜、南向四拜、西向四拜、北向四拜、向天四拜、向地四拜。佛入国分卫遥见之，往到其家问之：「何为六向拜？此应何法？」","尸迦罗越言：「父在时教我六向拜，不知何应？今父丧亡，不敢于后违之。」","佛言：「父教汝使六向拜，不以身拜。」","尸迦罗越便长跪言：「愿佛为我解此六向拜意。」","佛言：「听之，内著心中。其有长者𭶑人能持四戒不犯者，今世为人所敬，后世生天上。一者不杀诸群生、二者不盗、三者不爱他人妇女、四者不妄言两舌。心欲贪婬、恚怒、愚痴，自制勿听。不能制此四意者，恶名日闻，如月尽时光明稍冥。能自制恶意者，如月初生其光稍明，至十五日盛满时也。」","佛言：「复有六事，钱财日耗减。一者喜饮酒；二者喜博掩；三者喜早卧晚起；四者喜请客，亦欲令人请之；五者喜与恶知识相随；六者憍慢轻人。犯上头四恶，复行是六事，妨其善行，亦不得忧治生，钱财日耗减，六向拜当何益乎？」","佛言：「恶知识有四辈：一者内有怨心，外强为知识；二者于人前好言语，背后说言恶；三者有急时，于人前愁苦，背后欢喜；四者外如亲厚，内兴怨谋。善知识亦有四辈：一者外如怨家，内有厚意；二者于人前直谏，于外说人善；三者病瘦县官，为其征彸忧解之；四者见人贫贱不弃捐，当念求方便欲富之。恶知识复有四辈：一者难谏晓教之作善，故与恶者相随；二者教之莫与喜酒人为伴，故与嗜酒人相随；三者教之自守，益更多事；四者教之与贤者为友，故与博掩子为厚。善知识亦有四辈：一者见人贫穷卒乏令治生；二者不与人诤计挍；三者日往消息之；四者坐起当相念。善知识复有四辈：一者为吏所捕，将归藏匿之，于后解决之；二者有病瘦，将归养视之；三者知识死亡，棺敛视之；四者知识已死，复念其家。善知识复有四辈：一者欲鬪，止之；二者欲随恶知识，谏止之；三者不欲治生，劝令治生；四者不喜经道，教令信喜之。恶知识复有四辈：一者小侵之便大怒；二者有急倩使之，不肯行；三者见人有急时，避人走；四者见人死亡，弃不视。」佛言：「择其善者从之，恶者远离之。我与善知识相随，自致成佛。」","佛言：「东向拜者，谓子事父母，当有五事：一者当念治生；二者早起勅令奴婢，时作饭食；三者不益父母忧；四者当念父母恩；五者父母疾病，当恐惧，求医师治之。父母视子亦有五事：一者当念令去恶就善；二者当教计书疏；三者当教持经戒；四者当早与娶妇；五者家中所有当给与之。","「南向拜者，谓弟子事师，当有五事：一者当敬难之；二者当念其恩；三者所教随之；四者思念不厌；五者当从后称誉之。师教弟子亦有五事：一者当令疾知；二者当令胜他人弟子；三者欲令知不忘；四者诸疑难悉为解说之；五者欲令弟子智慧胜师。","「西向拜者，谓妇事夫，有五事：一者夫从外来，当起迎之；二者夫出不在，当炊蒸扫除待之；三者不得有婬心于外夫，骂言不得还骂作色；四者当用夫教诫，所有什物不得藏匿；五者夫休息盖藏乃得卧。夫视妇亦有五事：一者出入当敬于妇；二者饭食之，以时节与衣被；三者当给与金银珠玑；四者家中所有多少，悉用付之；五者不得于外邪畜传御。","「北向拜者，谓人视亲属朋友，当有五事：一者见之作罪恶，私往于屏处，谏晓呵止之；二者小有急，当奔趣救护之；三者有私语，不得为他人说；四者当相敬难；五者所有好物，当多少分与之。","「向地拜者，谓大夫视奴客婢使，亦有五事：一者当以时饭食与衣被；二者病瘦当为呼医治之；三者不得妄挝捶之；四者有私财物，不得夺之；五者分付之物当使平等。奴客婢使事大夫亦有五事：一者当早起，勿令大夫呼；二者所当作，自用心为之；三者当爱惜大夫物，不得弃捐乞匃人；四者大夫出入当送迎之；五者当称誉大夫善，不得说其恶。","「向天拜者，谓人事沙门道士，当用五事：一者以善心向之；二者择好言与语；三者以身敬之；四者当恋慕之；五者沙门道士人中之雄，当恭敬承事，问度世之事。沙门道士当以六意视凡民：一者教之布施，不得自悭贪；二者教之持戒，不得自犯色；三者教之忍辱，不得自恚怒；四者教之精进，不得自懈慢；五者教人一心，不得自放意；六者教人𭶑慧，不得自愚痴。沙门道士教人去恶为善，开示正道，恩大于父母。如是行之，为知汝父在时六向拜之教也，何忧不富乎？」","尸迦罗越即受五戒，作礼而去。","佛说呗偈：",`「鸡鸣当早起，　被衣来下床，
澡漱令心净，　两手奉花香。
佛尊过诸天，　鬼神不能当，
低头绕塔寺，　叉手礼十方。
贤者不精进，　譬如树无根，
根断枝叶落，　何时当复连？
采华著日中，　能有几时鲜？
放心自纵意，　命过复何言。
人当虑非常，　对来无有期，
犯过不自觉，　命过为自欺。
今当入泥犁，　何时有出期？
贤者受佛语，　持戒慎勿疑。
佛如好华树，　无不爱乐者，
处处人民闻，　一切皆欢喜。
令我得佛时，　愿使如法王，
过度诸生死，　无不解脱者。
戒德可恃怙，　福报常随己，
现法为人长，　终远三恶道。
戒慎除恐畏，　福德三界尊，
鬼神邪毒害，　不犯有戒人。
堕俗生世苦，　命速如电光，
老病死时至，　对来无豪强。
无亲可恃怙，　无处可隐藏，
天福尚有尽，　人命岂久长。
父母家室居，　譬如寄客人，
宿命寿以尽，　舍故当受新。
各追所作行，　无际如车轮，
起灭从罪福，　生死十二因。
现身游免乱，　济育一切人，
慈伤坠众邪，　流没于深渊。
勉进以六度，　修行致自然，
是故稽首礼，　归命天中天。
人身既难得，　得人复嗜欲，
贪婬于意识，　痛想无厌足。
豫种后世栽，　欢喜诣地狱，
六情幸完具，　何为自困辱？
一切能正心，　三世神吉祥，
不与八难贪，　随行生十方。
所生趣精进，　六度为桥梁，
广劝无极慧，　一切蒙神光。」`],source:"https://cbetaonline.dila.edu.tw/zh/T01n0016",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T01/T01n0016.xml",sourceLabel:"CBETA T01n0016",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"尸迦羅越六方禮經",juan:[1]},{id:"cbeta-t14n0432",title:"佛说十吉祥经",subtitle:"佛说十吉祥经 · 失译",paragraphs:["如是我闻：","一时，佛在罗阅祇耆阇崛山中，与大比丘众千二百五十人、菩萨五千人俱。","尔时，世尊与无央数百千人，前后围绕而为说经。","时大会中有一大士，名离垢盖，承佛威神，即从座起，偏袒右肩，右膝著地，叉手合掌，前白佛言：「今可现有诸佛世尊如来、至真、等正觉，若有善男子、善女人求佛道者，闻其名号受持读诵，疾得不退转于无上正真道？」","佛告离垢盖太士：「善哉！善哉！族姓子乃能作是问，多所利益。","「有，族姓子！东方去此度一恒沙数诸佛世界，有世界名方庄严，其刹有佛，名大光耀如来、至真、等正觉，今现在说法。","「复有，族姓子！东方度二恒沙数诸佛世界，有世界名谛胜诸胜，其刹有佛，名慧灯明如来。有世界名金刚，其刹有佛，名大雄如来。有世界名净尊住，其刹有佛，名无垢尘如来。有世界名金光明，其刹有佛，名上像幢十盖王如来。有世界名大威神，其刹有佛，名威神自在王如来。有世界名香熏，其刹有佛，名极受上影王如来。有世界名宝严，其刹有佛，名内宝如来。有世界名海灯明，其刹有佛，名大海如来。有世界名十力灯明，其刹有佛，名十力现如来。当知，离垢盖！若善男子、善女人求佛道者，恒边沙刹满中七宝持用布施如来、正觉，若善男子、善女人，闻此佛名受持讽诵执在心怀，于大众中为人广说，此之功德过前功德。」","重欲解义，而说偈言：",`「如恒边沙，　诸佛世界，　满中七宝，
持用布施，　若有得闻，　诸佛名号，
信乐不忘，　功德过前。`,`「若闻诸佛名，　讽诵莫忘失，
其人不宜疑，　言我不成佛。
六通无穷尽，　至于无数劫，
其身当金色，　相好以庄严。
若持佛名号，　过于十亿劫，
疾得成正觉。」`,"佛说经竟，离垢盖大士、诸菩萨等，天龙、鬼神及世间人，咸皆欢喜顶受佛教。"],source:"https://cbetaonline.dila.edu.tw/zh/T14n0432",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T14/T14n0432.xml",sourceLabel:"CBETA T14n0432",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說十吉祥經",juan:[1]},{id:"cbeta-t16n0702",title:"佛说施灯功德经",subtitle:"佛说施灯功德经 · 高齐 那连提耶舍译",paragraphs:["如是我闻：","一时，佛在舍卫国祇树给孤独园。尔时世尊告舍利弗言：「舍利弗！佛有四种胜妙善法，能令众生得无量果、无量光明、无量妙色、无量福藏、无量乐藏，无量戒、定、智慧、解脱、解脱知见、辩才之藏，一切无著无漏之法。","「舍利弗！何等为四？一者、谓如来、应、正遍知得尸波罗蜜，具无量戒；二者、得禅波罗蜜，具无量定；三者、得波若波罗蜜，具无量慧及广智慧、观达慧、如性慧、无数慧、决定慧、毕定知见；四者、得无浊心、善胜作心，具妙解脱、第一解脱。是为四种胜妙善法。","「舍利弗！是佛、如来、应、正遍知于一切恶皆悉远离，一切善法皆悉成就，众行备满，具如实见，远离暗冥，能为光曜，具足无量福智资粮，隐蔽世间，不为世间之所映夺，获得戒、定、智慧、解脱、解脱知见，具足十力、四无所畏，得一切诸佛法力，能具诸佛法力，得具诸佛大慈悲力及辩才力，本愿方便，皆悉满足，善修本业，具智慧宝，精进无量，终不休息，离诸忧戚，无有逼恼，无有取著，能善调伏，为大龙王，无有余习，为一切众生无上福田。","「舍利弗！若比丘、比丘尼、沙弥、沙弥尼、优婆塞、优婆夷，发清净心，为求福故、为爱乐福故，思念如来无上方便本行满足，尽未来际一切生死，于现在世成就无量无著戒、定、智慧、解脱、解脱知见，乃至念佛一种功德；念功德已，于无量亿那由他百千劫中，所习善根三明福田所、清净戒所、无等等戒所、无量真实功德所，或于塔庙诸形像前，而设供养故，奉施灯明，乃至以少灯炷，或苏油涂然，持以奉施，其明唯照道之一阶。","「舍利弗！如此福德非是一切声闻、缘觉所能了知，唯佛、如来乃能知也！舍利弗！求世报者，福德尚尔，何况以清净深乐心、不求果报安住恭敬、相续无间念佛功德善男子、善女人等所生福德？舍利弗！照道一阶福德尚尔，何况全照一阶道也——或二阶道、或三阶道、或四阶道——或及塔身一级、二级乃至多级；一面、二面乃至四面及佛形像？","「舍利弗！彼所燃灯，或时速灭，或风吹灭，或油尽灭，或炷尽灭，或俱尽灭。譬如诸龙以瞋恚故，出云垂布，于中起电，起已寻灭。","「舍利弗！如是少时于佛塔庙奉施灯明，若彼比丘、比丘尼、沙弥、沙弥尼、优婆塞、优婆夷，若复余人不受戒者，为乐善故，护己身故，信佛、法、僧，如是少灯奉施福田所得果报、福德之聚，唯佛能知，一切世间天、人、魔、梵、沙门、婆罗门，乃至声闻、辟支佛等所不能知。如是然少灯明所受福报，不可得说。","「舍利弗！诸佛境界不可思议，唯有如来乃知此义。舍利弗！彼施灯者，所得福聚无量无边，不可算数，唯有如来乃能了知。舍利弗！然少灯明福德尚尔不可算数，况我灭后于佛塔寺，若自作、若教他作，或然一灯、二灯乃至多灯，香花、璎鬘、宝幢、幡盖及余种种胜妙供养？","「舍利弗！有四种法应当信受。何等为四？一者、佛法无量，应当信受；二者、少修善根，获无量报，应当信受；三者、若于三宝深生敬信善修业行所得福报，汝等声闻现得见我，尚不能得具足知之，亦复不能思惟测度，况我灭后声闻弟子远离我者，能得现知及能测度？若有能知及测度者，无有是处，应当信受；四者、是诸声闻不能得知及能测量一切众生所有作业及业果报。舍利弗！汝等声闻于此事中不须思量。何以故？舍利弗！如来常说一切众生业行果报不可思量；过去诸佛、应、正遍知已如是说众生业报不可思量；未来诸佛、应、正遍知当如是说众生业报不可思量。众生心信及心自性亦不可知、不可思量，如是之义应当信受！","「舍利弗！汝等声闻住圣种者，于一切众生业报之中，无有实眼及巧方便，况余轻微薄劣心者，离戒、定、慧、解脱、解脱知见者，失正念者，无明暗冥、厚翳目者，于自己身内、外诸法而不能知——我竟是谁？我是谁许？我住何处？我之功德为大、为小？我当云何为与戒相应、为与戒不相应？我为正念戒、我为失念戒？我所作业为作智人业、为作愚人业？为从何来、为何处去？舍利弗！诸凡夫人颠倒见者，于自己身如是等事尚自不知，况能得知一切众生种种业报？若能知者，无有是处。","「舍利弗！如来、应、正遍知，戒无减，定无减，智无减，解脱无减，解脱知见无减，相无减。舍利弗！如来、应、正遍知，无量戒、无碍戒、不思议戒、无等戒、究竟戒、清净戒、彼如来于一切众生若业、若业报，皆如实知。","「舍利弗！云何如来于一切众生业报得如实知？舍利弗！佛如是知：或有众生善业尽，不善业增；或有众生不善业尽，善业增；或有众生善业当生，不善业当灭；或有众生不善当生，善业当灭。舍利弗！如来如是入一切众生业及业报种种差别，皆如实知彼彼众生或有无知或有愚暗，或有善者或不善者。舍利弗！我有如是智，有如是善巧，于诸众生不可思议种种业报，皆能记说。","「舍利弗！若有众生成就信心，彼能信我。若复众生无有信心，远离我法，不信我语，诽谤于我，彼于长夜无义、无利，坠堕苦恼。舍利弗！若彼众生于佛塔庙奉施灯明，以此奉施所作善业，能获安乐、可乐之果。彼施灯明作善业时，欣喜相应，从信心起，于现在世得三种净心。何等为三？彼诸善男子、善女人作是念：『我于如来已设供养，知身不坚，摄坚身想；知财过患，摄坚财想。』舍利弗！是名供养佛塔第一净心。复次，舍利弗！彼诸善男子、善女人起如是心：『我于如来无上福田、最胜福田，能受最胜供养者所，已作供养。我今不畏堕于地狱、畜生、饿鬼。我此善根，已作人、天善道之因，得于妙色资生众具，又得智慧、安隐、快乐，乃至能得菩提之果。』舍利弗！是名供养佛塔第二净心。复次，舍利弗！彼诸善男子、善女人作如是想：『我于诸佛已作舍施，已作福德，已舍悭贪，已除悭过。』作是念已，施心无悭，施心增长。舍利弗！是名供养佛塔第三净心。","「复次，舍利弗！若善男子、善女人于佛塔庙施灯明已，临命终时得三种明。何等为三？一者、彼善男子、善女人临命终时，先所作福悉皆现前，忆念善法而不忘失。舍利弗！是为一明；因此便能念知，自己先于佛所殖诸善业。复次，舍利弗！彼善男子、善女人于命终时，得如是念：『我于佛像塔庙等前，已曾供养。』作是念已，心生踊悦。舍利弗！是为二明；因此便能起念佛觉。复次，舍利弗！彼善男子、善女人于命终时，见余众生奉行布施，见他作已，起如是念：『我亦曾于佛支提所奉施灯明，我今亦当复行布施！』念于布施，得欣喜心；得喜心已，无有死苦。舍利弗！是为三明；因此便得念法之心。","「复次，舍利弗！佛塔庙中布施灯明，彼善男子、善女人于临终时，更复得见四种光明。何等为四？一者、于临终时，见于日轮圆满涌出；二者、见净月轮圆满涌出；三者、见诸天众一处而坐；四者、见于如来、应、正遍知坐菩提树，垂得菩提，自见己身，尊重如来，合十指掌，恭敬而住。舍利弗！是名于佛塔庙布施灯已，临命终时，得见如是四种光明。」","尔时世尊说此义已，复说偈言：",`「无上法王大仙人，　若人奉施彼塔庙，
彼智慧者作业已，　获得无边最胜乐。
临命终时不失念，　能见自昔布施灯，
得四种喜离诸罪，　于彼死时不惑乱。
临死时见十方明，　现覩日月从地出，
见天千万那由他，　为彼天众说佛法。
父母妻子及亲属，　皆悉围绕大悲号，
死者不念亦不视，　彼人正念常不乱。
现前得覩天宫殿，　对诸天女心安隐，
复见庄严诸园林，　是中具足胜五欲。
又见佛坐菩提树，　天人修罗悉围绕，
自见合掌住佛前，　于胜牟尼修供养。
既见导师深敬重，　其心欣喜请如来，
世尊见彼心欣喜，　于是不违受彼请。
是人称愿喜充遍，　于舍命时无苦恼，
彼于佛所心喜已，　无有临终大怖畏。
临命终时不失念，　彼覩十方皆大明，
见未曾有胜妙色，　此是施灯之果报。
死已必得生天上，　自见己身坐天床，
有诸天女围绕之，　供养佛故得此果。`,"「复次，舍利弗！于佛塔庙施灯明已，死便生于三十三天；生彼天已，于五种事而得清净。舍利弗！云何彼天于五种事而得清净？一者、得清净身；二者、于诸天中得殊胜威德；三者、常得清净念慧；四者、常得闻于称意之声；五者、所得眷属常称彼意，心得欣喜。舍利弗！是名彼天于五种事而得清净。」","尔时世尊欲重宣此义，而说偈言：",`「彼天获得光明身，　具足功德他尊重，
与千天子为上首，　以灯施佛支提故。
所闻天声常称意，　哀美殊妙胜余天，
具足第一胜念慧，　复得最上胜眷属。
随彼天子所行处，　一切诸天皆钦仰，
本昔修习何等业，　今得如是炽然身？
有树皆名上欢喜，　周匝光照犹如月，
彼天感得是妙树，　持此庄饰天宫园。
无量诸天皆惊怪，　今此树花名何等？
犹如灯明光照曜，　普出如意妙熏香。
彼天所有诸眷属，　以彼树花庄严身，
彼于无量亿天中，　光明照曜犹如日。`,"「复次，舍利弗！于佛塔庙布施灯明，生三十三天已，彼天自知：『如是时中，我住于此；如是时中，我当命终。』彼胜天子临命终时，于其眷属及余天众，说法劝化，令其欣喜。于彼天宫舍寿命已，不堕恶趣，生于人中最上种姓、信佛法家。是时世间若无佛者，亦复不在轻取吉凶、邪见家生。」","尔时世尊欲重宣此义，而说偈言：",`「彼天生得如是智，　知尔许时天中住，
彼天亦复能自知，　我今未几当命尽。
五种死相出现时，　彼天寿命临欲绝，
即为亿天众说法，　远离愚痴心不忧。
于天众中作是言：　诸有无常亦无乐，
或有生者或有死。　不念将死说是法。
彼诸眷属皆悲恼，　无量天众亦复然，
虽复见己五种相，　自念功德不忧愁。
在彼天宫命绝已，　寻即下来人间生，
住胎出胎念不乱，　常受快乐无苦恼。
生已便得宿命通，　悉能忆念本来处，
念人中苦不贪乐，　须臾死来见逼切。
彼念天中果报已，　于此人间不为乐，
天中尚苦况复人？　诸有不坚常流动。
彼人及其成立已，　必当舍家而出家，
心常不行恶觉观，　彼当获得如是果：
世世恒得宿命通，　亦常不作诸恶业，
必定出家持净戒。　此是彼施灯明果。
恒常不盲及挛躄，　眼一切时不暗昧，
身亦无病无恶声，　心常黠慧不愚惑。
又复恒常无眼患，　所在受生眼不眇，
不无一眼及瞎眼，　彼眼亦常不浊乱。
眼目修长黑白分，　犹如净妙青莲叶，
眼净能见微细物，　如彼明彻摩尼珠。
无量阿僧祇劫中，　得净肉眼不失坏，
彼亦常无眼诸病，　此是奉施灯明果。
善印善根善诸论，　于诸工巧悉究了，
彼有智人善观察，　妙慧能见第一义。
善观诸有不自在，　于佛法中得照明，
普见一切佛世尊，　见已恭敬修供养。
生生得胜端正色，　亲戚眷属皆敬爱，
得大财宝力自在，　及得不坏诸眷属。
如彼灯明能破暗，　炽燃照曜遍诸方，
彼人光明亦如是，　不为暗冥所隐蔽。
若于佛塔起信心，　施胜灯鬘及璎珞，
施灯明时心清净，　获得人中最胜尊。
端正殊妙甚可爱，　一切世间所喜乐，
心不轻取于吉凶，　亦不乐于世左道。
世间所有诸恶见，　及邪道等不信受，
若为国王恒知足，　不贪他土兴战诤。
常无苦恼亦无忧，　亦复无有诸恼热，
彼无一切诸退失，　复无恶名无衰恼。
若为王臣所发言，　王及国人无不信，
身常无有羸瘠病，　不作黄门不非道。
身相具足安乐住，　患苦不能著其身，
亦复不见诸恶梦，　卧觉一切常安隐。
生生能得诸伏藏，　供养一切佛支提，
诸佛功德无有边，　彼人所得亦如是。`,"「舍利弗！若有众生于佛塔庙施灯明者，得于四种可乐之法。何等为四？一者、色身；二者、资财；三者、大善；四者、智慧。舍利弗！若有众生于佛支提施灯明者，得如是等可乐之法。」","尔时如来欲重宣此义，复说偈言：",`「身𦟛圆满具大力，　不与他人共战诤，
遍游诸方无恼者，　由灯奉施佛支提。
生于大富上族家，　具足功德人所敬，
生生恒得宿命智，　由灯奉施佛支提。
于诸众生常悲念，　发言眷属皆敬受，
心无损害恒调柔，　常不造作恶道业。`,"「复次，舍利弗！若有众生供养佛塔，得四种清净。何等为四？一者、身业清净；二者、口业清净；三者、意业清净；四者、善友清净。","「舍利弗！云何得于身业清净？若善男子、善女人于彼彼生处，远离杀生，无杀害意，亦常远离偷盗、邪婬，于己妻所尚不邪行，况余人妻？亦不饮酒，放逸自纵，不以刀杖及余苦具加逼众生，离不善法及诸恶业。舍利弗！远离是等，是名身业清净。","「舍利弗！云何口业清净？是人世世常不妄语，若不见闻终不妄说，若见若闻，合时咨问，然后乃语，为利自他，不作异说。设若有人教令妄语，为护实语，终不妄言，不以此语向彼人说，不持彼事向此人道。二朋先坏，不令增长，有所发言，能善和诤。若痛心语，若麁语，若苦恶语、不喜语、不乐语、不爱语、不入心语、恼他语、结怨语，悉皆远离。有所发言，润语、软语、意乐语、不麁语、悦耳语、美妙语、入心语、多人爱语、多人乐语、可爱语、可乐语、能除怨语，恒作如是种种美妙语。复离绮语，不作异想异语，不作异印异期，覆障实事，不烦广说，不非时语，恒究竟语。舍利弗！如是远离不清净口业，成就清净口业。舍利弗！是名口业清净。","「舍利弗！云何意业清净？于他所有珍宝资财，不起贪著，不起瞋心，远离害心，又离邪见，无诸恶见。舍利弗！远离是等，是名意业清净。","「舍利弗！云何得善友清净？若诸善友，远离妄语，亦不饮酒，离诸麁犷，调伏正见，往诣其所，亲近咨受。又诣诸佛菩萨、缘觉、声闻等所，亲近供养，咨受未闻。舍利弗！是名第四善友清净。","「舍利弗！若善男子、善女人于佛支提施灯明已，得如是等四种清净。」","尔时世尊欲重宣此义，而说偈言：",`「为欲照塔故然灯，　身、口、意业善调伏，
远离邪见具净戒，　由是获得如意眼。
犹如净日照十方，　速能获得于漏尽，
彼大智慧具威德，　得净天眼离尘漏。
智者能了众生意，　亦得通明及辩才，
求二乘道得不难，　由施佛灯获是报。
若求无上佛菩提，　天眼、智慧及财物，
于此三事恒无减，　由灯奉施佛支提。`,"「舍利弗！若善男子、善女人住于大乘，于佛塔庙施灯明已，彼世世中得于八种可乐胜法。何等为八？一者、获胜肉眼；二者、得于胜念，无能测量；三者、得于胜上达分天眼；四者、为于满足修集道故，得不缺戒；五者、得智满足，证于涅槃；六者、先所作善，得无难处；七者，所作善业，得值诸佛，能为一切众生之眼；八者、若善男子、善女人以彼善根得转轮王，所得轮宝不为他障，其身端正；或为帝释，得大威力，具足千眼；或为梵王，善知梵事，得大禅定。舍利弗！以其回向菩提善根，得是八种可乐胜法。","「复次，舍利弗！住于大乘善男子、善女人，复得八种无量胜法：一者、得于无量佛眼；二者、得于无量如来神通；三者、得于无量佛戒；四者、得于无量如来三昧；五者、得于无量如来智慧；六者、得于无量如来解脱；七者、得佛无量解脱知见；八者、得入一切众生心所乐欲。舍利弗！善男子、善女人于佛塔庙奉施灯明，能摄如是无量胜报。","「复次，舍利弗！若有众生见说法者，作如是念：『云何令彼常得宣说、显示佛法？以灯施彼。施油灯故，令说法者得施法灯。』作是念已，持灯奉施，以此布施灯明善根，得于八种无量资粮。何等为八？一者、得于无量正念资粮；二者、得于无量大智资粮；三者、得于无量信心资粮；四者、得于无量精进资粮；五者、得于无量大慧资粮；六者、得于无量三昧资粮；七者、得于无量辩才资粮；八者、得于无量福德资粮。舍利弗！是名施灯八种资粮，亦复得于四无碍辩，乃至次第得一切种智。","「复次，舍利弗！若有善男子、善女人于如来前见他施灯，信心清净，合十指掌，起随喜心，以此善根，得于八种增上之法。何等为八？一者、得增上色；二者、得增上眷属；三者、得增上戒；四者、于人、天中得增上生；五者、得增上信；六者、得增上辩；七者、得增上圣道；八者、得阿耨多罗三藐三菩提。舍利弗！是名八种增上之法。舍利弗！何故能得此等八种增上胜法？舍利弗！佛有无量戒、定、智慧、解脱、解脱知见故，供养彼者，所得果报、所得利益亦复无量。」","尔时世尊欲重宣此义，而说偈言：",`「造作出离行，　勤修于佛法，
弃舍死军众，　如象碎花林。」`,"尔时佛告慧命舍利弗：「有五种法最为难得：一者、得人身难；二者、于佛正法得信乐难；三者、乐于佛法，得出家难；四者、具净戒难；五者、得漏尽难。舍利弗！一切众生于是五法最为难得，汝等已得。」","尔时世尊欲重宣前义，劝舍利弗等而说偈言：",`「如来支提修布施，　为利众生求菩提，
智者造作此胜因，　生生常得最胜报。
于天人中受胜生，　为人天等修供养，
譬如须弥安不动，　光明普遍照十方。
彼天众见皆恭敬，　亦复爱乐生信心，
彼兴供养亦赞美，　一切皆喜数数见。
奇哉是天福德相，　犹梵天光照梵宫，
此天曾作何等业，　身光明炎得如是？
见是谁不修习善？　谁不修学圣种戒？
谁见牟尼生厌心？　谁闻妙法而放逸？
彼昔在于人间时，　常以灯施如来塔，
曾佛法中设供养，　善得福利生天中。
愿我恒得于人身，　于佛法中生净信，
常不放逸住佛道，　宁弃身命不舍法。
获得人身最为难，　愚人云何不为福，
徒费资财不为法，　死已便堕大崄坑。
天见无垢威德已，　心自悔责发愿言：
『愿我常得人间生，　精勤修习于梵行；
愿我最后临终时，　于佛法中得净信；
愿得正念不忘失，　得见无量诸如来。』
为千亿天所供养，　与诸天女相娱乐，
诸天女众皆敬爱，　天女庄严戏园林，
诸方天香皆来熏，　耳闻一切妙音声，
是天随所游行处，　恒得覩见上妙色。
所可见色皆可爱，　彼常不覩诸恶色，
亦复常得胜妙触，　皆由持灯施支提。
从彼没已生人道，　正念处于父母胎，
生已忆彼天中事，　智慧之力不退失。
彼人造作如是业，　得于大力转轮王，
其王形貌极端严，　施灯获得如是报。
由彼业故得命长，　一向清净安乐器，
其身无有诸患痛，　然灯获得如是果。
无有王难、怨贼难，　他人不敢侵其妻，
不为恶人之所恼，　由持灯明施佛故。
安隐丰足无所畏，　豪富自在饶财宝，
得胜璎珞及园林，　斯由然灯奉施佛。
当得覩见佛世尊，　见已心便生敬信，
以欣喜心供养佛，　弃舍王位而出家。
佛无量智究竟智，　具可叹德能化人，
于此佛塔施灯已，　其人身光如灯照。
牟尼牛王清净眼，　以好灯明照彼塔，
得于无漏无上道，　其身光明照十方。
见四真谛具十力，　不共之法亦究竟，
得遍见眼成善逝，　此果皆由布施灯。
设令一切诸众生，　昔曾供养无量佛，
具大威德见实义，　亿劫来成缘觉道。
十方所有诸世界，　悉布灯鬘无有余，
以是世界诸灯鬘，　若人信心供养彼。
是人如是修供养，　于无量劫常不断，
若人一灯奉施佛，　得福过前无有量。
灯油譬如大海水，　其炷犹如须弥山，
有人能然如是灯，　遍照一切诸世界。
是人深心怀敬信，　其志惟求缘觉道，
十方遍置如是灯，　一心恭敬而供养。
若人发于菩提心，　手执草炬暂奉佛，
是人得福过于彼，　我见实义作是说。
十方一切诸众生，　一一供具皆如上，
然经无量恒沙劫，　其心唯求缘觉道。
若有人于佛塔庙，　然于一灯或一礼，
求无上道为众生，　此福过前无有量。
难见难思佛境界，　智者闻即生欣喜，
无信心者闻不乐，　彼愚痴魔坏正法。
证净法界甚为难，　一切世间独善逝，
是故汝等应欣喜，　于佛功德当愿求。」`,"尔时世尊说此法已，慧命舍利弗等，无量天、人、阿修罗、乾闼婆、紧那罗、摩睺罗伽，人非人等，闻佛所说，皆发无上菩提之心，欣喜无量，作礼而去。"],source:"https://cbetaonline.dila.edu.tw/zh/T16n0702",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T16/T16n0702.xml",sourceLabel:"CBETA T16n0702",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說施燈功德經",juan:[1]},{id:"cbeta-t14n0581",title:"佛说八师经",subtitle:"佛说八师经 · 吴 支谦译",paragraphs:["闻如是：","一时佛在舍卫国祇树给孤独园。","时有梵志，名曰耶句，来诣佛所。","阿难白佛言：「有异学梵志今来在外，欲咨所疑。」","天尊曰：「现之。」","梵志乃进，稽首佛足。","天尊曰：「就座。」","梵志就座，须臾退坐曰：「吾闻佛道厥义弘深，汪洋无涯，靡不成就，靡不度生，巍巍堂堂，犹星中月，神智妙达，众圣中王，诸天所不逮，黎民所不闻。愿开盲冥，释其愚痴。所事何师，以致斯尊？」","天尊叹曰：「快哉斯问！开发大行。吾前世师，其名难数；吾今自然神耀得道，非有师也。然有八师，从明得之刑戮；或为王法所见诛治，灭及门族。死入地狱，烧煮、搒掠，万毒皆更，求死不得。罪竟乃出，或为饿鬼，或为畜生，屠割、剥裂，死辄更刃，魂神展转，更相残贼。吾见杀者，其罪如此，不敢复杀。是吾一师。」","佛时颂曰：",`「杀者心不仁，　强弱相伤残，
杀生当过生，　结积累劫怨，
受罪短命死，　惊怖遭暴患；
吾用畏是故，　慈心伏魔宫。」`,"佛言：「二谓盗窃，强劫人财。或为财主刀杖加刑，应时瓦解；或为王法收系著狱，拷掠、榜笞，五毒并至，戮之都市，宗门灰灭。死入地狱，以手捧火，洋铜沃口，求死不得。罪竟乃出，当为饿鬼，意欲饮水，水化为脓，所欲食物，物化成炭，身常负重，众恼自随。或为畜生，死辄更刃，以肉供人，偿其宿债。吾见盗者，其罪如此，不敢复盗。是吾二师。」","佛时颂曰：",`「盗者不与取，　劫窃人财宝，
亡者无多少，　忿恚怀忧恼，
死受六畜身，　偿其宿债负；
吾用畏是故，　弃家行学道。」`,"佛言：「三谓邪婬，犯人妇女。或为夫主、边人所知，临时得殃，刀杖加刑；或为王法收系著狱，酷毒掠治，戮之都市。死入地狱，卧之铁床；或抱铜柱，狱鬼然火，以烧其身。地狱罪毕，当更畜生。若复为人，闺门婬乱，违佛远法，不亲贤众，常怀恐怖，多危少安。吾见是故，不敢邪婬。是吾三师。」","佛时颂曰：",`「婬为不净行，　迷惑失正道，
精神魂魄驰，　伤命而早夭，
受罪顽痴荒，　死复堕恶道；
吾用畏是故，　弃家乐林薮。」`,"佛言：「四谓恶口、两舌、妄言、绮语。谮入无罪，谤毁三尊，舌致捶杖，亦致灭门。死入地狱，狱中鬼神拔出其舌以牛犁之；洋铜灌口，求死不得。罪毕乃出，当为畜生，恒食草棘。若后为人，言不见信，口中恒臭，多逢谮谤、骂詈之声，卧辄恶梦，有口不能得含佛经之至味。吾见是故，不敢恶口。是吾四师。」","佛时颂曰：",`「欺者有四过，　谗侫伤良贞，
受罪痴聋盲，　蹇吃口臭腥，
痴狂不能言，　死入拔舌囹；
吾修四净口，　自致八音声。」`,"佛言：「五谓嗜酒。酒为毒气，主成诸恶——王道毁，仁泽灭，臣慢上，忠敬朽，父失礼，母失慈，子凶逆，孝道败，夫失信，妇奢婬，九族诤，财产耗——亡国危身，无不由之。酒之乱道，三十有六。吾见是故，绝酒不饮。是吾五师。」","佛时颂曰：",`「醉者为不孝，　怨祸从内生，
迷惑清高士，　乱德败淑贞。
吾故不饮酒，　慈心济群生，
净慧度八难，　自致觉道成。」`,"佛言：「六谓年老。夫老之为苦，头白，齿落，目视𥆨𥆨，耳听不聪，盛去衰至，皮缓面皱，百节痛疼，行步苦极，坐起呻吟，忧悲恼苦；识神转灭，便旋即忘；命日促尽，言之流涕。吾见无常，灾变如斯，故行求道，不欲更之。是吾六师。」","佛时颂曰：",`「吾念世无常，　人生要当老，
盛去日衰羸，　形枯而白首，
忧劳百病生，　坐起愁痛恼；
吾用畏是故，　弃家行学道。」`,"佛言：「七谓病瘦。肉尽骨立，百节皆痛，犹被杖楚；四大进退，手足不任；气力虚竭，坐卧须人；口燥唇燋，筋断鼻坼；目不见色，耳不闻音；不净流出，身卧其上；心怀苦恼，言辄悲哀。今覩世人年盛力壮，华色𬀩晔，福尽罪至，无常百变。吾覩斯患，故行求道，不欲更之。是吾七师。」","佛时颂曰：",`「念人衰老时，　百病同时生，
水消而火灭，　刀风解其形，
骨离筋脉绝，　大命要当倾；
吾用畏是故，　求道愿不生。」`,"佛言：「八谓人死。四百四病同时俱作；四大欲散，魂神不安；风去息绝，火灭身冷，风先火次，魂灵去矣；身体挺直，无所复知；旬日之间肉坏血流，膖胀烂臭，无一可取；身中有虫，还食其肉；筋脉烂尽，骨节解散，髑髅异处，脊、胁、肩、臂、䏶、胫、足、指各自异处；飞鸟、走兽竞来食之。天、龙、鬼神、帝王、人民、贫富、贵贱无免此患。吾见斯变，故行求道，不欲更之。是吾八师。」","佛时颂曰：",`「我惟老病死，　三界之大患，
福尽而命终，　气绝于黄泉，
身烂还为土，　魂魄随因缘；
吾用畏是故，　学道升泥洹。」`,"于是梵志闻佛所说，心开意解，即得道迹，前受五戒，为清信士——不杀，不盗，不婬，不欺，奉孝，不醉——欢喜而去。"],source:"https://cbetaonline.dila.edu.tw/zh/T14n0581",complete:!0,sourceXml:"https://raw.githubusercontent.com/cbeta-org/xml-p5/dbdea41071e1e260ad84b72faefd4587333cf76d/T/T14/T14n0581.xml",sourceLabel:"CBETA T14n0581",scope:"全1卷正文（不含序跋、目录、附录）",originalTitle:"佛說八師經",juan:[1]}];export{n as s};
